------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/logs/2022.10.26-11.49.08.log.txt
  log type:  text
 opened on:  26 Oct 2022, 11:49:08

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 26 Oct 2022 11:49:08

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmata
> sp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. do "$working_ANALYSIS/scripts/02_generate.do"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 02_generate.do
. * PURPOSE: generates additional variables used in the analysis
. *--------------------------------------------------------------------------------------
. 
. 
. 
. clear

. use "$working_ANALYSIS\processed\data_clean.dta"

. 
. // GAME 1: PROCEDURAL FAIRNESS
. 
. rename rule_1 rule1

. rename rule_2 rule2

. rename rule_3 rule3

. rename rule_4 rule4

. rename rule_bonus_1 rule5

. rename rule_bonus_2 rule6

. 
. rename vote_1 vote1

. rename vote_2 vote2

. rename vote_3 vote3

. rename vote_4 vote4

. rename vote_bonus_1 vote5

. rename vote_bonus2 vote6

. 
. rename majority_1 majority1

. rename majority_2 majority2

. rename majority_3 majority3

. rename majority_4 majority4

. rename majority_bonus1 majority5

. rename majority_bonus2 majority6

. 
. 
. // Create dummies for democratic and autocratic choices
. *democratic
. gen dem1=0

. replace dem1=1 if rule1==1
(41 real changes made)

. gen dem2=0

. replace dem2=1 if rule2==1
(39 real changes made)

. gen dem3=0

. replace dem3=1 if rule3==1
(44 real changes made)

. gen dem4=0

. replace dem4=1 if rule4==1
(37 real changes made)

. gen dem5=0

. replace dem4=1 if rule5==1
(10 real changes made)

. gen dem6=0

. replace dem4=1 if rule6==1
(5 real changes made)

. egen dem7 = rowmean(dem1 dem2 dem3 dem4)

. 
. *dictator
. gen dic1=0

. replace dic1=1 if rule1==2
(9 real changes made)

. gen dic2=0

. replace dic2=1 if rule2==2
(12 real changes made)

. gen dic3=0

. replace dic3=1 if rule3==2
(7 real changes made)

. gen dic4=0

. replace dic4=1 if rule4==2
(7 real changes made)

. gen dic5=0

. replace dic5=1 if rule5==2
(3 real changes made)

. gen dic6=0

. replace dic6=1 if rule6==2
(2 real changes made)

. 
. *pseudo-democratic
. gen fake1=0

. replace fake1=1 if rule1==3
(14 real changes made)

. gen fake2=0

. replace fake2=1 if rule2==3
(13 real changes made)

. gen fake3=0

. replace fake3=1 if rule3==3
(13 real changes made)

. gen fake4=0

. replace fake4=1 if rule4==3
(20 real changes made)

. gen fake5=0

. replace fake5=1 if rule5==3
(20 real changes made)

. gen fake6=0

. replace fake6=1 if rule6==3
(21 real changes made)

. 
. replace rule1=1 if dem1==1
(0 real changes made)

. replace rule1=2 if fake1==1
(14 real changes made)

. replace rule1=3 if dic1==1
(9 real changes made)

. replace rule2=1 if dem2==1
(0 real changes made)

. replace rule2=2 if fake2==1
(13 real changes made)

. replace rule2=3 if dic2==1
(12 real changes made)

. replace rule3=1 if dem3==1
(0 real changes made)

. replace rule3=2 if fake4==1
(17 real changes made)

. replace rule3=3 if dic4==1
(4 real changes made)

. replace rule4=1 if dem4==1
(15 real changes made)

. replace rule4=2 if fake4==1
(20 real changes made)

. replace rule4=3 if dic4==1
(7 real changes made)

. replace rule5=1 if dem5==1
(0 real changes made)

. replace rule5=2 if fake5==1
(20 real changes made)

. replace rule5=3 if dic5==1
(3 real changes made)

. replace rule6=1 if dem6==1
(0 real changes made)

. replace rule6=2 if fake6==1
(21 real changes made)

. replace rule6=3 if dic6==1
(2 real changes made)

. 
. *subsample autocratic rule choices
. gen pseudo1=0

. replace pseudo1=1 if rule1==3
(9 real changes made)

. replace pseudo1=. if rule1==1
(41 real changes made, 41 to missing)

. gen pseudo2=0

. replace pseudo2=1 if rule2==3
(12 real changes made)

. replace pseudo2=. if rule2==1
(39 real changes made, 39 to missing)

. gen pseudo3=0

. replace pseudo3=1 if rule3==3
(11 real changes made)

. replace pseudo3=. if rule3==1
(31 real changes made, 31 to missing)

. gen pseudo4=0

. replace pseudo4=1 if rule4==3
(7 real changes made)

. replace pseudo4=. if rule4==1
(37 real changes made, 37 to missing)

. egen pseudo_all = rowmean(pseudo1 pseudo2 pseudo3 pseudo4)
(25 missing values generated)

. 
. *same rule across all three rounds
. gen stable_rule=0

. replace stable_rule=1 if rule1==rule5==rule6
(30 real changes made)

. 
. *game1_group
. *devide each village into two groups of game 1: TL or DEL (13=TL, 14=DEL)?
. gen game1_group = 13

. replace game1_group =14 if session_id==1 | session_id==2 | session_id==5 | session_id==6 | session_id==9 | session_id==10 | session_id==14
(224 real changes made)

. order game1_group, before(vote1)

. 
. *villager_preference1
. *now the villager preferences, i.e. majority without leader (6 villager per group, a draw is therefore possible)
. * villager_preference1 ("A", "B" or "draw") gives the preferences of the six villager (without leader) in the first decision of game 1
. egen count_A = total(vote1==1) if id>64, by(village game1_group)
(64 missing values generated)

. order count_A, after(vote1)

. 
. replace count_A = count_A[_n-1] if session_id==13
(0 real changes made)

. replace count_A = count_A[_n-4] if session_id==14
(0 real changes made)

. 
. gen villager_preference1="A"

. replace villager_preference1 = "B" if count_A<3
(276 real changes made)

. replace villager_preference1 = "draw" if count_A==3
variable villager_preference1 was str1 now str4
(72 real changes made)

. order villager_preference1, after(vote1)

. label variable villager_preference "majority vote of 6 villagers over distribution A and B"

. 
. 
. drop count_A

. 
. *Bonus order
. gen bonus_order=. if id >64
(448 missing values generated)

. replace bonus_order=1 if  randomization<7
(38 real changes made)

. replace bonus_order=0 if  randomization>6 
(410 real changes made)

. label def bonus_order 1 "Small first" 0 "Large first", replace

. lab val bonus_order bonus_order

. 
. *Identifier for first bonus that was offered to leaders
. gen rule_bonus_first = rule5 if bonus_order==1
(414 missing values generated)

. replace rule_bonus_first = rule6 if bonus_order==0
(30 real changes made)

. gen rule_bonus_second = rule5 if bonus_order==0
(418 missing values generated)

. replace rule_bonus_second = rule6 if bonus_order==1
(34 real changes made)

. 
. *New variable to identify baseline rule choices
. gen rule_base=rule1
(384 missing values generated)

. lab def rulebasic 1 "Base: Democratic" 2 "Base: Pseudo" 3 "Base: Dictator", replace

. lab val rule_base rulebasic

. bysort village game1_group: egen group_rule_base = mean(rule_base)

. lab val group_rule_base rulebasic

. tab group_rule_base, gen(rule_base)

 group_rule_base |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base: Democratic |        287       64.06       64.06
    Base: Pseudo |         98       21.88       85.94
  Base: Dictator |         63       14.06      100.00
-----------------+-----------------------------------
           Total |        448      100.00

. 
. * label rule choices consistently
. lab def rule 1 "Democratic" 2 "Pseudo-democratic" 3 "Autocratic" , replace

. foreach x of varlist rule1 rule5 rule6 rule_bonus_first rule_bonus_second {
  2.         lab val `x' rule
  3.         }

. 
. *payoff1, payoff5, payoff6
. *what do these villagers get?
. *Basic
. gen payoff1 = 0 if id<65
(384 missing values generated)

. replace payoff1 = 1 if (id<65) & ((rule1==1 & majority1=="B") | (rule1!=1 & vote1==2))
(41 real changes made)

. label variable payoff1 "distribution A or B that is paid to the group in decision 1"

. 
. *Small Bonus
. gen payoff5 = 0 if id<65
(384 missing values generated)

. replace payoff5 = 1 if (id<65) & ((rule5==1 & majority5=="B") | (rule5!=1 & vote5==2))
(40 real changes made)

. label variable payoff5 "distribution A or B that is paid to the group in small bonus"

. 
. *Large Bonus
. gen payoff6 = 0 if id<65
(384 missing values generated)

. replace payoff6 = 1 if (id<65) & ((rule6==1 & majority6=="B") | (rule6!=1 & vote6==2))
(42 real changes made)

. label variable payoff6 "distribution A or B that is paid to the group in large bonus"

. 
. lab def payoff_lab 0 "A" 1 "B"

. foreach var of varlist payoff1 payoff5 payoff6 {
  2.         lab val `var' payoff_lab
  3.         }

.         
. order payoff1 payoff5 payoff6, after(villager_preference1)

. gsort village game1_group -session_id

. 
. by village game1_group: replace payoff1 = payoff1[_n-1] if missing(payoff1)
(384 real changes made)

. by village game1_group: replace payoff5 = payoff5[_n-1] if missing(payoff5)
(384 real changes made)

. by village game1_group: replace payoff6 = payoff6[_n-1] if missing(payoff6)
(384 real changes made)

. 
. sort village session_id

. 
. 
. 
. // Leadertypes based on baseline stage 1 & stage 2 decisions
. gen true_democrat=0

. replace true_democrat=1 if rule1==1 
(41 real changes made)

. gen pseudo_democrat=0

. replace pseudo_democrat=1 if rule1==2 & vote1==1
(9 real changes made)

. gen paternalistic=0

. replace paternalistic=1 if rule1==2 & vote1==2
(5 real changes made)

. gen dictator=0

. replace dictator=1 if rule1==3 & vote1==1
(6 real changes made)

. gen benevolent_dictator=0

. replace benevolent_dictator=1 if rule1==3 & vote1==2
(3 real changes made)

. 
. gen leader_type=1 if true_democrat==1
(407 missing values generated)

. replace leader_type=2 if pseudo_democrat==1
(9 real changes made)

. replace leader_type=3 if paternalistic==1
(5 real changes made)

. replace leader_type=4 if dictator==1
(6 real changes made)

. replace leader_type=5 if benevolent_dictator==1
(3 real changes made)

. lab def lab_types 1 "True-democrat" 2 "Pseudo-democrat" 3 "Paternalist" 4 "Autocrat" 5 "Benevolent-Autocrat"

. lab val leader_type lab_types

. 
. 
. bysort village game1_group: egen group_leader_type = mean(leader_type)

. lab val group_leader_type lab_types

. 
. lab def vote_lab 1 "Distribution A" 2 "Distribution B"

. lab val vote1 vote_lab

. tab group_leader_type, gen(leader_type)

  group_leader_type |      Freq.     Percent        Cum.
--------------------+-----------------------------------
      True-democrat |        287       64.06       64.06
    Pseudo-democrat |         63       14.06       78.13
        Paternalist |         35        7.81       85.94
           Autocrat |         42        9.38       95.31
Benevolent-Autocrat |         21        4.69      100.00
--------------------+-----------------------------------
              Total |        448      100.00

. 
. 
. 
. ************************************
. *** 1C: Preference game (Game 2)
. 
. gen social_type=6 

. replace social_type = 1 if decision1==1 & decision2==1 & decision3==1
(228 real changes made)

. replace social_type = 2 if decision1==1 & decision2==1 & decision3==2
(51 real changes made)

. replace social_type = 3 if decision1==1 & decision2==2 & decision3==1
(61 real changes made)

. replace social_type = 4 if decision1==1 & decision2==2 & decision3==2
(32 real changes made)

. replace social_type = 5 if decision1==2 & decision2==1 & decision3==2
(24 real changes made)

. 
. gen social_type2 =.
(448 missing values generated)

. replace social_type2=1 if (social_type==1 | social_type==2)
(279 real changes made)

. replace social_type2=2 if (social_type==3 | social_type==4)
(93 real changes made)

. replace social_type2=3 if social_type==5
(24 real changes made)

. replace social_type2=4 if social_type2==. & social_type==6
(52 real changes made)

. 
. # delimit;
delimiter now ;
. label define social
> 1       "Strongly egalitarian"
> 2       "Weakly egalitarian"
> 3   "Strongly generous"
> 4       "Weakly generous"
> 5       "Spiteful"
> 6       "Ambiguous";

. label define social2
> 1       "Egalitarian"
> 2       "Generous"
> 3   "Spiteful"
> 4       "Ambiguous";

. # delimit cr
delimiter now cr
. label values  social_type social

. label values  social_type2 social2

. 
. 
. 
. // Gen dummy for no education
. gen no_educ = 0 if education>0 & education!=.
(44 missing values generated)

. replace no_educ =1 if education==0
(41 real changes made)

. 
. // age-squared
. gen age_sq = age*age
(1 missing value generated)

. 
. // intrinsic motivation - binary variable:
. * Based on the definition of Frey & Oberholzer (1997) ->
. * intrinsic(=1): one likes to do them or because the individual derives some satisfaction from doing  his or her duty
. *extrinsic(=0): activated from the outside
. * if there are both intrinsic and extrinsic motives mentioned, the variable takes the value 1 - there can be some intrinsic motives crowded out by the bonus paymen 
. 
. gen motivation=.
(448 missing values generated)

. replace motivation=0 if f6=="accepted because people but trust in her"
(1 real change made)

. replace motivation=0 if f6=="just accepted what the villagers voted."
(1 real change made)

. replace motivation=1 if f6=="to help the community mantain water"
(1 real change made)

. replace motivation=1 if f6=="because I believe that I was born with characteristic of a leader."
(1 real change made)

. replace motivation=0 if f6=="i just accepted because the villagers appointed me"
(1 real change made)

. replace motivation=1 if f6=="to lead the community. A calling from god. Care for the community"
(1 real change made)

. replace motivation=1 if f6=="to train the committee members to be in goood communication / relationship with tap users"
(1 real change made)

. replace motivation=1 if f6=="accepted the task attributed to him and help his community"
(1 real change made)

. replace motivation=0 if f6=="just accepted the vote"
(2 real changes made)

. replace motivation=1 if f6=="Assist and meet the needs of the villagers"
(1 real change made)

. replace motivation=1 if f6=="to care and protect the use of water"
(1 real change made)

. replace motivation=0 if f6=="he was chosen and just accepted"
(1 real change made)

. replace motivation=0 if f6=="accepted responsibility"
(1 real change made)

. replace motivation=1 if f6=="to lead the community"
(2 real changes made)

. replace motivation=1 if f6=="volunteer to help bring water to the village, help the community"
(1 real change made)

. replace motivation=1 if f6=="to lead the community"
(0 real changes made)

. replace motivation=1 if f6=="help his community"
(1 real change made)

. replace motivation=0 if f6=="was obliged, to lead the village, to bring development to the village"
(1 real change made)

. replace motivation=1 if f6=="guarantee availability of water"
(1 real change made)

. replace motivation=0 if f6=="Accepted because it is a calling by God. Did not want to disappoint the father and villagers."
(1 real change made)

. replace motivation=1 if f6=="to help the community, to keep or take care of the water pipes"
(1 real change made)

. replace motivation=1 if f6=="to fight for the good of the community. To bring it up to standard."
(1 real change made)

. replace motivation=0 if f6=="because there was a lack of people to be in the committee"
(1 real change made)

. replace motivation=0 if f6=="accepted because there was no on else to care and protect the community and it's members"
(1 real change made)

. replace motivation=1 if f6=="arrange meetings, have better / good communication with village, report to senior headman"
(1 real change made)

. replace motivation=0 if f6=="I just accepted the position, because the villagers wanted me to lead them."
(1 real change made)

. replace motivation=1 if f6=="to take care of the water tap"
(1 real change made)

. replace motivation=1 if f6=="lead the community. Care for the community"
(1 real change made)

. replace motivation=1 if f6=="keep water in the community"
(1 real change made)

. replace motivation=0 if f6=="There was no election. Just accepted to be the headman as my father appointed me."
(1 real change made)

. replace motivation=1 if f6=="to lead the community, to take of the water tap"
(1 real change made)

. replace motivation=0 if f6=="just accepted a responsibility given by elders and villagers."
(1 real change made)

. replace motivation=1 if f6=="serving the community, take care of water related needs"
(1 real change made)

. replace motivation=1 if f6=="to lead the community as given by god."
(1 real change made)

. replace motivation=1 if f6=="care and protect the tap, sustain water"
(1 real change made)

. replace motivation=0 if f6=="Just accepted because my late father appointed me and also the villagers trusted/trust me to lead them"
(1 real change made)

. replace motivation=0 if f6=="was appointed to be one of the candidates, just accepted the result of the vote"
(1 real change made)

. replace motivation=0 if f6=="just accepted because people trusted me."
(1 real change made)

. replace motivation=1 if f6=="was given a responsibility and accepted, wanted to help bring private taps to village"
(1 real change made)

. replace motivation=0 if f6=="took over family duties. Was not willing to give the village away to a stranger or another family."
(1 real change made)

. replace motivation=1 if f6=="to keep taps in good condition, to arrange meetings, wotk with community members"
(1 real change made)

. replace motivation=0 if f6=="just accepted the responsibility, because the villagers accepted me as their headman."
(1 real change made)

. replace motivation=0 if f6=="just accepted, because the community voted him"
(1 real change made)

. replace motivation=1 if f6=="to lead the nation. To care for community members. Help provide for community members."
(1 real change made)

. replace motivation=0 if f6=="Accepted villagers decision"
(1 real change made)

. replace motivation=0 if f6=="I just accepted as a calling from God."
(1 real change made)

. replace motivation=1 if f6=="to help develop the village"
(1 real change made)

. replace motivation=0 if f6=="just accepted to lead the villagers, because they appointed/elected me."
(1 real change made)

. replace motivation=1 if f6=="to assist the community, accepted a responsibility given to him by the villagers, help develop the community"
(1 real change made)

. replace motivation=0 if f6=="i just accepted"
(1 real change made)

. replace motivation=1 if f6=="to help develop the village, improve water supply"
(1 real change made)

. replace motivation=0 if f6=="There was no motive, just accepted."
(1 real change made)

. replace motivation=0 if f6=="just accepted the vote"
(0 real changes made)

. replace motivation=1 if f6=="to lead the community. To help develop the community. To help improve people's/community member's lives."
(1 real change made)

. replace motivation=1 if f6=="help out the villagers without expectations"
(1 real change made)

. replace motivation=0 if f6=="" /*leader gave no answer - we set his intrinsic-motivation to 0*/
(385 real changes made)

. replace motivation=0 if f6=="just accepted votes & didnt volunteer to be a candidate"
(1 real change made)

. replace motivation=1 if f6=="A God given gift/role. Did not want to disappoint community members. Lead the community."
(1 real change made)

. replace motivation=0 if f6=="just accepted, because the people voted me"
(1 real change made)

. replace motivation=1 if f6=="God given responsibility as well as responsibility from family and community members. Lead and care for the community."
(1 real change made)

. replace motivation=1 if f6=="to care for taps and the community"
(1 real change made)

. replace motivation=0 if f6=="I just accepted the responsibility"
(1 real change made)

. replace motivation=1 if f6=="wanted to bring taps to the village, especially for drinking water purposes, used to drink from wells"
(1 real change made)

. replace motivation=1 if f6=="assist every community member"
(1 real change made)

. replace motivation=. if id>64
(384 real changes made, 384 to missing)

. lab def motivation 0 "extrinsic" 1 "intrinsic", replace

. lab val motivation motivation

. gen extrinsic_leader = 1 if motivation==0
(419 missing values generated)

. replace extrinsic_leader = 0 if motivation==1
(35 real changes made)

. lab def extrensic 0 "Intrinsic" 1 "Extrinsic", replace

. lab val extrinsic_leader extrensic

. bysort village game1_group: egen group_extrinsic_leader = mean(extrinsic_leader)

. 
. 
. // PERCEPTION OF LEADERS PERFORMANCE BY VILLAGERS
. lab def agree1 1 "strongly disagree" 2 "disagree a little" 3 "neutral" 4 "agree a little" 5 "strongly agree"

. 
. * synchronize scales
. foreach v of varlist b12satisfactionTL b10b {
  2.         replace `v'=5 if `v'==.
  3.         local i = `i' + 1
  4.         gen e_`i'=1 if `v'==4
  5.         replace e_`i'=2 if `v'==3
  6.         replace e_`i'=3 if `v'==5
  7.         replace e_`i'=4 if `v'==2
  8.         replace e_`i'=5 if `v'==1
  9.         replace e_`i'=. if villager==0
 10.         lab val e_`i' agree1
 11.         }
(69 real changes made)
(446 missing values generated)
(1 real change made)
(73 real changes made)
(35 real changes made)
(337 real changes made)
(64 real changes made, 64 to missing)
(69 real changes made)
(444 missing values generated)
(5 real changes made)
(99 real changes made)
(41 real changes made)
(299 real changes made)
(64 real changes made, 64 to missing)

. 
. foreach v of varlist b11g b8b b11f b8c b11h b8d {
  2.         replace `v'=5 if `v'==.
  3.         local i = `i' + 1
  4.         gen e_`i'=1 if `v'==1
  5.         replace e_`i'=2 if `v'==2
  6.         replace e_`i'=3 if `v'==5
  7.         replace e_`i'=4 if `v'==3
  8.         replace e_`i'=5 if `v'==4
  9.         replace e_`i'=. if villager==0
 10.         lab val e_`i' agree1
 11.         }
(91 real changes made)
(424 missing values generated)
(8 real changes made)
(91 real changes made)
(19 real changes made)
(306 real changes made)
(64 real changes made, 64 to missing)
(131 real changes made)
(426 missing values generated)
(13 real changes made)
(131 real changes made)
(30 real changes made)
(252 real changes made)
(64 real changes made, 64 to missing)
(98 real changes made)
(431 missing values generated)
(6 real changes made)
(98 real changes made)
(25 real changes made)
(302 real changes made)
(64 real changes made, 64 to missing)
(208 real changes made)
(391 missing values generated)
(11 real changes made)
(208 real changes made)
(24 real changes made)
(148 real changes made)
(64 real changes made, 64 to missing)
(152 real changes made)
(193 missing values generated)
(10 real changes made)
(152 real changes made)
(6 real changes made)
(25 real changes made)
(64 real changes made, 64 to missing)
(185 real changes made)
(232 missing values generated)
(8 real changes made)
(185 real changes made)
(8 real changes made)
(31 real changes made)
(64 real changes made, 64 to missing)

. 
. *TL specific satisfaction items
. foreach v of varlist b11b b11c b11d b11e b11f b11g b11h {
  2.         replace `v'=5 if `v'==.
  3.         local j = `j' + 1
  4.         gen opinionTL_`j'=1 if `v'==1
  5.         replace opinionTL_`j'=2 if `v'==2
  6.         replace opinionTL_`j'=3 if `v'==5
  7.         replace opinionTL_`j'=4 if `v'==3
  8.         replace opinionTL_`j'=5 if `v'==4
  9.         replace opinionTL_`j'=. if villager==0
 10.         lab val opinionTL_`j' agree1
 11.         }
(207 real changes made)
(245 missing values generated)
(5 real changes made)
(207 real changes made)
(9 real changes made)
(24 real changes made)
(64 real changes made, 64 to missing)
(116 real changes made)
(418 missing values generated)
(8 real changes made)
(116 real changes made)
(25 real changes made)
(269 real changes made)
(64 real changes made, 64 to missing)
(84 real changes made)
(433 missing values generated)
(6 real changes made)
(84 real changes made)
(23 real changes made)
(320 real changes made)
(64 real changes made, 64 to missing)
(126 real changes made)
(421 missing values generated)
(7 real changes made)
(126 real changes made)
(19 real changes made)
(269 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(431 missing values generated)
(6 real changes made)
(98 real changes made)
(25 real changes made)
(302 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(424 missing values generated)
(8 real changes made)
(91 real changes made)
(19 real changes made)
(306 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(193 missing values generated)
(10 real changes made)
(152 real changes made)
(6 real changes made)
(25 real changes made)
(64 real changes made, 64 to missing)

. *scale all items so that higher agreement indicates higher satisfaction
. gen opinionTL_1reverse = 6-opinionTL_1
(64 missing values generated)

. gen opinionTL_7reverse = 6-opinionTL_7
(64 missing values generated)

. 
. alpha e_1 opinionTL_1reverse opinionTL_2 opinionTL_3 opinionTL_4 opinionTL_5 opinionTL_6 opinionTL_7reverse 

Test scale = mean(unstandardized items)

Average interitem covariance:     .3230128
Number of items in the scale:            8
Scale reliability coefficient:      0.7473

. * alpha=0.75 pretty reliable scale, can reduce dimensionality
. *start with simple additative index, 
. egen mean_satisfactionTL = rowmean (e_1 opinionTL_1reverse opinionTL_2 opinionTL_3 opinionTL_4 opinionTL_5 opinionTL_6 opinionTL_7)
(64 missing values generated)

. 
. *DEL specific satisfaction  items
. foreach v of varlist b8a b8b b8c b8d {
  2.         replace `v'=5 if `v'==.
  3.         local k = `k' + 1
  4.         gen opinionDEL_`k'=1 if `v'==1
  5.         replace opinionDEL_`k'=2 if `v'==2
  6.         replace opinionDEL_`k'=3 if `v'==5
  7.         replace opinionDEL_`k'=4 if `v'==3
  8.         replace opinionDEL_`k'=5 if `v'==4
  9.         replace opinionDEL_`k'=. if villager==0
 10.         lab val opinionDEL_`k' agree1
 11.         }
(208 real changes made)
(401 missing values generated)
(16 real changes made)
(208 real changes made)
(36 real changes made)
(141 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(426 missing values generated)
(13 real changes made)
(131 real changes made)
(30 real changes made)
(252 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(391 missing values generated)
(11 real changes made)
(208 real changes made)
(24 real changes made)
(148 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(232 missing values generated)
(8 real changes made)
(185 real changes made)
(8 real changes made)
(31 real changes made)
(64 real changes made, 64 to missing)

. *scale all items so that higher agreement indicates higher satisfaction
. gen opinionTL_4reverse = 6-opinionTL_4
(64 missing values generated)

. 
. alpha e_2 opinionDEL_1 opinionDEL_2 opinionDEL_3 opinionTL_4reverse

Test scale = mean(unstandardized items)
Reversed item:  opinionTL_4reverse

Average interitem covariance:     .2561201
Number of items in the scale:            5
Scale reliability coefficient:      0.5149

. * alpha=0.52 less reliable
. *start with simple additative index, 
. egen mean_satisfactionDEL = rowmean (e_2 opinionDEL_1 opinionDEL_2 opinionDEL_3 opinionTL_4reverse)
(64 missing values generated)

. 
. 
. *generate satisfaction dependent on which leaders villagers were matched with in game 1
. gen satisfaction_TL = mean_satisfactionTL
(64 missing values generated)

. replace satisfaction_TL = . if game1_group!=13
(192 real changes made, 192 to missing)

. gen satisfaction_DEL = mean_satisfactionDEL
(64 missing values generated)

. replace satisfaction_DEL = . if game1_group!=14
(192 real changes made, 192 to missing)

. egen satisfaction_leader = rowmean (satisfaction_TL satisfaction_DEL)
(64 missing values generated)

. lab val satisfaction_leader agree1

. lab var satisfaction_leader "Leader satisfaction index (decision-making, exploitation, etc.)"

. egen z_satisfaction = std(satisfaction_leader)
(64 missing values generated)

. 
. *Satisfaction with performance of DEL / TL
. gen performance_TL = e_1
(64 missing values generated)

. replace performance_TL = . if game1_group!=13
(192 real changes made, 192 to missing)

. gen performance_DEL = e_2
(64 missing values generated)

. replace performance_DEL = . if game1_group!=14
(192 real changes made, 192 to missing)

. egen performance_leader = rowmean (performance_TL performance_DEL)
(64 missing values generated)

. lab val performance_leader agree1

. lab var performance_leader "How satisfied are you with the peformance of the TL/DEL?"

. 
. *label variables
. label var e_1 "Satisfied with the chief in general?"

. label var e_2 "Satisfied with the DEL in general?"

. label var e_3 "The Chief makes decisions in an understandable manner?"

. label var e_4 "The DEL makes decisions in an understandable manner?"

. label var e_5 "The Chief takes appropriate actions against people who disobey the rules?"

. label var e_6 "The DEL takes appropriate actions against people who disobey the rules?"

. label var e_7 "Does the chief exploit his or her position?"

. label var e_8 "Does the DEL exploit his or her position?"

. 
. *Combined Index of leader quality
. gen reverse_e7 = 6-e_7
(64 missing values generated)

. alpha e_1 e_3 e_5 reverse_e7

Test scale = mean(unstandardized items)

Average interitem covariance:     .2492895
Number of items in the scale:            4
Scale reliability coefficient:      0.5633

. 
. 
. ***************************
. **** BIG FIVE
. /*
> Rammstedt, B. & John, O. P. (2007). Measuring personality in one minute or less: A 10-item short version of the Big Five Inventory in English and German. 
> Journal of Research in Personality, 41, 203-212. 
> 
> De Young et al. 2010 Psych. Science: Neuroticism covaried with volume of brain regions associated with threat, punishment, and negative affect. 
> http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3049165/
> 
> 
> Positively formualed items: c29, c25, c28, c32, c34
> Negatively formulated items: c26, c27, c30, c31, c33
> */
. 
. *** 1. Step, gen new variables
. foreach var of varlist c25-c34{
  2. replace `var'=. if `var'==5
  3. gen `var'new = `var'
  4. }
(0 real changes made)
(389 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)

. 
. *** 2. Step, recode negatively formulated items ***
. foreach var of varlist c26new c27new c30new c31new c33new{
  2. recode `var' (1=4) (2=3) (3=2) (4=1)
  3. }
(c26new: 64 changes made)
(c27new: 64 changes made)
(c30new: 64 changes made)
(c31new: 64 changes made)
(c33new: 64 changes made)

. quietly tab c26 c26new

. quietly tab c27 c27new

. sum c25-c34     /* we have missings for c25, otherwise complete info*/

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         c25 |         59    2.559322     1.47708          1          4
         c26 |         64    2.328125     1.43709          1          4
         c27 |         64    2.421875    1.499256          1          4
         c28 |         64     2.59375     1.46622          1          4
         c29 |         64     2.65625     1.48237          1          4
-------------+---------------------------------------------------------
         c30 |         64     2.90625    1.317992          1          4
         c31 |         64    2.671875    1.369216          1          4
         c32 |         64      2.6875    1.467911          1          4
         c33 |         64     2.90625    1.399759          1          4
         c34 |         64    2.640625    1.505199          1          4

. 
. *** 3. Step: Build variables ***
. /* Higher values mean more agreeable, extraverted etc. */  
. gen extraversion=(c29new+c26new)/2 if leader!=. 
(384 missing values generated)

. gen agreeableness=(c25new+c31new)/2 if leader!=. & c25!=.
(389 missing values generated)

. replace agreeableness=c31new if leader!=. & c25==.
(5 real changes made)

. gen conscientiousness=(c32new+c27new)/2 if leader!=.
(384 missing values generated)

. gen neuroticism=(c33new+c28new)/2 if leader!=.
(384 missing values generated)

. gen openness=(c34new+c30new)/2 if leader!=.
(384 missing values generated)

. 
. *** 4. Step: test for scale reliability (Cronbach's alpha)
. alpha c29new c26new             /*extraversion: 0.86*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.615575
Number of items in the scale:            2
Scale reliability coefficient:      0.8624

. alpha c25new c31new, item       /*agreeableness: 0.81*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.384278
Number of items in the scale:            2
Scale reliability coefficient:      0.8128

. alpha c32new c27new     /*Conscientiousness: 0.92 */

Test scale = mean(unstandardized items)

Average interitem covariance:     1.866071
Number of items in the scale:            2
Scale reliability coefficient:      0.9176

. alpha c33new c28new     /*neuroticism: 0.76 */

Test scale = mean(unstandardized items)

Average interitem covariance:      1.24504
Number of items in the scale:            2
Scale reliability coefficient:      0.7547

. alpha c34new c30new     /*openness: 0.49*/

Test scale = mean(unstandardized items)

Average interitem covariance:     .6532738
Number of items in the scale:            2
Scale reliability coefficient:      0.4922

. 
. *** 5. Step: Standardize BIG5 measures
. foreach var of varlist extraversion-openness{
  2. sum `var'
  3. gen `var'_normal = (`var'-r(min))/(r(max)-r(min))
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
extraversion |         64    2.664063     1.36874          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
agreeablen~s |         64    2.492188    1.310798          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
conscienti~s |         64    2.632813    1.426067          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 neuroticism |         64     2.34375    1.284446          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    openness |         64    2.367188    1.152093          1          4
(384 missing values generated)

. sum *_normal 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
extraversi~l |         64    .5546875    .4562468          0          1
agreeablen~l |         64    .4973958    .4369327          0          1
conscienti~l |         64    .5442708    .4753558          0          1
neuroticis~l |         64    .4479167    .4281487          0          1
openness_n~l |         64    .4557292    .3840311          0          1

. 
. foreach var of varlist *_normal{
  2. ttest `var', by(leader)
  3. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32    .5729167    .0816145    .4616813    .4064628    .7393705
  Chiefs |      32    .5364583    .0808551    .4573854    .3715533    .7013633
---------+--------------------------------------------------------------------
combined |      64    .5546875    .0570308    .4562468    .4407205    .6686545
---------+--------------------------------------------------------------------
    diff |            .0364583    .1148846               -.1931927    .2661094
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.3173
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6240         Pr(|T| > |t|) = 0.7520          Pr(T > t) = 0.3760

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .546875    .0774952    .4383792    .3888225    .7049275
  Chiefs |      32    .4479167    .0772067    .4367473    .2904525    .6053809
---------+--------------------------------------------------------------------
combined |      64    .4973958    .0546166    .4369327    .3882533    .6065384
---------+--------------------------------------------------------------------
    diff |            .0989583     .109391               -.1197112    .3176278
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.9046
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8154         Pr(|T| > |t|) = 0.3692          Pr(T > t) = 0.1846

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .578125    .0843302    .4770436    .4061325    .7501175
  Chiefs |      32    .5104167    .0846461    .4788305    .3377799    .6830535
---------+--------------------------------------------------------------------
combined |      64    .5442708    .0594195    .4753558    .4255305    .6630112
---------+--------------------------------------------------------------------
    diff |            .0677083    .1194845               -.1711377    .3065544
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.5667
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7135         Pr(|T| > |t|) = 0.5730          Pr(T > t) = 0.2865

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .484375    .0757132    .4282987    .3299569    .6387931
  Chiefs |      32    .4114583    .0763118     .431685    .2558193    .5670974
---------+--------------------------------------------------------------------
combined |      64    .4479167    .0535186    .4281487    .3409683     .554865
---------+--------------------------------------------------------------------
    diff |            .0729167    .1074988               -.1419703    .2878037
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.6783
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7499         Pr(|T| > |t|) = 0.5001          Pr(T > t) = 0.2501

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .515625    .0687345    .3888209    .3754401    .6558099
  Chiefs |      32    .3958333      .06641    .3756714    .2603893    .5312773
---------+--------------------------------------------------------------------
combined |      64    .4557292    .0480039    .3840311    .3598011    .5516573
---------+--------------------------------------------------------------------
    diff |            .1197917    .0955757               -.0712614    .3108447
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   1.2534
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8926         Pr(|T| > |t|) = 0.2148          Pr(T > t) = 0.1074

. /* No sig differences between leader type*/
. 
. label variable extraversion "B5 extraversion, based on c29 and recoded c26new"

. label variable agreeableness "B5 agreeableness, based on c25 and recoded c31new"

. label variable neuroticism "B5 neuroticism, based on c28 and recoded c33new"

. label variable conscientiousness "B5 conscientiousness, based on c32 and recoded c27new"

. label variable openness "B5 openess, based on c34 and recoded c30new"

. 
. drop c25new-c34new

. 
. 
. // Pairwise correlations
. global big5 *_normal

. foreach var of varlist $big5{
  2. pwcorr extra*_normal `var', sig
  3. }

             | extrav~l extrav~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
extraversi~l |   1.0000   1.0000 
             |   0.0000
             |

             | extrav~l agreea~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
agreeablen~l |   0.8877   1.0000 
             |   0.0000
             |

             | extrav~l consci~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
conscienti~l |   0.8933   1.0000 
             |   0.0000
             |

             | extrav~l neurot~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
neuroticis~l |   0.7980   1.0000 
             |   0.0000
             |

             | extrav~l openne~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
openness_n~l |   0.7514   1.0000 
             |   0.0000
             |

. /* THAT is Puzzling: Big 5s are strongly correlated among each other. Including them jointly in regressions will be problematic due to multicollinearity */
. ******************************************
. 
. 
. 
. 
. *********C13-C24***************************
. /*we used authentic leadership self-assessment questionnaire (pdf).
> Literature uses 5-point scale, and than simply takes the sum of all 4 items. Values above 15 mean high AL, values of 15 and below mean low AL.
> In our case this would mean value of >12 is high AL, value of 12 and below is low AL.
> However, we have one missing for c13. This person would hence automatically get a low AL score. 
> We could circumvent this problem by taking the average score. (NOT NOW)
> */
. alpha c13 c16 c19 c22           /*moral perspective: 0.72*/

Test scale = mean(unstandardized items)

Average interitem covariance:     .7498122
Number of items in the scale:            4
Scale reliability coefficient:      0.7168

. alpha c14 c17 c20 c23           /*balanced processing: 0.94*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.769841
Number of items in the scale:            4
Scale reliability coefficient:      0.9400

. alpha c15 c18 c21 c24           /*relation transparency: 0.89*/

Test scale = mean(unstandardized items)
Reversed item:  c18

Average interitem covariance:     1.439153
Number of items in the scale:            4
Scale reliability coefficient:      0.8881

. global AL c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24

. pca $AL

Principal components/correlation                 Number of obs    =         63
                                                 Number of comp.  =          8
                                                 Trace            =         12
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       8.5811      7.32232             0.7151       0.7151
           Comp2 |      1.25878      .460893             0.1049       0.8200
           Comp3 |      .797884      .163611             0.0665       0.8865
           Comp4 |      .634273      .265805             0.0529       0.9393
           Comp5 |      .368468      .159598             0.0307       0.9700
           Comp6 |      .208871      .101596             0.0174       0.9874
           Comp7 |      .107275     .0639178             0.0089       0.9964
           Comp8 |     .0433571     .0433571             0.0036       1.0000
           Comp9 |            0            0             0.0000       1.0000
          Comp10 |            0            0             0.0000       1.0000
          Comp11 |            0            0             0.0000       1.0000
          Comp12 |            0            .             0.0000       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    ------------------------------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 | Unexplained 
    -------------+--------------------------------------------------------------------------------+-------------
             c13 |   0.3208    0.0298   -0.0208   -0.1035    0.0913    0.3360    0.8725   -0.0500 |           0 
             c14 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c15 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c16 |   0.2263    0.5218    0.3625   -0.0501   -0.0987   -0.7058    0.1851    0.0213 |           0 
             c17 |   0.3314    0.0409    0.1100    0.0062    0.0989    0.0943   -0.2182   -0.9000 |           0 
             c18 |  -0.2049    0.2666    0.4631    0.7441    0.1512    0.3054    0.0343    0.0387 |           0 
             c19 |  -0.0103    0.7180   -0.6419    0.0961   -0.1419    0.1882   -0.0837   -0.0246 |           0 
             c20 |   0.2379   -0.3204   -0.1916    0.5104   -0.7051   -0.1688    0.1142   -0.0697 |           0 
             c21 |   0.2496   -0.1812   -0.4078    0.4026    0.6572   -0.3738    0.0312    0.0621 |           0 
             c22 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c23 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c24 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
    ------------------------------------------------------------------------------------------------------------

. estat loadings

Principal component loadings (unrotated)
    component normalization: sum of squares(column) = 1

    ----------------------------------------------------------------------------------------------
                 |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 
    -------------+--------------------------------------------------------------------------------
             c13 |    .3208     .0298   -.02084    -.1035    .09128      .336     .8725   -.05001 
             c14 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c15 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c16 |    .2263     .5218     .3625   -.05012   -.09875    -.7058     .1851    .02134 
             c17 |    .3314    .04087       .11   .006219    .09893     .0943    -.2182       -.9 
             c18 |   -.2049     .2666     .4631     .7441     .1512     .3054    .03432    .03871 
             c19 |  -.01034      .718    -.6419    .09615    -.1419     .1882   -.08369    -.0246 
             c20 |    .2379    -.3204    -.1916     .5104    -.7051    -.1688     .1142   -.06972 
             c21 |    .2496    -.1812    -.4078     .4026     .6572    -.3738     .0312    .06212 
             c22 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c23 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c24 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
    ----------------------------------------------------------------------------------------------

. predict AL1, score 
(7 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ----------------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 
    -------------+--------------------------------------------------------------------------------
             c13 |   0.3208    0.0298   -0.0208   -0.1035    0.0913    0.3360    0.8725   -0.0500 
             c14 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c15 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c16 |   0.2263    0.5218    0.3625   -0.0501   -0.0987   -0.7058    0.1851    0.0213 
             c17 |   0.3314    0.0409    0.1100    0.0062    0.0989    0.0943   -0.2182   -0.9000 
             c18 |  -0.2049    0.2666    0.4631    0.7441    0.1512    0.3054    0.0343    0.0387 
             c19 |  -0.0103    0.7180   -0.6419    0.0961   -0.1419    0.1882   -0.0837   -0.0246 
             c20 |   0.2379   -0.3204   -0.1916    0.5104   -0.7051   -0.1688    0.1142   -0.0697 
             c21 |   0.2496   -0.1812   -0.4078    0.4026    0.6572   -0.3738    0.0312    0.0621 
             c22 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c23 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c24 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
    ----------------------------------------------------------------------------------------------

. sum AL1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         AL1 |         63   -3.78e-09    2.929351  -3.588274   3.158526

. 
. gen moral_perspective=c13+c16+c19+c22
(385 missing values generated)

. gen balance_processing=c14+c17+c20+c23
(384 missing values generated)

. gen relational_transparency=c15+c18+c21+c24
(384 missing values generated)

. label variable moral_perspective "AL moral perspective, total score on c13 c16 c19 and c22"

. label variable balance_processing "AL balance processing, total score on c14 c17 c20 and c23"

. label variable relational_transparency "AL relational transparency, total score on c15 c18 c21 and c24"

. 
. pwcorr moral balance

             | moral_~e balanc~g
-------------+------------------
moral_pers~e |   1.0000 
balance_pr~g |   0.8252   1.0000 

. pwcorr moral relational

             | moral_~e relati~y
-------------+------------------
moral_pers~e |   1.0000 
relational~y |   0.7987   1.0000 

. pwcorr balance relationa

             | balanc~g relati~y
-------------+------------------
balance_pr~g |   1.0000 
relational~y |   0.9073   1.0000 

. egen helpauthentic = rowmean(moral_pers balance_pro relational_trans)
(384 missing values generated)

. gen authentic_leader1=0 if helpauthe!=.
(384 missing values generated)

. replace authentic_leader1=1 if helpauthe>12 & helpauthe!=.
(34 real changes made)

. label variable authentic_leader1 "1=high authentic leadership, 0 otherwise"

. lab def authentic 0 "Low" 1 "High", replace

. lab val authentic_leader1 authentic

. 
. /* AGAIN, very strong correlation among AL variables. Including them jointly in regressions may be no good idea*/
. gen strong_moral=0 if leader!=.
(384 missing values generated)

. replace strong_moral=1 if moral_perspective>=13 & leader!=.
(23 real changes made)

. gen strong_balance=0 if leader!=.
(384 missing values generated)

. replace strong_balance=1 if balance_processing>=13 & leader!=.
(36 real changes made)

. gen strong_relational=0 if leader!=.
(384 missing values generated)

. replace strong_relational=1 if relational_transparency>=13 & leader!=.
(28 real changes made)

. 
. foreach var of varlist  strong_moral strong_balance strong_relational{
  2. tab2 `var' leader, chi2
  3. }

-> tabulation of strong_moral by leader  

strong_mor |        leader
        al |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        21         20 |        41 
         1 |        11         12 |        23 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.0679   Pr = 0.794

-> tabulation of strong_balance by leader  

strong_bal |        leader
      ance |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        13         15 |        28 
         1 |        19         17 |        36 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.2540   Pr = 0.614

-> tabulation of strong_relational by leader  

strong_rel |        leader
   ational |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        17         19 |        36 
         1 |        15         13 |        28 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.2540   Pr = 0.614

. /* No differences, will not change if we use Fisher exact test for values being very similar*/
. label variable strong_moral"AL dummy for moral perspective"

. label variable strong_balance "AL dummy for balance processing"

. label variable strong_relational "AL dummy for relational transparency"

. 
. gen authentic_leader2=0 if leader!=.
(384 missing values generated)

. replace authentic_leader2=1 if strong_moral==1 & strong_balance==1 & strong_relational==1
(17 real changes made)

. label variable authentic_leader2 "Measure of authentic leadership based on dummies"

. 
. * standardize authentic leadership scale (z-scores)
. egen AL_score=rowmean(moral_perspective balance_processing relational_transparency)
(384 missing values generated)

. egen z_AL_score=std(AL_score)
(384 missing values generated)

. 
. * Village level leader motivation
. bysort village: egen aux_motivation=total(motivation)

. gen intrinsic_DEL=0 if motivation==0 & TL==0
(437 missing values generated)

. replace intrinsic_DEL=1 if motivation==1 & TL==0
(21 real changes made)

. gen intrinsic_TL=0 if motivation==0 & TL==1
(430 missing values generated)

. replace intrinsic_TL=1 if motivation==1 & TL==1
(14 real changes made)

. gen sum_motivation=.
(448 missing values generated)

. replace sum_motivation=0 if aux_motivation==0
(56 real changes made)

. replace sum_motivation=1 if aux_motivation==1 & intrinsic_DEL==0
(7 real changes made)

. replace sum_motivation=1 if aux_motivation==1 & intrinsic_TL==1
(7 real changes made)

. replace sum_motivation=2 if aux_motivation==1 & intrinsic_TL==0
(14 real changes made)

. replace sum_motivation=2 if aux_motivation==1 & intrinsic_DEL==1
(14 real changes made)

. replace sum_motivation=3 if aux_motivation==2
(98 real changes made)

. lab def motivation2 0 "both extrinsic" 1 "DEL extrinsic/ TL intrinsic" 2 "TL extrinsic/ DEL intrinsic"  3 "both intrinsic", replace

. lab val sum_motivation motivation2

. 
. gen bonus_AL=bonus*authentic_leader1
(384 missing values generated)

. 
. 
. 
. /* NOTE:
> - FWe drop d5j (Motorrad), cell phone and freezer as this has too little variation. Drop sewing machine as no obs for leader
> - Include dummies for d6 and d7a, in case of d6 a dummy if main source is private tap (d6==1) und in case of d7 if d7a=02 (concrete)
> */
. 
. * Dummies for main income sources
. gen i_sf=0

. replace i_sf=1 if d1==3 | d1==4
(138 real changes made)

. lab var i_sf "Farming"

. 
. gen i_ob=0 

. replace i_ob=1 if d1==5
(67 real changes made)

. label var i_ob "Own business"

. 
. gen i_em=0

. replace i_em=1 if d1==1 | d1==2
(45 real changes made)

. label var i_em "Employment"

. 
. gen i_p=0

. replace i_p=1 if d1==6
(93 real changes made)

. label var i_p "Pension"

. 
. 
. 
. gen privatetap = (d6==1) if d6!=.
(5 missing values generated)

. gen robustfloor = (d7a==2 | d7a==4) if d7a!=.
(6 missing values generated)

. label variable robustfloor "Dummy taking 1 if concrete or wooden housefloor, based on d7a"

. label variable privatetap "Dummy if privat tap, based on d6"

. 
. // Normalize livestock assets to [0,1] range
. sum d3a 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3a |        442    8.873303    19.44391          0        300

. gen z_cattle = (d3a - r(min))/(r(max)-r(min))
(6 missing values generated)

. sum d3b

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3b |        442    .3733032    2.747666          0         30

. gen z_sheeps = (d3b - r(min))/(r(max)-r(min))
(6 missing values generated)

. sum d3c

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3c |        442    13.35068    16.80289          0        200

. gen z_goats = (d3c - r(min))/(r(max)-r(min))
(6 missing values generated)

. 
. bysort villager: sum z_cattle z_sheeps z_goats

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> villager = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         64    .0488021    .0654421          0         .4
    z_sheeps |         64      .00625         .05          0         .4
     z_goats |         64    .1092188    .1390792          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> villager = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |        378    .0263228    .0642247          0          1
    z_sheeps |        378    .0134921    .0968875          0          1
     z_goats |        378    .0595635    .0683105          0         .5


. 
. global asset z_cattle z_sheeps z_goats d5a d5b d5c d5d d5e d5f d5g d5i d5j d5k d5l d5m d5n robustfloor privatetap

. global asset2 d5a d5b d5d d5f d5g d5i d5k-d5n privatetap

. 
. pca $asset2, comp(1)

Principal components/correlation                 Number of obs    =        431
                                                 Number of comp.  =          1
                                                 Trace            =         11
    Rotation: (unrotated = principal)            Rho              =     0.2645

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.90923      1.66106             0.2645       0.2645
           Comp2 |      1.24818      .104836             0.1135       0.3779
           Comp3 |      1.14334      .186404             0.1039       0.4819
           Comp4 |      .956937      .136826             0.0870       0.5689
           Comp5 |      .820111     .0212259             0.0746       0.6434
           Comp6 |      .798885     .0776617             0.0726       0.7161
           Comp7 |      .721223     .0385552             0.0656       0.7816
           Comp8 |      .682668     .0664126             0.0621       0.8437
           Comp9 |      .616255     .0419399             0.0560       0.8997
          Comp10 |      .574316     .0454601             0.0522       0.9519
          Comp11 |      .528855            .             0.0481       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
             d5a |   0.1841 |       .9014 
             d5b |   0.3884 |       .5612 
             d5d |   0.3551 |       .6332 
             d5f |   0.2575 |       .8071 
             d5g |   0.3441 |       .6556 
             d5i |   0.3654 |       .6117 
             d5k |   0.2157 |       .8646 
             d5l |   0.2627 |       .7992 
             d5m |   0.3276 |       .6878 
             d5n |   0.2742 |       .7813 
      privatetap |   0.2702 |       .7877 
    --------------------------------------

. estat loadings

Principal component loadings (unrotated)
    component normalization: sum of squares(column) = 1

    ------------------------
                 |    Comp1 
    -------------+----------
             d5a |    .1841 
             d5b |    .3884 
             d5d |    .3551 
             d5f |    .2575 
             d5g |    .3441 
             d5i |    .3654 
             d5k |    .2157 
             d5l |    .2627 
             d5m |    .3276 
             d5n |    .2742 
      privatetap |    .2702 
    ------------------------

. predict pc1, score

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
             d5a |   0.1841 
             d5b |   0.3884 
             d5d |   0.3551 
             d5f |   0.2575 
             d5g |   0.3441 
             d5i |   0.3654 
             d5k |   0.2157 
             d5l |   0.2627 
             d5m |   0.3276 
             d5n |   0.2742 
      privatetap |   0.2702 
    ------------------------

. estat kmo // legitimate pca, kmo=0.79 > 0.7

Kaiser-Meyer-Olkin measure of sampling adequacy

    -----------------------
        Variable |     kmo 
    -------------+---------
             d5a |  0.7485 
             d5b |  0.8123 
             d5d |  0.7777 
             d5f |  0.7751 
             d5g |  0.8669 
             d5i |  0.8242 
             d5k |  0.7672 
             d5l |  0.7011 
             d5m |  0.7625 
             d5n |  0.7944 
      privatetap |  0.8454 
    -------------+---------
         Overall |  0.7924 
    -----------------------

. sum pc1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pc1 |        431   -7.56e-09    1.705647  -2.108749   6.471886

. gen pca_wealth=pc1
(17 missing values generated)

. label var pca_wealth "Socio-economic status proxy based on first component of pca"

. 
. xtile quintile=pca_wealth, nq(5)

. bysort leader: sum pca_wealth

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = DEL

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |         32     .451963    1.621559  -2.108749   3.726418

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = Chiefs

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |         32    1.702505    1.805242  -1.535614   6.471886

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |        367   -.1878555    1.616336  -2.108749    5.90319


. label define quints 1 "Poorest" 2 "Poor" 3 "Medium" 4 "Wealthy" 5 "Wealthiest"

. label values quintile quints

. 
. bysort quintile: sum $asset

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Poorest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         90    .0064074    .0161085          0         .1
    z_sheeps |         90    .0018519    .0175682          0   .1666667
     z_goats |         90    .0268889    .0432498          0         .2
         d5a |         91    .4395604    .4990834          0          1
         d5b |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5c |         91    .9230769    .2679457          0          1
         d5d |         91           0           0          0          0
         d5e |         91           0           0          0          0
         d5f |         91           0           0          0          0
         d5g |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5i |         91           0           0          0          0
         d5j |         91           0           0          0          0
         d5k |         91     .010989    .1048285          0          1
         d5l |         91           0           0          0          0
         d5m |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5n |         91    .1648352    .3730873          0          1
 robustfloor |         91     .032967    .1795395          0          1
  privatetap |         91    .0659341    .2495417          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Poor

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         82    .0156911    .0245088          0   .1066667
    z_sheeps |         82    .0146341    .1068437          0   .9333333
     z_goats |         82    .0370122    .0440318          0         .2
         d5a |         83    .9036145    .2969133          0          1
         d5b |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5c |         83    .9638554    .1877845          0          1
         d5d |         83    .0120482    .1097643          0          1
         d5e |         83    .0120482    .1097643          0          1
         d5f |         83           0           0          0          0
         d5g |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5i |         83     .060241    .2393792          0          1
         d5j |         83           0           0          0          0
         d5k |         83    .1325301    .3411274          0          1
         d5l |         83           0           0          0          0
         d5m |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5n |         83    .5421687    .5012473          0          1
 robustfloor |         83    .0481928    .2154753          0          1
  privatetap |         83     .313253    .4666359          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Medium

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |        100       .0332    .1024579          0          1
    z_sheeps |        100    .0036667    .0176606          0         .1
     z_goats |        100      .06995    .0820953          0         .5
         d5a |        101    .9108911    .2863218          0          1
         d5b |        101     .039604    .1959996          0          1
-------------+---------------------------------------------------------
         d5c |        101     .950495    .2180017          0          1
         d5d |        101     .049505    .2180017          0          1
         d5e |        101     .019802    .1400141          0          1
         d5f |        101     .009901    .0995037          0          1
         d5g |        101    .0792079      .27141          0          1
-------------+---------------------------------------------------------
         d5i |        101    .2475248    .4337267          0          1
         d5j |        101     .029703    .1706133          0          1
         d5k |        101    .3762376     .486857          0          1
         d5l |        101     .009901    .0995037          0          1
         d5m |        101           0           0          0          0
-------------+---------------------------------------------------------
         d5n |        101    .7821782    .4148243          0          1
 robustfloor |        100         .07    .2564324          0          1
  privatetap |        101    .5544554    .4995047          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Wealthy

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         70    .0448571    .0639738          0   .3333333
    z_sheeps |         70    .0171429    .1215497          0          1
     z_goats |         70    .0861429    .0781033          0        .35
         d5a |         70    .9285714    .2593989          0          1
         d5b |         70    .2142857    .4132886          0          1
-------------+---------------------------------------------------------
         d5c |         70    .9714286    .1678015          0          1
         d5d |         70    .1571429    .3665631          0          1
         d5e |         70    .0714286    .2593989          0          1
         d5f |         70    .0142857    .1195229          0          1
         d5g |         70    .2142857    .4132886          0          1
-------------+---------------------------------------------------------
         d5i |         70    .6714286    .4730851          0          1
         d5j |         70    .0857143     .281963          0          1
         d5k |         70    .2857143    .4550158          0          1
         d5l |         70    .0714286    .2593989          0          1
         d5m |         70    .1142857    .3204552          0          1
-------------+---------------------------------------------------------
         d5n |         70    .8857143    .3204552          0          1
 robustfloor |         70    .0714286    .2593989          0          1
  privatetap |         70    .6428571    .4826171          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Wealthiest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         86    .0513953    .0617892          0         .4
    z_sheeps |         86     .029845    .1392819          0   .8666667
     z_goats |         86    .1172093    .1187424          0          1
         d5a |         86    .9186047    .2750451          0          1
         d5b |         86    .6162791    .4891434          0          1
-------------+---------------------------------------------------------
         d5c |         86    .9534884    .2118255          0          1
         d5d |         86    .5348837    .5017071          0          1
         d5e |         86     .244186    .4321233          0          1
         d5f |         86    .2906977    .4567476          0          1
         d5g |         86    .5813953    .4962238          0          1
-------------+---------------------------------------------------------
         d5i |         86    .7790698    .4173068          0          1
         d5j |         86    .0581395    .2353796          0          1
         d5k |         86    .4767442    .5023883          0          1
         d5l |         86     .244186    .4321233          0          1
         d5m |         86    .3837209    .4891434          0          1
-------------+---------------------------------------------------------
         d5n |         86    .9069767    .2921686          0          1
 robustfloor |         86    .1046512    .3078988          0          1
  privatetap |         86    .7790698    .4173068          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         14    .0235714    .0295685          0   .0833333
    z_sheeps |         14           0           0          0          0
     z_goats |         14       .0675    .0560134          0       .175
         d5a |         11    .8181818    .4045199          0          1
         d5b |         11    .2727273    .4670994          0          1
-------------+---------------------------------------------------------
         d5c |         12    .9166667    .2886751          0          1
         d5d |         11    .1818182    .4045199          0          1
         d5e |         12    .1666667    .3892495          0          1
         d5f |         11    .0909091    .3015113          0          1
         d5g |         11    .0909091    .3015113          0          1
-------------+---------------------------------------------------------
         d5i |         12    .0833333    .2886751          0          1
         d5j |         11    .0909091    .3015113          0          1
         d5k |         11    .1818182    .4045199          0          1
         d5l |         10          .1    .3162278          0          1
         d5m |         10          .2     .421637          0          1
-------------+---------------------------------------------------------
         d5n |         10          .2     .421637          0          1
 robustfloor |         12    .0833333    .2886751          0          1
  privatetap |         12         .25     .452267          0          1


. 
. 
. 
. 
. *** Create Variable that informs about years living in village ***
. /* Problem: for 50% of sample, a6 takes the value of "1". What does this mean? */
. 
. ** lifetime spent in village
. replace a6=2000 if id==380
(1 real change made)

. *Assistant for got a zero in the year
. gen years_in_village = .
(448 missing values generated)

. gen a6_new = 2015-a6 if a6 > 1
(226 missing values generated)

. label variable a6_new "Transformation of a6 in years"

. replace years_in_village = age if a6==1
(222 real changes made)

. replace  years_in_village = a6_new if a6 > 1
(222 real changes made)

. gen rootedness=years_in_village/age
(5 missing values generated)

. replace rootedness=1 if rootedness > 1
(58 real changes made)

. label variable rootedness "Fraction of lifetime spent in village"

. *some are younger than the time spent in the village (they probably have been living there all their life)
. 
. 
. *** experience in years
. gen experience = 2015-f1
(384 missing values generated)

. label variable experience "Years in office"

. 
. 
. // Competition
. gen f5new=f5
(390 missing values generated)

. replace f5new=0 if f5new==. & leader!=.
(6 real changes made)

. rename f5new competitor

. 
. gen dcompetitor = (competitor>0 & competitor!=.)

. label variable competitor "Number of competitors in previous election"

. label variable dcompetitor "Dummy=1 if there were some other candidates in previous election"

. 
. /*
> gen competitor2=competitor
> replace competitor2=20 if competitor2>=20 & competitor2!=.
> */
. 
. // Term office
. gen term=f2a
(384 missing values generated)

. label variable term "Dummy=1 if person faces term office"

. 
. // Elected
. gen elected =1 if f3b==1 | (f3==1 | f3==2)
(412 missing values generated)

. replace elected=0 if elected ==. & leader!=.
(28 real changes made)

. label variable elected "Dummy=1 if person was elected rather than appointed"

. 
. // Secret elections
. gen secretelec = 1 if f4c==1
(432 missing values generated)

. replace secretelec = 0 if f4c>1 & f4c!=.
(47 real changes made)

. label var secretelec "Dummy =1 if elections were secretly held"

. 
. 
. save "$working_ANALYSIS\processed\analysis_wide.dta", replace
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\processed\analysis_wide.dta saved

. 
. 
. /*
> Reshape dataset into long-format for analysis of bonus payment rounds.
> Generate additional variables for analysis in long-format.
> */
. reshape long rule vote majority payoff, i(id) j(decision)
(note: j = 1 2 3 4 5 6)
(note: payoff2 not found)
(note: payoff3 not found)
(note: payoff4 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      448   ->    2688
Number of variables                 442   ->     426
j variable (6 values)                     ->   decision
xij variables:
                  rule1 rule2 ... rule6   ->   rule
                  vote1 vote2 ... vote6   ->   vote
      majority1 majority2 ... majority6   ->   majority
            payoff1 payoff2 ... payoff6   ->   payoff
-----------------------------------------------------------------------------

. 
. *Drop all decisions except 1, 5 and 6 (basic, bonus1, bonus2)
. drop if decision>1 & decision<5
(1,344 observations deleted)

. drop if id>64
(1,152 observations deleted)

. order decision rule vote majority payoff, after(session_id)

. order session_id, after(id)

. 
. *---------------------------------------------------------
. * Generating additional variables for long-format analysis
. *---------------------------------------------------------
. * Binary rule choice
. gen dem=0

. replace dem=1 if rule==1
(123 real changes made)

. 
. gen dic=0

. replace dic=1 if rule==3
(14 real changes made)

. 
. gen fake=0

. replace fake=1 if rule==2
(55 real changes made)

. *bonus: 0=no bonus, 1=any bonus
. gen bonus=0

. replace bonus=1 if decision>4
(128 real changes made)

. 
. 
. *bonus_size: 0=no, 1=small, 2=large
. gen bonus_size=0

. replace bonus_size=1 if decision==5
(64 real changes made)

. replace bonus_size=2 if decision==6
(64 real changes made)

. lab def bonus_size1 0 "Baseline" 1 "Small Bonus" 2 "Large Bonus", replace

. lab val bonus_size bonus_size1

. 
. 
. *Generate identifier for the first bonus that was offered
. gen bonus_first=0 if (decision==6 & randomization<7) | (decision==5 & randomization>6)
(128 missing values generated)

. replace bonus_first=1 if (decision==5 & randomization<7) | (decision==6 & randomization>6)
(64 real changes made)

. label def first_lab 0 "3rd round" 1 "2nd round", replace

. lab val bonus_first first_lab

. 
. replace rule=1 if dem==1
(0 real changes made)

. replace rule=2 if fake==1
(0 real changes made)

. replace rule=3 if dic==1
(0 real changes made)

. 
. label def bonus 0 "Baseline (n=64)" 1 "Pooled Bonus (n=128)", replace

. label def rule 1 "Democratic" 2 "Pseudo-democratic" 3 "Autocratic" , replace

. label val bonus bonus

. label val rule rule

. 
. order bonus bonus_size bonus_order randomization dem dic fake, after(majority)

. 
. *rule choice variable for basic round
. gen rule_basic = rule if decision==1
(128 missing values generated)

. replace rule_basic = rule_basic[_n-1] if missing(rule_basic)
(128 real changes made)

. order rule_basic, after(rule)

. label def rule_basic 1 "Base: Democratic (n=41)" 2 "Base: Pseudo (n=14)" 3 "Base: Autocrat (n=9)", replace

. label val rule_basic rule_basic

. 
. 
. qui tab bonus_size, gen(bonus_)

. qui tab bonus_order, gen(order_)

. qui tab rule_basic, gen(baseline_)

. 
. *interactions 
. gen bonus_democrat=bonus*baseline_1

. gen bonus_pseudo=bonus*baseline_2

. gen bonus_dictator=bonus*baseline_3

. 
. *
. 
. // Globals
. global order order_3

. global socio education age pca_wealth male experience married rootedness

. 
. *interactions
. gen bonus_extrinsic=bonus*extrinsic_leader

. gen bonus_TL=bonus*TL

. 
. 
. save "$working_ANALYSIS\processed\analysis_long.dta", replace
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\processed\analysis_long.dta saved

. 
. 
. 
. 
. ** EOF
. 
end of do-file

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 03_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Long Format:
>                 - Main Manuscript
>                 - SOM
>         2) Analysis Wide Format:
>                 - Main Manuscript
>                 - SOM
> */
. *--------------------------------------------------
. 
. 
. *--------------------------------------------------
. * (1) Analysis Long Format
. *--------------------------------------------------
. * Load cleaned dataset (long-format)
. clear

. use "$working_ANALYSIS/processed/analysis_long.dta"

. 
. *set panel
. xtset id decision
       panel variable:  id (strongly balanced)
        time variable:  decision, 1 to 6, but with gaps
                delta:  1 unit

. 
. *Figure 2.      Average treatment effects of payments & Table S2.       Main effects of bonus payment - Probit
. *Panel A: Main treatment effects
. tab rule if decision<2

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         41       64.06       64.06
Pseudo-democratic |         14       21.88       85.94
       Autocratic |          9       14.06      100.00
------------------+-----------------------------------
            Total |         64      100.00

. bys TL: tab rule if decision<2

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> TL = 0

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         18       56.25       56.25
Pseudo-democratic |          8       25.00       81.25
       Autocratic |          6       18.75      100.00
------------------+-----------------------------------
            Total |         32      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> TL = 1

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         23       71.88       71.88
Pseudo-democratic |          6       18.75       90.63
       Autocratic |          3        9.38      100.00
------------------+-----------------------------------
            Total |         32      100.00


. prtest dem1 if decision<2, by(TL)

Two-sample test of proportions                     0: Number of obs =       32
                                                   1: Number of obs =       32
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |      .5625   .0876951                      .3906208    .7343792
           1 |     .71875   .0794804                      .5629712    .8745288
-------------+----------------------------------------------------------------
        diff |    -.15625   .1183536                     -.3882187    .0757187
             |  under Ho:   .1199543    -1.30   0.193
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -1.3026
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0964         Pr(|Z| > |z|) = 0.1927          Pr(Z > z) = 0.9036

. 
. * Small and Large bonus seperately
. eststo reg_dem1: xtprobit dem bonus_2 bonus_3 , vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -125.38709  
Iteration 1:   log pseudolikelihood = -125.38709  

Fitting full model:

rho =  0.0     log pseudolikelihood = -125.38709
rho =  0.1     log pseudolikelihood = -120.97002
rho =  0.2     log pseudolikelihood = -117.59758
rho =  0.3     log pseudolikelihood = -115.02704
rho =  0.4     log pseudolikelihood = -113.13299
rho =  0.5     log pseudolikelihood = -111.87369
rho =  0.6     log pseudolikelihood = -111.29283
rho =  0.7     log pseudolikelihood = -111.58207

Iteration 0:   log pseudolikelihood = -111.29429  
Iteration 1:   log pseudolikelihood = -110.64933  
Iteration 2:   log pseudolikelihood = -110.63147  
Iteration 3:   log pseudolikelihood = -110.63147  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(2)      =       0.00
Log pseudolikelihood  = -110.63147              Prob > chi2       =     0.9999

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |   .0038466   .2964481     0.01   0.990     -.577181    .5848743
     bonus_3 |   .0038466   .2964481     0.01   0.990     -.577181    .5848743
       _cons |   .5973239   .2794914     2.14   0.033     .0495309    1.145117
-------------+----------------------------------------------------------------
    /lnsig2u |   .5734665   .4495206                     -.3075777    1.454511
-------------+----------------------------------------------------------------
     sigma_u |   1.332069   .2993962                      .8574531    2.069393
         rho |   .6395627   .1036245                      .4237061    .8106917
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dem=1), predict(pr)
dy/dx w.r.t. : bonus_2 bonus_3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |   .0008635   .0665514     0.01   0.990    -.1295749     .131302
     bonus_3 |   .0008635   .0665514     0.01   0.990    -.1295749     .131302
------------------------------------------------------------------------------

. est store pr1

. eststo reg_fake1: xtprobit fake bonus_2 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood =  -114.9984  
Iteration 1:   log pseudolikelihood = -113.09846  
Iteration 2:   log pseudolikelihood = -113.09531  
Iteration 3:   log pseudolikelihood = -113.09531  

Fitting full model:

rho =  0.0     log pseudolikelihood = -113.09531
rho =  0.1     log pseudolikelihood = -109.50028
rho =  0.2     log pseudolikelihood = -106.85965
rho =  0.3     log pseudolikelihood = -104.95446
rho =  0.4     log pseudolikelihood = -103.67659
rho =  0.5     log pseudolikelihood = -102.99775
rho =  0.6     log pseudolikelihood = -102.97063
rho =  0.7     log pseudolikelihood = -103.77414

Iteration 0:   log pseudolikelihood = -102.97557  
Iteration 1:   log pseudolikelihood = -101.54769  
Iteration 2:   log pseudolikelihood = -101.40994  
Iteration 3:   log pseudolikelihood = -101.40943  
Iteration 4:   log pseudolikelihood = -101.40943  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       3.97
Log pseudolikelihood  = -101.40943              Prob > chi2       =     0.2652

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |   .4614349   .3139349     1.47   0.142    -.1538663    1.076736
     bonus_3 |   .5327473   .3187649     1.67   0.095    -.0920204    1.157515
 bonus_order |   .3387109   .4152962     0.82   0.415    -.4752546    1.152676
       _cons |  -1.431821   .3832913    -3.74   0.000    -2.183058   -.6805835
-------------+----------------------------------------------------------------
    /lnsig2u |   .4616659   .4812244                     -.4815165    1.404848
-------------+----------------------------------------------------------------
     sigma_u |   1.259649   .3030868                      .7860316     2.01864
         rho |   .6134093   .1141167                      .3818941    .8029521
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(fake=1), predict(pr)
dy/dx w.r.t. : bonus_2 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |   .0961699    .063935     1.50   0.133    -.0291404    .2214802
     bonus_3 |   .1110324   .0645646     1.72   0.085    -.0155119    .2375767
 bonus_order |   .0705924   .0860772     0.82   0.412    -.0981159    .2393007
------------------------------------------------------------------------------

. est store pr2

. eststo reg_dic1: xtprobit dic bonus_2 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -50.134837  
Iteration 1:   log pseudolikelihood = -46.751419  
Iteration 2:   log pseudolikelihood = -46.668355  
Iteration 3:   log pseudolikelihood = -46.668238  
Iteration 4:   log pseudolikelihood = -46.668238  

Fitting full model:

rho =  0.0     log pseudolikelihood = -46.668238
rho =  0.1     log pseudolikelihood =  -46.34144
rho =  0.2     log pseudolikelihood = -46.487345

Iteration 0:   log pseudolikelihood =  -46.34144  
Iteration 1:   log pseudolikelihood = -46.224904  
Iteration 2:   log pseudolikelihood = -45.725694  
Iteration 3:   log pseudolikelihood = -45.716321  
Iteration 4:   log pseudolikelihood = -45.716168  
Iteration 5:   log pseudolikelihood = -45.716168  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       5.89
Log pseudolikelihood  = -45.716168              Prob > chi2       =     0.1171

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |  -.7685142   .3654187    -2.10   0.035    -1.484722   -.0523066
     bonus_3 |  -.9802238   .4762269    -2.06   0.040    -1.913611   -.0468363
 bonus_order |  -.3149328   .3841314    -0.82   0.412    -1.067817    .4379509
       _cons |  -1.164717   .3813613    -3.05   0.002    -1.912172   -.4172627
-------------+----------------------------------------------------------------
    /lnsig2u |   -.664432   .8165016                     -2.264746    .9358817
-------------+----------------------------------------------------------------
     sigma_u |   .7173324   .2928515                      .3222677    1.596703
         rho |   .3397447   .1831562                      .0940851     .718267
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dic=1), predict(pr)
dy/dx w.r.t. : bonus_2 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_2 |  -.0804475   .0394257    -2.04   0.041    -.1577204   -.0031745
     bonus_3 |  -.1026091   .0485981    -2.11   0.035    -.1978595   -.0073586
 bonus_order |  -.0329669   .0402543    -0.82   0.413    -.1118639    .0459301
------------------------------------------------------------------------------

. est store pr3

. 
. *test small versus large bonus 
. xtprobit fake bonus_1 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood =  -114.9984  
Iteration 1:   log pseudolikelihood = -113.09846  
Iteration 2:   log pseudolikelihood = -113.09531  
Iteration 3:   log pseudolikelihood = -113.09531  

Fitting full model:

rho =  0.0     log pseudolikelihood = -113.09531
rho =  0.1     log pseudolikelihood = -109.50028
rho =  0.2     log pseudolikelihood = -106.85965
rho =  0.3     log pseudolikelihood = -104.95446
rho =  0.4     log pseudolikelihood = -103.67659
rho =  0.5     log pseudolikelihood = -102.99775
rho =  0.6     log pseudolikelihood = -102.97063
rho =  0.7     log pseudolikelihood = -103.77414

Iteration 0:   log pseudolikelihood = -102.97557  
Iteration 1:   log pseudolikelihood = -101.54769  
Iteration 2:   log pseudolikelihood = -101.40994  
Iteration 3:   log pseudolikelihood = -101.40943  
Iteration 4:   log pseudolikelihood = -101.40943  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       3.97
Log pseudolikelihood  = -101.40943              Prob > chi2       =     0.2652

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.4614349   .3139349    -1.47   0.142    -1.076736    .1538663
     bonus_3 |   .0713124   .2771217     0.26   0.797    -.4718362     .614461
 bonus_order |   .3387109   .4152962     0.82   0.415    -.4752546    1.152676
       _cons |  -.9703856   .3528396    -2.75   0.006    -1.661939   -.2788326
-------------+----------------------------------------------------------------
    /lnsig2u |   .4616659   .4812244                     -.4815165    1.404848
-------------+----------------------------------------------------------------
     sigma_u |   1.259649   .3030868                      .7860316     2.01864
         rho |   .6134093   .1141167                      .3818941    .8029521
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(fake=1), predict(pr)
dy/dx w.r.t. : bonus_1 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.0961699    .063935    -1.50   0.133    -.2214802    .0291404
     bonus_3 |   .0148626   .0577308     0.26   0.797    -.0982878    .1280129
 bonus_order |   .0705924   .0860772     0.82   0.412    -.0981159    .2393007
------------------------------------------------------------------------------

. 
. *pooled bonus
. eststo reg_dem2: xtprobit dem bonus bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -125.38709  
Iteration 1:   log pseudolikelihood = -125.13711  
Iteration 2:   log pseudolikelihood =  -125.1371  

Fitting full model:

rho =  0.0     log pseudolikelihood =  -125.1371
rho =  0.1     log pseudolikelihood = -120.75302
rho =  0.2     log pseudolikelihood = -117.40806
rho =  0.3     log pseudolikelihood = -114.86156
rho =  0.4     log pseudolikelihood = -112.98925
rho =  0.5     log pseudolikelihood = -111.75008
rho =  0.6     log pseudolikelihood = -111.18782
rho =  0.7     log pseudolikelihood =  -111.4932

Iteration 0:   log pseudolikelihood = -111.19027  
Iteration 1:   log pseudolikelihood =  -110.5521  
Iteration 2:   log pseudolikelihood = -110.53321  
Iteration 3:   log pseudolikelihood = -110.53321  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(2)      =       0.20
Log pseudolikelihood  = -110.53321              Prob > chi2       =     0.9069

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |   .0038548   .2653135     0.01   0.988      -.51615    .5238597
 bonus_order |  -.1862194   .4213702    -0.44   0.659     -1.01209    .6396511
       _cons |   .6944178   .3408885     2.04   0.042     .0262886    1.362547
-------------+----------------------------------------------------------------
    /lnsig2u |   .5654267   .4499981                     -.3165533    1.447407
-------------+----------------------------------------------------------------
     sigma_u |   1.326725   .2985118                      .8536136    2.062056
         rho |   .6377072   .1039661                       .421516     .809599
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dem=1), predict(pr)
dy/dx w.r.t. : bonus bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |   .0008665   .0596371     0.01   0.988    -.1160201    .1177531
 bonus_order |  -.0418576   .0944827    -0.44   0.658    -.2270403    .1433252
------------------------------------------------------------------------------

. est store pr4

. eststo reg_fake2: xtprobit fake bonus bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood =  -114.9984  
Iteration 1:   log pseudolikelihood = -113.11824  
Iteration 2:   log pseudolikelihood = -113.11513  
Iteration 3:   log pseudolikelihood = -113.11513  

Fitting full model:

rho =  0.0     log pseudolikelihood = -113.11513
rho =  0.1     log pseudolikelihood = -109.52127
rho =  0.2     log pseudolikelihood = -106.88185
rho =  0.3     log pseudolikelihood = -104.97786
rho =  0.4     log pseudolikelihood =  -103.7012
rho =  0.5     log pseudolikelihood = -103.02356
rho =  0.6     log pseudolikelihood = -102.99767
rho =  0.7     log pseudolikelihood = -103.80249

Iteration 0:   log pseudolikelihood = -103.00256  
Iteration 1:   log pseudolikelihood = -101.57872  
Iteration 2:   log pseudolikelihood = -101.44091  
Iteration 3:   log pseudolikelihood = -101.44039  
Iteration 4:   log pseudolikelihood = -101.44039  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(2)      =       3.88
Log pseudolikelihood  = -101.44039              Prob > chi2       =     0.1435

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |   .4971642   .2842203     1.75   0.080    -.0598972    1.054226
 bonus_order |   .3385349   .4151405     0.82   0.415    -.4751255    1.152195
       _cons |  -1.431149   .3832357    -3.73   0.000    -2.182278   -.6800211
-------------+----------------------------------------------------------------
    /lnsig2u |   .4601208    .481087                     -.4827923    1.403034
-------------+----------------------------------------------------------------
     sigma_u |   1.258676   .3027663                      .7855304     2.01681
         rho |   .6130428   .1141241                       .381593    .8026649
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(fake=1), predict(pr)
dy/dx w.r.t. : bonus bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |   .1036855   .0574167     1.81   0.071    -.0088492    .2162201
 bonus_order |   .0706027   .0860697     0.82   0.412    -.0980907    .2392962
------------------------------------------------------------------------------

. est store pr5

. eststo reg_dic2: xtprobit dic bonus bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -50.134837  
Iteration 1:   log pseudolikelihood = -46.837592  
Iteration 2:   log pseudolikelihood = -46.766968  
Iteration 3:   log pseudolikelihood =  -46.76692  
Iteration 4:   log pseudolikelihood =  -46.76692  

Fitting full model:

rho =  0.0     log pseudolikelihood =  -46.76692
rho =  0.1     log pseudolikelihood = -46.438292
rho =  0.2     log pseudolikelihood = -46.586174

Iteration 0:   log pseudolikelihood = -46.438292  
Iteration 1:   log pseudolikelihood = -46.303056  
Iteration 2:   log pseudolikelihood = -45.823896  
Iteration 3:   log pseudolikelihood = -45.814007  
Iteration 4:   log pseudolikelihood = -45.813838  
Iteration 5:   log pseudolikelihood = -45.813838  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(2)      =       6.02
Log pseudolikelihood  = -45.813838              Prob > chi2       =     0.0493

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |  -.8653539   .3619556    -2.39   0.017    -1.574774   -.1559341
 bonus_order |  -.3153426   .3830241    -0.82   0.410    -1.066056    .4353707
       _cons |  -1.162901   .3801173    -3.06   0.002    -1.907917   -.4178845
-------------+----------------------------------------------------------------
    /lnsig2u |  -.6719679   .8021689                      -2.24419    .9002543
-------------+----------------------------------------------------------------
     sigma_u |   .7146346   .2866288                      .3255969    1.568512
         rho |   .3380563   .1795048                      .0958518    .7110018
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dic=1), predict(pr)
dy/dx w.r.t. : bonus bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       bonus |  -.0908287   .0383611    -2.37   0.018     -.166015   -.0156423
 bonus_order |  -.0330988   .0403304    -0.82   0.412    -.1121449    .0459473
------------------------------------------------------------------------------

. est store pr6

. 
. 
. 
. *plot marginal effects for bonus treatment
. coefplot (pr1, offset(0.2) msymbol(D)) (pr2, offset(0) msymbol(S)) (pr3, offset(-0.2) msymbol(O)) (pr4, offset(0.2) msymbol(D) mcolor("100 143 255") ciopts(lwidth(0.3
>  1) lcolor("100 143 255*.8" "100 143 255*.2")  recast(rcap))) (pr5, offset(0) msymbol(S) mcolor("120 94 240") ciopts(lwidth(0.3 1) color("120 94 240*.8" "120 94 240*.
> 2")  recast(rcap)))  (pr6, offset(-0.2) msymbol(O) mcolor("220 38 127") ciopts(lwidth(0.3 1) color("220 38 127*.8" "220 38 127*.2")  recast(rcap))), keep(bonus_2 bonu
> s_3 bonus) coeflabels(bonus = "Pooled Bonus" bonus_2 = "Small bonus" bonus_3="Large bonus") xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact r
> elative to baseline in pp") msymbol(d)  xla(-0.3(0.1)0.3, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2) recast(rcap)) mlabel(cond(@pval<.01, "
> ***", cond(@pval<.05, "**", cond(@pval<.1, "*", "") )))  mlabsize(8pt)  mlabposition(12) mlabgap(-0.1)  legend(order(3 "Democratic" 6 "Pseudo-democratic" 9 "Autocrati
> c") pos(6) ring(1) rows(1) bmargin(small)) graphregion(margin(tiny))
(note:  named style medthin not found in class linestyle, default attributes used)

. gr display, xsize(4) ysize(3)

. gr save "$working_ANALYSIS/results/intermediate/figure2.gph", replace 
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figure2.gph saved)

. gr export "$working_ANALYSIS/results/figures/figure2.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figure2.tif written in TIFF format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Figure 4.      Heterogeneous effects by leaders motivation
. prtest extrinsic_leader, by(TL)

Two-sample test of proportions                     0: Number of obs =       96
                                                   1: Number of obs =       96
------------------------------------------------------------------------------
       Group |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           0 |     .34375   .0484753                      .2487402    .4387598
           1 |      .5625   .0506308                      .4632655    .6617345
-------------+----------------------------------------------------------------
        diff |    -.21875   .0700952                      -.356134    -.081366
             |  under Ho:   .0718509    -3.04   0.002
------------------------------------------------------------------------------
        diff = prop(0) - prop(1)                                  z =  -3.0445
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0012         Pr(|Z| > |z|) = 0.0023          Pr(Z > z) = 0.9988

. bys extrinsic_leader: sum helpauthentic

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> extrinsic_leader = Intrinsic

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
helpauthen~c |        105    11.28571    3.858177          5   15.33333

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> extrinsic_leader = Extrinsic

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
helpauthen~c |         87           9    4.123106          4         15


. ttest helpauthentic if decision <2, by(extrinsic_leader)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Intrinsi |      35    11.28571    .6585136    3.895819    9.947454    12.62397
Extrinsi |      29           9    .7747027    4.171902    7.413094    10.58691
---------+--------------------------------------------------------------------
combined |      64       10.25    .5190379    4.152303    9.212786    11.28721
---------+--------------------------------------------------------------------
    diff |            2.285714    1.010161                .2664311    4.304997
------------------------------------------------------------------------------
    diff = mean(Intrinsi) - mean(Extrinsi)                        t =   2.2627
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9864         Pr(|T| > |t|) = 0.0272          Pr(T > t) = 0.0136

. 
. *PANEL A
. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule extrinsic_leader, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus motivation) asyvar recast(bar) yla(`pctlabel') blabel(bar, format(%9.0f
> ) pos(center) gap(0.1)) title("{bf:A} Rule Choices") 

. gr_edit scaleaxis.title.draw_view.setstyle, style(no)

. gr save "$working_ANALYSIS/results/intermediate/figure4a.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figure4a.gph saved)

. 
. 
. *PANEL B: Interaction effects
. 
. *Mixed effects REML
. eststo reg_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -121.82125  
Iteration 1:   log restricted-likelihood = -121.82125  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       2.76
Log restricted-likelihood = -121.82125          Prob > chi2       =     0.5987

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0714286   .0746965    -0.96   0.339    -.2178311    .0749739
extrinsic_leader |  -.0376649   .1218715    -0.31   0.757    -.2765286    .2011989
 bonus_extrinsic |   .1576355   .1109664     1.42   0.155    -.0598546    .3751256
     bonus_order |  -.0473009   .0966126    -0.49   0.624    -.2366582    .1420563
           _cons |   .6828205   .0973551     7.01   0.000     .4920081    .8736329
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .3244484   .0423308      .2512403    .4189885
-----------------------------+------------------------------------------------
                sd(Residual) |   .3608185   .0227294        .31891    .4082343
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 33.90         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. eststo reg_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -112.47504  
Iteration 1:   log restricted-likelihood = -112.47504  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.05
Log restricted-likelihood = -112.47504          Prob > chi2       =     0.1954

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0571429   .0725115     0.79   0.431    -.0849771    .1992628
extrinsic_leader |    -.14581   .1138525    -1.28   0.200    -.3689568    .0773369
 bonus_extrinsic |   .0980296   .1077204     0.91   0.363    -.1130986    .3091577
     bonus_order |   .0770341   .0881302     0.87   0.382     -.095698    .2497662
           _cons |   .2438958   .0903335     2.70   0.007     .0668453    .4209462
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2877669   .0399357      .2192365    .3777189
-----------------------------+------------------------------------------------
                sd(Residual) |    .350264   .0220646      .3095814    .3962927
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 27.32         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. eststo reg_het3: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -14.898712  
Iteration 1:   log restricted-likelihood =  -14.86824  
Iteration 2:   log restricted-likelihood = -14.868225  
Iteration 3:   log restricted-likelihood = -14.868225  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.39
Log restricted-likelihood = -14.868225          Prob > chi2       =     0.0003

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0142857   .0483356     0.30   0.768    -.0804503    .1090217
extrinsic_leader |   .1834748   .0631713     2.90   0.004     .0596612    .3072884
 bonus_extrinsic |   -.255665   .0718055    -3.56   0.000    -.3964012   -.1149288
     bonus_order |  -.0297332   .0411184    -0.72   0.470    -.1103237    .0508574
           _cons |   .0732837   .0480207     1.53   0.127    -.0208352    .1674027
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |    .093578   .0287817      .0512119    .1709923
-----------------------------+------------------------------------------------
                sd(Residual) |    .233483    .014708      .2063643    .2641654
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.31          Prob >= chibar2 = 0.0344

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. 
. 
. 
. *plot marginal effects for bonus treatment
. coefplot (reg_het1, offset(0.2) msymbol(D)) (reg_het2, offset(0) msymbol(S)) (reg_het3, offset(-0.2) msymbol(O)), keep(bonus extrinsic_leader bonus_extrinsic) coeflab
> els(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction") xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B} Interaction effec
> ts") xtitle("Regression estimated impact relative to baseline in pp") msymbol(d)  xla(-0.4(0.1)0.4, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *
> .2)recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(7pt) mlabposition(12) mlabgap(-0.1)  legend(order(3 "Democrat
> ic" 6 "Pseudo-democratic" 9 "Autocratic")) graphregion(margin(tiny))

. gr save "$working_ANALYSIS/results/intermediate/figure4b.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figure4b.gph saved)

. 
. grc1leg "$working_ANALYSIS/results/intermediate/figure4a.gph" "$working_ANALYSIS/results/intermediate/figure4b.gph", rows(1) graphregion(margin(tiny))
(note:  named style medthin not found in class linestyle, default attributes used)

. gr display, xsize(6) ysize(3) scale(1.2)  

. gr save "$working_ANALYSIS/results/intermediate/figure4.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figure4.gph saved)

. gr export "$working_ANALYSIS/results/figures/figure4.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figure4.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Figure S3.     Heterogeneous treatment effects: Robustness check with authentic leadership
. *Panel A
. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule authentic_leader1, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus authentic_leader1) asyvar recast(bar) yla(`pctlabel') blabel(bar, form
> at(%9.0f) pos(center) gap(0.1)) title("{bf:A} Rule Choices")  b1title("") 

. gr save "$working_ANALYSIS/results/intermediate/figureS3a.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS3a.gph saved)

. 
. *Panel B
. coefplot (reg_het4, offset(0.2) msymbol(D)) (reg_het5, offset(0) msymbol(S)) (reg_het6, offset(-0.2) msymbol(O)), keep(bonus authentic_leader1 bonus_AL ) coeflabels(b
> onus =  "Pooled Bonus" authentic_leader1 = "High authentic (=1)" bonus_AL = "Interaction")xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B} Interaction effects") xti
> tle("Regression estimated impact relative to baseline in pp") msymbol(d)  xla(-0.4(0.1)0.4, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2)recas
> t(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(7pt) mlabposition(12) mlabgap(-0.1)  legend(order(3 "Democratic" 6 "P
> seudo-democratic" 9 "Autocratic")) graphregion(margin(tiny))
estimation result reg_het4 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Table S7.      Robustness check: Authentic leadership score median split
. eststo reg_het4: xtmixed dem bonus authentic_leader1 bonus_AL bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -122.42462  
Iteration 1:   log restricted-likelihood = -122.42462  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       0.35
Log restricted-likelihood = -122.42462          Prob > chi2       =     0.9862

-----------------------------------------------------------------------------------
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            bonus |  -4.72e-16   .0554598    -0.00   1.000    -.1086992    .1086992
authentic_leader1 |   .0452489   .1436856     0.31   0.753    -.2363697    .3268675
         bonus_AL |  -.0415859   .1989649    -0.21   0.834    -.4315498    .3483781
      bonus_order |  -.0316742   .1436856    -0.22   0.826    -.3132928    .2499444
            _cons |   .6470588    .101555     6.37   0.000     .4480147     .846103
-----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |    .329157   .0429961      .2548091     .425198
-----------------------------+------------------------------------------------
                sd(Residual) |   .3622618   .0227303      .3203416    .4096676
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 34.60         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. eststo reg_het5: xtmixed fake bonus authentic_leader1 bonus_AL bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -112.72772  
Iteration 1:   log restricted-likelihood = -112.72772  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       4.45
Log restricted-likelihood = -112.72772          Prob > chi2       =     0.3485

-----------------------------------------------------------------------------------
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            bonus |   .1015625   .0535867     1.90   0.058    -.0034655    .2065905
authentic_leader1 |  -.0241327   .1314642    -0.18   0.854    -.2817979    .2335324
         bonus_AL |   .0497738   .1820417     0.27   0.785    -.3070213    .4065688
      bonus_order |   .0527903   .1314642     0.40   0.688    -.2048748    .3104555
            _cons |   .1871936   .0936241     2.00   0.046     .0036938    .3706935
-----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2940703   .0404717      .2245451    .3851223
-----------------------------+------------------------------------------------
                sd(Residual) |   .3500269   .0219626      .3095226    .3958317
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 28.73         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. eststo reg_het6: xtmixed dic bonus authentic_leader1 bonus_AL bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -20.707951  
Iteration 1:   log restricted-likelihood = -20.644842  
Iteration 2:   log restricted-likelihood = -20.644635  
Iteration 3:   log restricted-likelihood = -20.644635  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       8.30
Log restricted-likelihood = -20.644635          Prob > chi2       =     0.0813

-----------------------------------------------------------------------------------
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            bonus |  -.1015625   .0373518    -2.72   0.007    -.1747707   -.0283543
authentic_leader1 |  -.0211161   .0608227    -0.35   0.728    -.1403265    .0980942
         bonus_AL |  -.0081879   .0842227    -0.10   0.923    -.1732613    .1568855
      bonus_order |  -.0211161   .0608227    -0.35   0.728    -.1403265    .0980942
            _cons |   .1657475   .0471502     3.52   0.000     .0733348    .2581603
-----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .0860815   .0323173      .0412425    .1796694
-----------------------------+------------------------------------------------
                sd(Residual) |    .243981   .0153087      .2157481    .2759086
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.12          Prob >= chibar2 = 0.0725

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "64´"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Panel B
. coefplot (reg_het4, offset(0.2) msymbol(D)) (reg_het5, offset(0) msymbol(S)) (reg_het6, offset(-0.2) msymbol(O)), keep(bonus authentic_leader1 bonus_AL ) coeflabels(b
> onus =  "Pooled Bonus" authentic_leader1 = "High authentic (=1)" bonus_AL = "Interaction")xline(0, lpattern(dash) lcolor(gs3)) title("{bf:B} Interaction effects") xti
> tle("Regression estimated impact relative to baseline in pp") msymbol(d)  xla(-0.4(0.1)0.4, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2)recas
> t(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(7pt) mlabposition(12) mlabgap(-0.1)  legend(order(3 "Democratic" 6 "P
> seudo-democratic" 9 "Autocratic")) graphregion(margin(tiny))

. gr save "$working_ANALYSIS/results/intermediate/figureS3b.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS3b.gph saved)

. 
. grc1leg "$working_ANALYSIS/results/intermediate/figureS3a.gph" "$working_ANALYSIS/results/intermediate/figureS3b.gph", rows(1) graphregion(margin(tiny))
(note:  named style medthin not found in class linestyle, default attributes used)

. gr display, xsize(6) ysize(3) scale(1.2)  

. gr save "$working_ANALYSIS/results/intermediate/figureS3.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS3.gph saved)

. gr export "$working_ANALYSIS/results/figures/figureS3.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS3.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. 
. *Figure S5.     Likelihood of distribution B being implemented
. coefplot (payoff1, msymbol(d)), keep(bonus baseline_2 baseline_3 bonus_pseudo bonus_dictator) coeflabels(bonus= "Pooled Bonus" baseline_2 = "Base: Pseudo-democrat" ba
> seline_3 ="Base: Autocrat" bonus_pseudo = "Interaction:Bonus*Pseudo" bonus_dictator = "Interaction: Bonus*Autocrat") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Reg
> ression estimated impact relative to baseline democrats in pp") msymbol(d) xla(-1(0.25)1, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2)  recas
> t(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(8pt) mlabposition(12) mlabgap(-0.1) 
estimation result payoff1 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Table S9.      Likelihood of distribution B being implemented in stage 2
. eststo reg_stage2: xtprobit payoff bonus baseline_2 baseline_3 bonus_pseudo bonus_dictator, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -125.38709  
Iteration 1:   log pseudolikelihood = -112.47189  
Iteration 2:   log pseudolikelihood = -112.44528  
Iteration 3:   log pseudolikelihood = -112.44528  

Fitting full model:

rho =  0.0     log pseudolikelihood = -112.44528
rho =  0.1     log pseudolikelihood = -108.16339
rho =  0.2     log pseudolikelihood = -104.94467
rho =  0.3     log pseudolikelihood = -102.52388
rho =  0.4     log pseudolikelihood = -100.76519
rho =  0.5     log pseudolikelihood = -99.620632
rho =  0.6     log pseudolikelihood = -99.129166
rho =  0.7     log pseudolikelihood = -99.473951

Iteration 0:   log pseudolikelihood = -99.128678  
Iteration 1:   log pseudolikelihood = -96.514424  
Iteration 2:   log pseudolikelihood = -96.277056  
Iteration 3:   log pseudolikelihood = -96.276281  
Iteration 4:   log pseudolikelihood = -96.276281  (backed up)

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(5)      =      17.48
Log pseudolikelihood  = -96.276281              Prob > chi2       =     0.0037

                                      (Std. Err. adjusted for 64 clusters in id)
--------------------------------------------------------------------------------
               |               Robust
        payoff |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         bonus |  -.6630801   .3733322    -1.78   0.076    -1.394798    .0686375
    baseline_2 |  -2.328642   .7733767    -3.01   0.003    -3.844433   -.8128517
    baseline_3 |  -2.523964   .9291104    -2.72   0.007    -4.344987   -.7029406
  bonus_pseudo |   .6599155   .7284527     0.91   0.365    -.7678256    2.087656
bonus_dictator |   2.923806   .8886222     3.29   0.001     1.182138    4.665473
         _cons |   1.711766   .4687351     3.65   0.000     .7930619     2.63047
---------------+----------------------------------------------------------------
      /lnsig2u |   .9083993   .4959556                     -.0636559    1.880454
---------------+----------------------------------------------------------------
       sigma_u |   1.574912   .3905433                      .9686732    2.560563
           rho |   .7126725    .101557                      .4840914    .8676633
--------------------------------------------------------------------------------

. margin, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(payoff=1), predict(pr)
dy/dx w.r.t. : bonus baseline_2 baseline_3 bonus_pseudo bonus_dictator

--------------------------------------------------------------------------------
               |            Delta-method
               |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         bonus |  -.1168856   .0640911    -1.82   0.068    -.2425019    .0087307
    baseline_2 |  -.4104856   .1008716    -4.07   0.000    -.6081904   -.2127809
    baseline_3 |  -.4449162   .1531795    -2.90   0.004    -.7451424     -.14469
  bonus_pseudo |   .1163278   .1274468     0.91   0.361    -.1334633    .3661188
bonus_dictator |   .5153991   .1432262     3.60   0.000      .234681    .7961172
--------------------------------------------------------------------------------

. est store payoff1

. mocrat" baseline_3 ="Base: Autocrat" bonus_pseudo = "Interaction:Bonus*Pseudo" bonus_dictator = "Interaction: Bonus*Autocrat") xline(0, lpattern(dash) lcolor(gs3))  x
> title("Regression estimated impact relative to baseline democrats in pp") msymbol(d) xla(-1(0.25)1, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *
> .2)  recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(8pt) mlabposition(12) mlabgap(-0.1) 
command mocrat is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *Figure S5.     Likelihood of distribution B being implemented
. coefplot (payoff1, msymbol(d)), keep(bonus baseline_2 baseline_3 bonus_pseudo bonus_dictator) coeflabels(bonus= "Pooled Bonus" baseline_2 = "Base: Pseudo-democrat" ba
> seline_3 ="Base: Autocrat" bonus_pseudo = "Interaction:Bonus*Pseudo" bonus_dictator = "Interaction: Bonus*Autocrat") xline(0, lpattern(dash) lcolor(gs3))  xtitle("Reg
> ression estimated impact relative to baseline democrats in pp") msymbol(d) xla(-1(0.25)1, nogrid) grid(none) levels(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2)  recas
> t(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(8pt) mlabposition(12) mlabgap(-0.1) 

. gr save "$working_ANALYSIS/results/intermediate/figureS6.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS6.gph saved)

. gr export "$working_ANALYSIS/results/figures/figureS6.tif", replace width(3465)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS6.tif written in TIFF format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. * (2) Analysis WIDE format
. *--------------------------------------------------
. clear all

. use "$working_ANALYSIS/processed/analysis_wide.dta"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. 
. 
. *Figure 5.      Villagers satisfaction with their leader’s performance outside the lab
. bysort group_leader_type: sum satisfaction_leader

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group_leader_type = True-democrat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
satisfacti~r |        246    3.827134    .6666073       1.75          5

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group_leader_type = Pseudo-democrat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
satisfacti~r |         54    3.626852    .7306603        2.2        4.6

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group_leader_type = Paternalist

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
satisfacti~r |         30    3.844167    .5952282        2.6       4.75

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group_leader_type = Autocrat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
satisfacti~r |         36       3.725    .5777419        2.6        4.5

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group_leader_type = Benevolent-Autocrat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
satisfacti~r |         18    3.816667    .7085611        1.4        4.5


. reg z_satisfaction leader_type2 leader_type3 leader_type4 leader_type5 i.village, vce(robust)

Linear regression                               Number of obs     =        384
                                                F(35, 348)        =       1.58
                                                Prob > F          =     0.0230
                                                R-squared         =     0.1271
                                                Root MSE          =     .98017

------------------------------------------------------------------------------------
                   |               Robust
    z_satisfaction |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
      leader_type2 |  -.6611698    .208875    -3.17   0.002    -1.071986   -.2503536
      leader_type3 |  -.2920114    .214623    -1.36   0.175    -.7141328    .1301101
      leader_type4 |  -.4457453    .220525    -2.02   0.044    -.8794748   -.0120157
      leader_type5 |   -.568856   .3146655    -1.81   0.071    -1.187741    .0500294
                   |
           village |
            Ehafo  |   .2816941   .4406489     0.64   0.523     -.584976    1.148364
           Endola  |   .1647852   .4608402     0.36   0.721    -.7415971    1.071168
        Epatululo  |   .5070494   .4781111     1.06   0.290    -.4333015      1.4474
            Epuku  |  -.2703627   .4603237    -0.59   0.557    -1.175729     .635004
            Etale  |  -.2734926   .5295272    -0.52   0.606    -1.314969    .7679837
         Etilashi  |   .0657285   .5410536     0.12   0.903    -.9984181    1.129875
           Etomba  |  -.3036037   .4349979    -0.70   0.486     -1.15916     .551952
        Ohangwena  |   .3807507   .4368951     0.87   0.384    -.4785364    1.240038
       Oipapakane  |   .3098634   .4577618     0.68   0.499    -.5904644    1.210191
          Okadiwa  |   .5539985   .4237442     1.31   0.192    -.2794234     1.38742
          Okafitu  |   .2875579   .4625024     0.62   0.535    -.6220938     1.19721
           Okakwa  |   .2336439   .4366642     0.54   0.593    -.6251892    1.092477
         Okangudi  |   .5778497   .4702996     1.23   0.220    -.3471375    1.502837
        Okapundja  |     .66628   .4807188     1.39   0.167    -.2791997     1.61176
          Okatale  |    .200963   .4460237     0.45   0.653    -.6762783    1.078204
         Okelemba  |   .2190954   .4276179     0.51   0.609    -.6219453    1.060136
         Omahenge  |   .4006316   .4696826     0.85   0.394    -.5231421    1.324405
         Omakango  |  -.0594688   .4918662    -0.12   0.904    -1.026873    .9079357
         Omalyata  |   .3449401    .460573     0.75   0.454    -.5609169    1.250797
          Omaputo  |  -.1502369   .4760151    -0.32   0.752    -1.086466    .7859916
          Omukuve  |   .3574597   .4513268     0.79   0.429    -.5302117    1.245131
Omutwe Oshimbungu  |   .1752763   .4832945     0.36   0.717    -.7752695    1.125822
         Onangwhe  |   .7987806   .4775939     1.67   0.095    -.1405532    1.738114
    Onekwaya East  |   .7645445   .4521417     1.69   0.092    -.1247297    1.653819
    Onekwaya West  |  -.3536827   .5304743    -0.67   0.505    -1.397022    .6896564
         Onengali  |   .8570611   .4781265     1.79   0.074    -.0833201    1.797442
          Ongonga  |   .3030627   .5027781     0.60   0.547    -.6858034    1.291929
        Onheleiwa  |   1.259779    .452481     2.78   0.006     .3698379    2.149721
      Oshikwiyu 1  |   .9679903   .4408178     2.20   0.029     .1009881    1.834993
      Oshikwiyu 2  |    .046949   .4978082     0.09   0.925    -.9321423     1.02604
          Ouhongo  |   .7186967   .4882986     1.47   0.142     -.241691    1.679084
                   |
             _cons |  -.1293054     .36416    -0.36   0.723    -.8455369    .5869261
------------------------------------------------------------------------------------

. eststo reg_satisfaction: reg satisfaction_leader rule_base2 rule_base3 i.village, vce(robust)

Linear regression                               Number of obs     =        384
                                                F(33, 350)        =       1.62
                                                Prob > F          =     0.0193
                                                R-squared         =     0.1226
                                                Root MSE          =     .65223

------------------------------------------------------------------------------------
                   |               Robust
satisfaction_lea~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
        rule_base2 |   -.358179   .1199986    -2.98   0.003    -.5941881   -.1221699
        rule_base3 |  -.2967078   .1229121    -2.41   0.016     -.538447   -.0549687
                   |
           village |
            Ehafo  |   .1874999   .2924635     0.64   0.522    -.3877071     .762707
           Endola  |   .1915895   .3034727     0.63   0.528      -.40527     .788449
        Epatululo  |      .3375   .3173276     1.06   0.288    -.2866089    .9616089
            Epuku  |  -.2209105   .3065403    -0.72   0.472    -.8238032    .3819822
            Etale  |  -.2229939   .3493882    -0.64   0.524    -.9101583    .4641706
         Etilashi  |   .0437499   .3591033     0.12   0.903    -.6625218    .7500217
           Etomba  |  -.2020834   .2887129    -0.70   0.484    -.7699139    .3657471
        Ohangwena  |   .3353394   .2888458     1.16   0.246    -.2327523    .9034312
       Oipapakane  |   .2062499   .3038216     0.68   0.498    -.3912957    .8037955
          Okadiwa  |     .36875   .2812437     1.31   0.191    -.1843903    .9218902
          Okafitu  |   .1504372   .3234825     0.47   0.642    -.4857769    .7866513
           Okakwa  |   .2374228   .2795042     0.85   0.396    -.3122963     .787142
         Okangudi  |   .3436728   .3049252     1.13   0.260    -.2560434     .943389
        Okapundja  |   .4025205   .2978602     1.35   0.177    -.1833004    .9883415
          Okatale  |   .1337705   .2947688     0.45   0.650    -.4459704    .7135114
         Okelemba  |   .1458333   .2838147     0.51   0.608    -.4123636    .7040302
         Omahenge  |   .2666666   .3117335     0.86   0.393      -.34644    .8797731
         Omakango  |  -.0395834   .3264571    -0.12   0.904    -.6816477    .6024809
         Omalyata  |   .2296039   .3002282     0.76   0.445    -.3608743    .8200822
          Omaputo  |        -.1   .3159365    -0.32   0.752    -.7213729    .5213728
          Omukuve  |   .2379372    .298702     0.80   0.426    -.3495395    .8254139
Omutwe Oshimbungu  |   .1166666   .3207679     0.36   0.716    -.5142085    .7475418
         Onangwhe  |   .5316872   .3109826     1.71   0.088    -.0799425    1.143317
    Onekwaya East  |   .5498457   .3088478     1.78   0.076    -.0575854    1.157277
    Onekwaya West  |  -.2354167   .3520817    -0.67   0.504    -.9278786    .4570452
         Onengali  |   .5295267   .3106328     1.70   0.089    -.0814151    1.140468
          Ongonga  |   .1607767   .3359346     0.48   0.633    -.4999276    .8214811
        Onheleiwa  |     .75661   .2810407     2.69   0.007      .203869    1.309351
      Oshikwiyu 1  |   .6852623   .3040821     2.25   0.025     .0872042     1.28332
      Oshikwiyu 2  |     .03125   .3304008     0.09   0.925    -.6185708    .6810707
          Ouhongo  |   .4374228    .320296     1.37   0.173    -.1925242     1.06737
                   |
             _cons |   3.704167    .241697    15.33   0.000     3.228805    4.179528
------------------------------------------------------------------------------------

. est store satisfaction

. 
. coefplot (satisfaction), keep(rule_base2 rule_base3) coeflabels(rule_base2 = "Baseline: Pseudo-democratic rule" rule_base3 = "Baseline: Autocratic rule") xline(0, lpa
> ttern(dash) lcolor(gs3))  xtitle("Regression estimated imppact relative to 'Baseline: Democratic rule'") xla(-1(0.25)0.25, nogrid) grid(none) levels(95 90) ciopts(lwi
> dth(0.3 1) lcolor(*.8 *.2)   recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(9pt) mlabposition(12) mlabgap(-0.1)
>  
(note:  named style medthin not found in class linestyle, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figure5.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figure5.gph saved)

. gr export "$working_ANALYSIS/results/figures/figure5.tif", replace width(3465)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figure5.tif written in TIFF format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. bysort bonus_size bonus_order: tab rule
variable bonus_size not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. 
. 
. *--------------------------------------------------
. * (1) Analysis Long Format
. *--------------------------------------------------
. * Load cleaned dataset (long-format)
. clear

. use "$working_ANALYSIS/processed/analysis_long.dta"

. 
. *set panel
. xtset id decision
       panel variable:  id (strongly balanced)
        time variable:  decision, 1 to 6, but with gaps
                delta:  1 unit

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *--------------------------------------------------------------
. * Figure S1.    Order effects on rule choice in bonus rounds
. bysort bonus_size bonus_order: tab rule

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Baseline, bonus_order = Large first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         21       70.00       70.00
Pseudo-democratic |          4       13.33       83.33
       Autocratic |          5       16.67      100.00
------------------+-----------------------------------
            Total |         30      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Baseline, bonus_order = Small first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         20       58.82       58.82
Pseudo-democratic |         10       29.41       88.24
       Autocratic |          4       11.76      100.00
------------------+-----------------------------------
            Total |         34      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Small Bonus, bonus_order = Large first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         20       66.67       66.67
Pseudo-democratic |          8       26.67       93.33
       Autocratic |          2        6.67      100.00
------------------+-----------------------------------
            Total |         30      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Small Bonus, bonus_order = Small first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         21       61.76       61.76
Pseudo-democratic |         12       35.29       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Large Bonus, bonus_order = Large first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         19       63.33       63.33
Pseudo-democratic |         10       33.33       96.67
       Autocratic |          1        3.33      100.00
------------------+-----------------------------------
            Total |         30      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_size = Large Bonus, bonus_order = Small first

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         22       64.71       64.71
Pseudo-democratic |         11       32.35       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00


. catplot rule bonus_order if decision > 1, over(bonus_size) percent(bonus_order bonus_size ) asyvar recast(bar) yla(0(20)100) blabel(bar, format(%9.0f) pos(center)  ga
> p(0.1)) b1title("") legend(ring(0) pos(12) rows(1))

. gr export "$working_ANALYSIS/results/figures/figureS1.tif", replace width(5800)
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS1.tif not found)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS1.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. *--------------------------------------------------
. * (2) Analysis WIDE format
. *--------------------------------------------------
. clear all

. use "$working_ANALYSIS/processed/analysis_wide.dta"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. * Figure S2.    Rule choices dependent on baseline
. *Small bonus
. catplot rule5, over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:A} Small bonus") b1title("") legend(ring(1) po
> s(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2a.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2a.gph saved)

. 
. *Large bonus
. catplot rule6, over(rule_base) asyvar recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:B} Large bonus") b1title("") legend(ring(1) pos
> (6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2b.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2b.gph saved)

. 
. *First bonus
. catplot rule_bonus_first, over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:C} First bonus") b1title("") legend
> (ring(1) pos(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2c.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2c.gph saved)

. 
. *Second bonus
. catplot rule_bonus_second , over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:D} Second bonus") b1title("") leg
> end(ring(1) pos(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2d.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2d.gph saved)

. 
. grc1leg "$working_ANALYSIS/results/intermediate/figureS2a.gph""$working_ANALYSIS/results/intermediate/figureS2b.gph" "$working_ANALYSIS/results/intermediate/figureS2c
> .gph" "$working_ANALYSIS/results/intermediate/figureS2d.gph", rows(2) pos(6) ring(1)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2.gph saved)

. gr export "$working_ANALYSIS/results/figures/figureS2.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS2.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\scripts\02_generate.do"

. *--------------------------------------------------------------------------------------
. * SCRIPT: 02_generate.do
. * PURPOSE: generates additional variables used in the analysis
. *--------------------------------------------------------------------------------------
. 
. 
. 
. clear

. use "$working_ANALYSIS\processed\data_clean.dta"

. 
. // GAME 1: PROCEDURAL FAIRNESS
. 
. rename rule_1 rule1

. rename rule_2 rule2

. rename rule_3 rule3

. rename rule_4 rule4

. rename rule_bonus_1 rule5

. rename rule_bonus_2 rule6

. 
. rename vote_1 vote1

. rename vote_2 vote2

. rename vote_3 vote3

. rename vote_4 vote4

. rename vote_bonus_1 vote5

. rename vote_bonus2 vote6

. 
. rename majority_1 majority1

. rename majority_2 majority2

. rename majority_3 majority3

. rename majority_4 majority4

. rename majority_bonus1 majority5

. rename majority_bonus2 majority6

. 
. 
. // Create dummies for democratic and autocratic choices
. *democratic
. gen dem1=0

. replace dem1=1 if rule1==1
(41 real changes made)

. gen dem2=0

. replace dem2=1 if rule2==1
(39 real changes made)

. gen dem3=0

. replace dem3=1 if rule3==1
(44 real changes made)

. gen dem4=0

. replace dem4=1 if rule4==1
(37 real changes made)

. gen dem5=0

. replace dem4=1 if rule5==1
(10 real changes made)

. gen dem6=0

. replace dem4=1 if rule6==1
(5 real changes made)

. egen dem7 = rowmean(dem1 dem2 dem3 dem4)

. 
. *dictator
. gen dic1=0

. replace dic1=1 if rule1==2
(9 real changes made)

. gen dic2=0

. replace dic2=1 if rule2==2
(12 real changes made)

. gen dic3=0

. replace dic3=1 if rule3==2
(7 real changes made)

. gen dic4=0

. replace dic4=1 if rule4==2
(7 real changes made)

. gen dic5=0

. replace dic5=1 if rule5==2
(3 real changes made)

. gen dic6=0

. replace dic6=1 if rule6==2
(2 real changes made)

. 
. *pseudo-democratic
. gen fake1=0

. replace fake1=1 if rule1==3
(14 real changes made)

. gen fake2=0

. replace fake2=1 if rule2==3
(13 real changes made)

. gen fake3=0

. replace fake3=1 if rule3==3
(13 real changes made)

. gen fake4=0

. replace fake4=1 if rule4==3
(20 real changes made)

. gen fake5=0

. replace fake5=1 if rule5==3
(20 real changes made)

. gen fake6=0

. replace fake6=1 if rule6==3
(21 real changes made)

. 
. replace rule1=1 if dem1==1
(0 real changes made)

. replace rule1=2 if fake1==1
(14 real changes made)

. replace rule1=3 if dic1==1
(9 real changes made)

. replace rule2=1 if dem2==1
(0 real changes made)

. replace rule2=2 if fake2==1
(13 real changes made)

. replace rule2=3 if dic2==1
(12 real changes made)

. replace rule3=1 if dem3==1
(0 real changes made)

. replace rule3=2 if fake4==1
(17 real changes made)

. replace rule3=3 if dic4==1
(4 real changes made)

. replace rule4=1 if dem4==1
(15 real changes made)

. replace rule4=2 if fake4==1
(20 real changes made)

. replace rule4=3 if dic4==1
(7 real changes made)

. replace rule5=1 if dem5==1
(0 real changes made)

. replace rule5=2 if fake5==1
(20 real changes made)

. replace rule5=3 if dic5==1
(3 real changes made)

. replace rule6=1 if dem6==1
(0 real changes made)

. replace rule6=2 if fake6==1
(21 real changes made)

. replace rule6=3 if dic6==1
(2 real changes made)

. 
. *subsample autocratic rule choices
. gen pseudo1=0

. replace pseudo1=1 if rule1==3
(9 real changes made)

. replace pseudo1=. if rule1==1
(41 real changes made, 41 to missing)

. gen pseudo2=0

. replace pseudo2=1 if rule2==3
(12 real changes made)

. replace pseudo2=. if rule2==1
(39 real changes made, 39 to missing)

. gen pseudo3=0

. replace pseudo3=1 if rule3==3
(11 real changes made)

. replace pseudo3=. if rule3==1
(31 real changes made, 31 to missing)

. gen pseudo4=0

. replace pseudo4=1 if rule4==3
(7 real changes made)

. replace pseudo4=. if rule4==1
(37 real changes made, 37 to missing)

. egen pseudo_all = rowmean(pseudo1 pseudo2 pseudo3 pseudo4)
(25 missing values generated)

. 
. *same rule across all three rounds
. gen stable_rule=0

. replace stable_rule=1 if rule1==rule5==rule6
(30 real changes made)

. 
. *game1_group
. *devide each village into two groups of game 1: TL or DEL (13=TL, 14=DEL)?
. gen game1_group = 13

. replace game1_group =14 if session_id==1 | session_id==2 | session_id==5 | session_id==6 | session_id==9 | session_id==10 | session_id==14
(224 real changes made)

. order game1_group, before(vote1)

. 
. *villager_preference1
. *now the villager preferences, i.e. majority without leader (6 villager per group, a draw is therefore possible)
. * villager_preference1 ("A", "B" or "draw") gives the preferences of the six villager (without leader) in the first decision of game 1
. egen count_A = total(vote1==1) if id>64, by(village game1_group)
(64 missing values generated)

. order count_A, after(vote1)

. 
. replace count_A = count_A[_n-1] if session_id==13
(0 real changes made)

. replace count_A = count_A[_n-4] if session_id==14
(0 real changes made)

. 
. gen villager_preference1="A"

. replace villager_preference1 = "B" if count_A<3
(276 real changes made)

. replace villager_preference1 = "draw" if count_A==3
variable villager_preference1 was str1 now str4
(72 real changes made)

. order villager_preference1, after(vote1)

. label variable villager_preference "majority vote of 6 villagers over distribution A and B"

. 
. 
. drop count_A

. 
. *Bonus order
. gen bonus_order=. if id >64
(448 missing values generated)

. replace bonus_order=1 if  randomization<7
(38 real changes made)

. replace bonus_order=0 if  randomization>6 
(410 real changes made)

. label def bonus_order 1 "Small first" 0 "Large first", replace

. lab val bonus_order bonus_order

. 
. *Identifier for first bonus that was offered to leaders
. gen rule_bonus_first = rule5 if bonus_order==1
(414 missing values generated)

. replace rule_bonus_first = rule6 if bonus_order==0
(30 real changes made)

. gen rule_bonus_second = rule5 if bonus_order==0
(418 missing values generated)

. replace rule_bonus_second = rule6 if bonus_order==1
(34 real changes made)

. 
. *New variable to identify baseline rule choices
. gen rule_base=rule1
(384 missing values generated)

. lab def rulebasic 1 "Base: Democratic" 2 "Base: Pseudo" 3 "Base: Autocratic", replace

. lab val rule_base rulebasic

. bysort village game1_group: egen group_rule_base = mean(rule_base)

. lab val group_rule_base rulebasic

. tab group_rule_base, gen(rule_base)

 group_rule_base |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base: Democratic |        287       64.06       64.06
    Base: Pseudo |         98       21.88       85.94
Base: Autocratic |         63       14.06      100.00
-----------------+-----------------------------------
           Total |        448      100.00

. 
. * label rule choices consistently
. lab def rule 1 "Democratic" 2 "Pseudo-democratic" 3 "Autocratic" , replace

. foreach x of varlist rule1 rule5 rule6 rule_bonus_first rule_bonus_second {
  2.         lab val `x' rule
  3.         }

. 
. *payoff1, payoff5, payoff6
. *what do these villagers get?
. *Basic
. gen payoff1 = 0 if id<65
(384 missing values generated)

. replace payoff1 = 1 if (id<65) & ((rule1==1 & majority1=="B") | (rule1!=1 & vote1==2))
(41 real changes made)

. label variable payoff1 "distribution A or B that is paid to the group in decision 1"

. 
. *Small Bonus
. gen payoff5 = 0 if id<65
(384 missing values generated)

. replace payoff5 = 1 if (id<65) & ((rule5==1 & majority5=="B") | (rule5!=1 & vote5==2))
(40 real changes made)

. label variable payoff5 "distribution A or B that is paid to the group in small bonus"

. 
. *Large Bonus
. gen payoff6 = 0 if id<65
(384 missing values generated)

. replace payoff6 = 1 if (id<65) & ((rule6==1 & majority6=="B") | (rule6!=1 & vote6==2))
(42 real changes made)

. label variable payoff6 "distribution A or B that is paid to the group in large bonus"

. 
. lab def payoff_lab 0 "A" 1 "B"

. foreach var of varlist payoff1 payoff5 payoff6 {
  2.         lab val `var' payoff_lab
  3.         }

.         
. order payoff1 payoff5 payoff6, after(villager_preference1)

. gsort village game1_group -session_id

. 
. by village game1_group: replace payoff1 = payoff1[_n-1] if missing(payoff1)
(384 real changes made)

. by village game1_group: replace payoff5 = payoff5[_n-1] if missing(payoff5)
(384 real changes made)

. by village game1_group: replace payoff6 = payoff6[_n-1] if missing(payoff6)
(384 real changes made)

. 
. sort village session_id

. 
. 
. 
. // Leadertypes based on baseline stage 1 & stage 2 decisions
. gen true_democrat=0

. replace true_democrat=1 if rule1==1 
(41 real changes made)

. gen pseudo_democrat=0

. replace pseudo_democrat=1 if rule1==2 & vote1==1
(9 real changes made)

. gen paternalistic=0

. replace paternalistic=1 if rule1==2 & vote1==2
(5 real changes made)

. gen dictator=0

. replace dictator=1 if rule1==3 & vote1==1
(6 real changes made)

. gen benevolent_dictator=0

. replace benevolent_dictator=1 if rule1==3 & vote1==2
(3 real changes made)

. 
. gen leader_type=1 if true_democrat==1
(407 missing values generated)

. replace leader_type=2 if pseudo_democrat==1
(9 real changes made)

. replace leader_type=3 if paternalistic==1
(5 real changes made)

. replace leader_type=4 if dictator==1
(6 real changes made)

. replace leader_type=5 if benevolent_dictator==1
(3 real changes made)

. lab def lab_types 1 "True-democrat" 2 "Pseudo-democrat" 3 "Paternalist" 4 "Autocrat" 5 "Benevolent-Autocrat"

. lab val leader_type lab_types

. 
. 
. bysort village game1_group: egen group_leader_type = mean(leader_type)

. lab val group_leader_type lab_types

. 
. lab def vote_lab 1 "Distribution A" 2 "Distribution B"

. lab val vote1 vote_lab

. tab group_leader_type, gen(leader_type)

  group_leader_type |      Freq.     Percent        Cum.
--------------------+-----------------------------------
      True-democrat |        287       64.06       64.06
    Pseudo-democrat |         63       14.06       78.13
        Paternalist |         35        7.81       85.94
           Autocrat |         42        9.38       95.31
Benevolent-Autocrat |         21        4.69      100.00
--------------------+-----------------------------------
              Total |        448      100.00

. 
. 
. 
. ************************************
. *** 1C: Preference game (Game 2)
. 
. gen social_type=6 

. replace social_type = 1 if decision1==1 & decision2==1 & decision3==1
(228 real changes made)

. replace social_type = 2 if decision1==1 & decision2==1 & decision3==2
(51 real changes made)

. replace social_type = 3 if decision1==1 & decision2==2 & decision3==1
(61 real changes made)

. replace social_type = 4 if decision1==1 & decision2==2 & decision3==2
(32 real changes made)

. replace social_type = 5 if decision1==2 & decision2==1 & decision3==2
(24 real changes made)

. 
. gen social_type2 =.
(448 missing values generated)

. replace social_type2=1 if (social_type==1 | social_type==2)
(279 real changes made)

. replace social_type2=2 if (social_type==3 | social_type==4)
(93 real changes made)

. replace social_type2=3 if social_type==5
(24 real changes made)

. replace social_type2=4 if social_type2==. & social_type==6
(52 real changes made)

. 
. # delimit;
delimiter now ;
. label define social
> 1       "Strongly egalitarian"
> 2       "Weakly egalitarian"
> 3   "Strongly generous"
> 4       "Weakly generous"
> 5       "Spiteful"
> 6       "Ambiguous";

. label define social2
> 1       "Egalitarian"
> 2       "Generous"
> 3   "Spiteful"
> 4       "Ambiguous";

. # delimit cr
delimiter now cr
. label values  social_type social

. label values  social_type2 social2

. 
. 
. 
. // Gen dummy for no education
. gen no_educ = 0 if education>0 & education!=.
(44 missing values generated)

. replace no_educ =1 if education==0
(41 real changes made)

. 
. // age-squared
. gen age_sq = age*age
(1 missing value generated)

. 
. // intrinsic motivation - binary variable:
. * Based on the definition of Frey & Oberholzer (1997) ->
. * intrinsic(=1): one likes to do them or because the individual derives some satisfaction from doing  his or her duty
. *extrinsic(=0): activated from the outside
. * if there are both intrinsic and extrinsic motives mentioned, the variable takes the value 1 - there can be some intrinsic motives crowded out by the bonus paymen 
. 
. gen motivation=.
(448 missing values generated)

. replace motivation=0 if f6=="accepted because people but trust in her"
(1 real change made)

. replace motivation=0 if f6=="just accepted what the villagers voted."
(1 real change made)

. replace motivation=1 if f6=="to help the community mantain water"
(1 real change made)

. replace motivation=1 if f6=="because I believe that I was born with characteristic of a leader."
(1 real change made)

. replace motivation=0 if f6=="i just accepted because the villagers appointed me"
(1 real change made)

. replace motivation=1 if f6=="to lead the community. A calling from god. Care for the community"
(1 real change made)

. replace motivation=1 if f6=="to train the committee members to be in goood communication / relationship with tap users"
(1 real change made)

. replace motivation=1 if f6=="accepted the task attributed to him and help his community"
(1 real change made)

. replace motivation=0 if f6=="just accepted the vote"
(2 real changes made)

. replace motivation=1 if f6=="Assist and meet the needs of the villagers"
(1 real change made)

. replace motivation=1 if f6=="to care and protect the use of water"
(1 real change made)

. replace motivation=0 if f6=="he was chosen and just accepted"
(1 real change made)

. replace motivation=0 if f6=="accepted responsibility"
(1 real change made)

. replace motivation=1 if f6=="to lead the community"
(2 real changes made)

. replace motivation=1 if f6=="volunteer to help bring water to the village, help the community"
(1 real change made)

. replace motivation=1 if f6=="to lead the community"
(0 real changes made)

. replace motivation=1 if f6=="help his community"
(1 real change made)

. replace motivation=0 if f6=="was obliged, to lead the village, to bring development to the village"
(1 real change made)

. replace motivation=1 if f6=="guarantee availability of water"
(1 real change made)

. replace motivation=0 if f6=="Accepted because it is a calling by God. Did not want to disappoint the father and villagers."
(1 real change made)

. replace motivation=1 if f6=="to help the community, to keep or take care of the water pipes"
(1 real change made)

. replace motivation=1 if f6=="to fight for the good of the community. To bring it up to standard."
(1 real change made)

. replace motivation=0 if f6=="because there was a lack of people to be in the committee"
(1 real change made)

. replace motivation=0 if f6=="accepted because there was no on else to care and protect the community and it's members"
(1 real change made)

. replace motivation=1 if f6=="arrange meetings, have better / good communication with village, report to senior headman"
(1 real change made)

. replace motivation=0 if f6=="I just accepted the position, because the villagers wanted me to lead them."
(1 real change made)

. replace motivation=1 if f6=="to take care of the water tap"
(1 real change made)

. replace motivation=1 if f6=="lead the community. Care for the community"
(1 real change made)

. replace motivation=1 if f6=="keep water in the community"
(1 real change made)

. replace motivation=0 if f6=="There was no election. Just accepted to be the headman as my father appointed me."
(1 real change made)

. replace motivation=1 if f6=="to lead the community, to take of the water tap"
(1 real change made)

. replace motivation=0 if f6=="just accepted a responsibility given by elders and villagers."
(1 real change made)

. replace motivation=1 if f6=="serving the community, take care of water related needs"
(1 real change made)

. replace motivation=1 if f6=="to lead the community as given by god."
(1 real change made)

. replace motivation=1 if f6=="care and protect the tap, sustain water"
(1 real change made)

. replace motivation=0 if f6=="Just accepted because my late father appointed me and also the villagers trusted/trust me to lead them"
(1 real change made)

. replace motivation=0 if f6=="was appointed to be one of the candidates, just accepted the result of the vote"
(1 real change made)

. replace motivation=0 if f6=="just accepted because people trusted me."
(1 real change made)

. replace motivation=1 if f6=="was given a responsibility and accepted, wanted to help bring private taps to village"
(1 real change made)

. replace motivation=0 if f6=="took over family duties. Was not willing to give the village away to a stranger or another family."
(1 real change made)

. replace motivation=1 if f6=="to keep taps in good condition, to arrange meetings, wotk with community members"
(1 real change made)

. replace motivation=0 if f6=="just accepted the responsibility, because the villagers accepted me as their headman."
(1 real change made)

. replace motivation=0 if f6=="just accepted, because the community voted him"
(1 real change made)

. replace motivation=1 if f6=="to lead the nation. To care for community members. Help provide for community members."
(1 real change made)

. replace motivation=0 if f6=="Accepted villagers decision"
(1 real change made)

. replace motivation=0 if f6=="I just accepted as a calling from God."
(1 real change made)

. replace motivation=1 if f6=="to help develop the village"
(1 real change made)

. replace motivation=0 if f6=="just accepted to lead the villagers, because they appointed/elected me."
(1 real change made)

. replace motivation=1 if f6=="to assist the community, accepted a responsibility given to him by the villagers, help develop the community"
(1 real change made)

. replace motivation=0 if f6=="i just accepted"
(1 real change made)

. replace motivation=1 if f6=="to help develop the village, improve water supply"
(1 real change made)

. replace motivation=0 if f6=="There was no motive, just accepted."
(1 real change made)

. replace motivation=0 if f6=="just accepted the vote"
(0 real changes made)

. replace motivation=1 if f6=="to lead the community. To help develop the community. To help improve people's/community member's lives."
(1 real change made)

. replace motivation=1 if f6=="help out the villagers without expectations"
(1 real change made)

. replace motivation=0 if f6=="" /*leader gave no answer - we set his intrinsic-motivation to 0*/
(385 real changes made)

. replace motivation=0 if f6=="just accepted votes & didnt volunteer to be a candidate"
(1 real change made)

. replace motivation=1 if f6=="A God given gift/role. Did not want to disappoint community members. Lead the community."
(1 real change made)

. replace motivation=0 if f6=="just accepted, because the people voted me"
(1 real change made)

. replace motivation=1 if f6=="God given responsibility as well as responsibility from family and community members. Lead and care for the community."
(1 real change made)

. replace motivation=1 if f6=="to care for taps and the community"
(1 real change made)

. replace motivation=0 if f6=="I just accepted the responsibility"
(1 real change made)

. replace motivation=1 if f6=="wanted to bring taps to the village, especially for drinking water purposes, used to drink from wells"
(1 real change made)

. replace motivation=1 if f6=="assist every community member"
(1 real change made)

. replace motivation=. if id>64
(384 real changes made, 384 to missing)

. lab def motivation 0 "extrinsic" 1 "intrinsic", replace

. lab val motivation motivation

. gen extrinsic_leader = 1 if motivation==0
(419 missing values generated)

. replace extrinsic_leader = 0 if motivation==1
(35 real changes made)

. lab def extrensic 0 "Intrinsic" 1 "Extrinsic", replace

. lab val extrinsic_leader extrensic

. bysort village game1_group: egen group_extrinsic_leader = mean(extrinsic_leader)

. 
. 
. // PERCEPTION OF LEADERS PERFORMANCE BY VILLAGERS
. lab def agree1 1 "strongly disagree" 2 "disagree a little" 3 "neutral" 4 "agree a little" 5 "strongly agree"

. 
. * synchronize scales
. foreach v of varlist b12satisfactionTL b10b {
  2.         replace `v'=5 if `v'==.
  3.         local i = `i' + 1
  4.         gen e_`i'=1 if `v'==4
  5.         replace e_`i'=2 if `v'==3
  6.         replace e_`i'=3 if `v'==5
  7.         replace e_`i'=4 if `v'==2
  8.         replace e_`i'=5 if `v'==1
  9.         replace e_`i'=. if villager==0
 10.         lab val e_`i' agree1
 11.         }
(69 real changes made)
(446 missing values generated)
(1 real change made)
(73 real changes made)
(35 real changes made)
(337 real changes made)
(64 real changes made, 64 to missing)
(69 real changes made)
(444 missing values generated)
(5 real changes made)
(99 real changes made)
(41 real changes made)
(299 real changes made)
(64 real changes made, 64 to missing)

. 
. foreach v of varlist b11g b8b b11f b8c b11h b8d {
  2.         replace `v'=5 if `v'==.
  3.         local i = `i' + 1
  4.         gen e_`i'=1 if `v'==1
  5.         replace e_`i'=2 if `v'==2
  6.         replace e_`i'=3 if `v'==5
  7.         replace e_`i'=4 if `v'==3
  8.         replace e_`i'=5 if `v'==4
  9.         replace e_`i'=. if villager==0
 10.         lab val e_`i' agree1
 11.         }
(91 real changes made)
(424 missing values generated)
(8 real changes made)
(91 real changes made)
(19 real changes made)
(306 real changes made)
(64 real changes made, 64 to missing)
(131 real changes made)
(426 missing values generated)
(13 real changes made)
(131 real changes made)
(30 real changes made)
(252 real changes made)
(64 real changes made, 64 to missing)
(98 real changes made)
(431 missing values generated)
(6 real changes made)
(98 real changes made)
(25 real changes made)
(302 real changes made)
(64 real changes made, 64 to missing)
(208 real changes made)
(391 missing values generated)
(11 real changes made)
(208 real changes made)
(24 real changes made)
(148 real changes made)
(64 real changes made, 64 to missing)
(152 real changes made)
(193 missing values generated)
(10 real changes made)
(152 real changes made)
(6 real changes made)
(25 real changes made)
(64 real changes made, 64 to missing)
(185 real changes made)
(232 missing values generated)
(8 real changes made)
(185 real changes made)
(8 real changes made)
(31 real changes made)
(64 real changes made, 64 to missing)

. 
. *TL specific satisfaction items
. foreach v of varlist b11b b11c b11d b11e b11f b11g b11h {
  2.         replace `v'=5 if `v'==.
  3.         local j = `j' + 1
  4.         gen opinionTL_`j'=1 if `v'==1
  5.         replace opinionTL_`j'=2 if `v'==2
  6.         replace opinionTL_`j'=3 if `v'==5
  7.         replace opinionTL_`j'=4 if `v'==3
  8.         replace opinionTL_`j'=5 if `v'==4
  9.         replace opinionTL_`j'=. if villager==0
 10.         lab val opinionTL_`j' agree1
 11.         }
(207 real changes made)
(245 missing values generated)
(5 real changes made)
(207 real changes made)
(9 real changes made)
(24 real changes made)
(64 real changes made, 64 to missing)
(116 real changes made)
(418 missing values generated)
(8 real changes made)
(116 real changes made)
(25 real changes made)
(269 real changes made)
(64 real changes made, 64 to missing)
(84 real changes made)
(433 missing values generated)
(6 real changes made)
(84 real changes made)
(23 real changes made)
(320 real changes made)
(64 real changes made, 64 to missing)
(126 real changes made)
(421 missing values generated)
(7 real changes made)
(126 real changes made)
(19 real changes made)
(269 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(431 missing values generated)
(6 real changes made)
(98 real changes made)
(25 real changes made)
(302 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(424 missing values generated)
(8 real changes made)
(91 real changes made)
(19 real changes made)
(306 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(193 missing values generated)
(10 real changes made)
(152 real changes made)
(6 real changes made)
(25 real changes made)
(64 real changes made, 64 to missing)

. *scale all items so that higher agreement indicates higher satisfaction
. gen opinionTL_1reverse = 6-opinionTL_1
(64 missing values generated)

. gen opinionTL_7reverse = 6-opinionTL_7
(64 missing values generated)

. 
. alpha e_1 opinionTL_1reverse opinionTL_2 opinionTL_3 opinionTL_4 opinionTL_5 opinionTL_6 opinionTL_7reverse 

Test scale = mean(unstandardized items)

Average interitem covariance:     .3230128
Number of items in the scale:            8
Scale reliability coefficient:      0.7473

. * alpha=0.75 pretty reliable scale, can reduce dimensionality
. *start with simple additative index, 
. egen mean_satisfactionTL = rowmean (e_1 opinionTL_1reverse opinionTL_2 opinionTL_3 opinionTL_4 opinionTL_5 opinionTL_6 opinionTL_7)
(64 missing values generated)

. 
. *DEL specific satisfaction  items
. foreach v of varlist b8a b8b b8c b8d {
  2.         replace `v'=5 if `v'==.
  3.         local k = `k' + 1
  4.         gen opinionDEL_`k'=1 if `v'==1
  5.         replace opinionDEL_`k'=2 if `v'==2
  6.         replace opinionDEL_`k'=3 if `v'==5
  7.         replace opinionDEL_`k'=4 if `v'==3
  8.         replace opinionDEL_`k'=5 if `v'==4
  9.         replace opinionDEL_`k'=. if villager==0
 10.         lab val opinionDEL_`k' agree1
 11.         }
(208 real changes made)
(401 missing values generated)
(16 real changes made)
(208 real changes made)
(36 real changes made)
(141 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(426 missing values generated)
(13 real changes made)
(131 real changes made)
(30 real changes made)
(252 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(391 missing values generated)
(11 real changes made)
(208 real changes made)
(24 real changes made)
(148 real changes made)
(64 real changes made, 64 to missing)
(0 real changes made)
(232 missing values generated)
(8 real changes made)
(185 real changes made)
(8 real changes made)
(31 real changes made)
(64 real changes made, 64 to missing)

. *scale all items so that higher agreement indicates higher satisfaction
. gen opinionTL_4reverse = 6-opinionTL_4
(64 missing values generated)

. 
. alpha e_2 opinionDEL_1 opinionDEL_2 opinionDEL_3 opinionTL_4reverse

Test scale = mean(unstandardized items)
Reversed item:  opinionTL_4reverse

Average interitem covariance:     .2561201
Number of items in the scale:            5
Scale reliability coefficient:      0.5149

. * alpha=0.52 less reliable
. *start with simple additative index, 
. egen mean_satisfactionDEL = rowmean (e_2 opinionDEL_1 opinionDEL_2 opinionDEL_3 opinionTL_4reverse)
(64 missing values generated)

. 
. 
. *generate satisfaction dependent on which leaders villagers were matched with in game 1
. gen satisfaction_TL = mean_satisfactionTL
(64 missing values generated)

. replace satisfaction_TL = . if game1_group!=13
(192 real changes made, 192 to missing)

. gen satisfaction_DEL = mean_satisfactionDEL
(64 missing values generated)

. replace satisfaction_DEL = . if game1_group!=14
(192 real changes made, 192 to missing)

. egen satisfaction_leader = rowmean (satisfaction_TL satisfaction_DEL)
(64 missing values generated)

. lab val satisfaction_leader agree1

. lab var satisfaction_leader "Leader satisfaction index (decision-making, exploitation, etc.)"

. egen z_satisfaction = std(satisfaction_leader)
(64 missing values generated)

. 
. *Satisfaction with performance of DEL / TL
. gen performance_TL = e_1
(64 missing values generated)

. replace performance_TL = . if game1_group!=13
(192 real changes made, 192 to missing)

. gen performance_DEL = e_2
(64 missing values generated)

. replace performance_DEL = . if game1_group!=14
(192 real changes made, 192 to missing)

. egen performance_leader = rowmean (performance_TL performance_DEL)
(64 missing values generated)

. lab val performance_leader agree1

. lab var performance_leader "How satisfied are you with the peformance of the TL/DEL?"

. 
. *label variables
. label var e_1 "Satisfied with the chief in general?"

. label var e_2 "Satisfied with the DEL in general?"

. label var e_3 "The Chief makes decisions in an understandable manner?"

. label var e_4 "The DEL makes decisions in an understandable manner?"

. label var e_5 "The Chief takes appropriate actions against people who disobey the rules?"

. label var e_6 "The DEL takes appropriate actions against people who disobey the rules?"

. label var e_7 "Does the chief exploit his or her position?"

. label var e_8 "Does the DEL exploit his or her position?"

. 
. *Combined Index of leader quality
. gen reverse_e7 = 6-e_7
(64 missing values generated)

. alpha e_1 e_3 e_5 reverse_e7

Test scale = mean(unstandardized items)

Average interitem covariance:     .2492895
Number of items in the scale:            4
Scale reliability coefficient:      0.5633

. 
. 
. ***************************
. **** BIG FIVE
. /*
> Rammstedt, B. & John, O. P. (2007). Measuring personality in one minute or less: A 10-item short version of the Big Five Inventory in English and German. 
> Journal of Research in Personality, 41, 203-212. 
> 
> De Young et al. 2010 Psych. Science: Neuroticism covaried with volume of brain regions associated with threat, punishment, and negative affect. 
> http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3049165/
> 
> 
> Positively formualed items: c29, c25, c28, c32, c34
> Negatively formulated items: c26, c27, c30, c31, c33
> */
. 
. *** 1. Step, gen new variables
. foreach var of varlist c25-c34{
  2. replace `var'=. if `var'==5
  3. gen `var'new = `var'
  4. }
(0 real changes made)
(389 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)
(0 real changes made)
(384 missing values generated)

. 
. *** 2. Step, recode negatively formulated items ***
. foreach var of varlist c26new c27new c30new c31new c33new{
  2. recode `var' (1=4) (2=3) (3=2) (4=1)
  3. }
(c26new: 64 changes made)
(c27new: 64 changes made)
(c30new: 64 changes made)
(c31new: 64 changes made)
(c33new: 64 changes made)

. quietly tab c26 c26new

. quietly tab c27 c27new

. sum c25-c34     /* we have missings for c25, otherwise complete info*/

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         c25 |         59    2.559322     1.47708          1          4
         c26 |         64    2.328125     1.43709          1          4
         c27 |         64    2.421875    1.499256          1          4
         c28 |         64     2.59375     1.46622          1          4
         c29 |         64     2.65625     1.48237          1          4
-------------+---------------------------------------------------------
         c30 |         64     2.90625    1.317992          1          4
         c31 |         64    2.671875    1.369216          1          4
         c32 |         64      2.6875    1.467911          1          4
         c33 |         64     2.90625    1.399759          1          4
         c34 |         64    2.640625    1.505199          1          4

. 
. *** 3. Step: Build variables ***
. /* Higher values mean more agreeable, extraverted etc. */  
. gen extraversion=(c29new+c26new)/2 if leader!=. 
(384 missing values generated)

. gen agreeableness=(c25new+c31new)/2 if leader!=. & c25!=.
(389 missing values generated)

. replace agreeableness=c31new if leader!=. & c25==.
(5 real changes made)

. gen conscientiousness=(c32new+c27new)/2 if leader!=.
(384 missing values generated)

. gen neuroticism=(c33new+c28new)/2 if leader!=.
(384 missing values generated)

. gen openness=(c34new+c30new)/2 if leader!=.
(384 missing values generated)

. 
. *** 4. Step: test for scale reliability (Cronbach's alpha)
. alpha c29new c26new             /*extraversion: 0.86*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.615575
Number of items in the scale:            2
Scale reliability coefficient:      0.8624

. alpha c25new c31new, item       /*agreeableness: 0.81*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.384278
Number of items in the scale:            2
Scale reliability coefficient:      0.8128

. alpha c32new c27new     /*Conscientiousness: 0.92 */

Test scale = mean(unstandardized items)

Average interitem covariance:     1.866071
Number of items in the scale:            2
Scale reliability coefficient:      0.9176

. alpha c33new c28new     /*neuroticism: 0.76 */

Test scale = mean(unstandardized items)

Average interitem covariance:      1.24504
Number of items in the scale:            2
Scale reliability coefficient:      0.7547

. alpha c34new c30new     /*openness: 0.49*/

Test scale = mean(unstandardized items)

Average interitem covariance:     .6532738
Number of items in the scale:            2
Scale reliability coefficient:      0.4922

. 
. *** 5. Step: Standardize BIG5 measures
. foreach var of varlist extraversion-openness{
  2. sum `var'
  3. gen `var'_normal = (`var'-r(min))/(r(max)-r(min))
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
extraversion |         64    2.664063     1.36874          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
agreeablen~s |         64    2.492188    1.310798          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
conscienti~s |         64    2.632813    1.426067          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 neuroticism |         64     2.34375    1.284446          1          4
(384 missing values generated)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    openness |         64    2.367188    1.152093          1          4
(384 missing values generated)

. sum *_normal 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
extraversi~l |         64    .5546875    .4562468          0          1
agreeablen~l |         64    .4973958    .4369327          0          1
conscienti~l |         64    .5442708    .4753558          0          1
neuroticis~l |         64    .4479167    .4281487          0          1
openness_n~l |         64    .4557292    .3840311          0          1

. 
. foreach var of varlist *_normal{
  2. ttest `var', by(leader)
  3. }

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32    .5729167    .0816145    .4616813    .4064628    .7393705
  Chiefs |      32    .5364583    .0808551    .4573854    .3715533    .7013633
---------+--------------------------------------------------------------------
combined |      64    .5546875    .0570308    .4562468    .4407205    .6686545
---------+--------------------------------------------------------------------
    diff |            .0364583    .1148846               -.1931927    .2661094
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.3173
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6240         Pr(|T| > |t|) = 0.7520          Pr(T > t) = 0.3760

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .546875    .0774952    .4383792    .3888225    .7049275
  Chiefs |      32    .4479167    .0772067    .4367473    .2904525    .6053809
---------+--------------------------------------------------------------------
combined |      64    .4973958    .0546166    .4369327    .3882533    .6065384
---------+--------------------------------------------------------------------
    diff |            .0989583     .109391               -.1197112    .3176278
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.9046
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8154         Pr(|T| > |t|) = 0.3692          Pr(T > t) = 0.1846

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .578125    .0843302    .4770436    .4061325    .7501175
  Chiefs |      32    .5104167    .0846461    .4788305    .3377799    .6830535
---------+--------------------------------------------------------------------
combined |      64    .5442708    .0594195    .4753558    .4255305    .6630112
---------+--------------------------------------------------------------------
    diff |            .0677083    .1194845               -.1711377    .3065544
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.5667
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7135         Pr(|T| > |t|) = 0.5730          Pr(T > t) = 0.2865

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .484375    .0757132    .4282987    .3299569    .6387931
  Chiefs |      32    .4114583    .0763118     .431685    .2558193    .5670974
---------+--------------------------------------------------------------------
combined |      64    .4479167    .0535186    .4281487    .3409683     .554865
---------+--------------------------------------------------------------------
    diff |            .0729167    .1074988               -.1419703    .2878037
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   0.6783
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7499         Pr(|T| > |t|) = 0.5001          Pr(T > t) = 0.2501

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     DEL |      32     .515625    .0687345    .3888209    .3754401    .6558099
  Chiefs |      32    .3958333      .06641    .3756714    .2603893    .5312773
---------+--------------------------------------------------------------------
combined |      64    .4557292    .0480039    .3840311    .3598011    .5516573
---------+--------------------------------------------------------------------
    diff |            .1197917    .0955757               -.0712614    .3108447
------------------------------------------------------------------------------
    diff = mean(DEL) - mean(Chiefs)                               t =   1.2534
Ho: diff = 0                                     degrees of freedom =       62

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8926         Pr(|T| > |t|) = 0.2148          Pr(T > t) = 0.1074

. /* No sig differences between leader type*/
. 
. label variable extraversion "B5 extraversion, based on c29 and recoded c26new"

. label variable agreeableness "B5 agreeableness, based on c25 and recoded c31new"

. label variable neuroticism "B5 neuroticism, based on c28 and recoded c33new"

. label variable conscientiousness "B5 conscientiousness, based on c32 and recoded c27new"

. label variable openness "B5 openess, based on c34 and recoded c30new"

. 
. drop c25new-c34new

. 
. 
. // Pairwise correlations
. global big5 *_normal

. foreach var of varlist $big5{
  2. pwcorr extra*_normal `var', sig
  3. }

             | extrav~l extrav~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
extraversi~l |   1.0000   1.0000 
             |   0.0000
             |

             | extrav~l agreea~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
agreeablen~l |   0.8877   1.0000 
             |   0.0000
             |

             | extrav~l consci~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
conscienti~l |   0.8933   1.0000 
             |   0.0000
             |

             | extrav~l neurot~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
neuroticis~l |   0.7980   1.0000 
             |   0.0000
             |

             | extrav~l openne~l
-------------+------------------
extraversi~l |   1.0000 
             |
             |
openness_n~l |   0.7514   1.0000 
             |   0.0000
             |

. /* THAT is Puzzling: Big 5s are strongly correlated among each other. Including them jointly in regressions will be problematic due to multicollinearity */
. ******************************************
. 
. 
. 
. 
. *********C13-C24***************************
. /*we used authentic leadership self-assessment questionnaire (pdf).
> Literature uses 5-point scale, and than simply takes the sum of all 4 items. Values above 15 mean high AL, values of 15 and below mean low AL.
> In our case this would mean value of >12 is high AL, value of 12 and below is low AL.
> However, we have one missing for c13. This person would hence automatically get a low AL score. 
> We could circumvent this problem by taking the average score. (NOT NOW)
> */
. alpha c13 c16 c19 c22           /*moral perspective: 0.72*/

Test scale = mean(unstandardized items)

Average interitem covariance:     .7498122
Number of items in the scale:            4
Scale reliability coefficient:      0.7168

. alpha c14 c17 c20 c23           /*balanced processing: 0.94*/

Test scale = mean(unstandardized items)

Average interitem covariance:     1.769841
Number of items in the scale:            4
Scale reliability coefficient:      0.9400

. alpha c15 c18 c21 c24           /*relation transparency: 0.89*/

Test scale = mean(unstandardized items)
Reversed item:  c18

Average interitem covariance:     1.439153
Number of items in the scale:            4
Scale reliability coefficient:      0.8881

. global AL c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24

. pca $AL

Principal components/correlation                 Number of obs    =         63
                                                 Number of comp.  =          8
                                                 Trace            =         12
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |       8.5811      7.32232             0.7151       0.7151
           Comp2 |      1.25878      .460893             0.1049       0.8200
           Comp3 |      .797884      .163611             0.0665       0.8865
           Comp4 |      .634273      .265805             0.0529       0.9393
           Comp5 |      .368468      .159598             0.0307       0.9700
           Comp6 |      .208871      .101596             0.0174       0.9874
           Comp7 |      .107275     .0639178             0.0089       0.9964
           Comp8 |     .0433571     .0433571             0.0036       1.0000
           Comp9 |            0            0             0.0000       1.0000
          Comp10 |            0            0             0.0000       1.0000
          Comp11 |            0            0             0.0000       1.0000
          Comp12 |            0            .             0.0000       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    ------------------------------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 | Unexplained 
    -------------+--------------------------------------------------------------------------------+-------------
             c13 |   0.3208    0.0298   -0.0208   -0.1035    0.0913    0.3360    0.8725   -0.0500 |           0 
             c14 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c15 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c16 |   0.2263    0.5218    0.3625   -0.0501   -0.0987   -0.7058    0.1851    0.0213 |           0 
             c17 |   0.3314    0.0409    0.1100    0.0062    0.0989    0.0943   -0.2182   -0.9000 |           0 
             c18 |  -0.2049    0.2666    0.4631    0.7441    0.1512    0.3054    0.0343    0.0387 |           0 
             c19 |  -0.0103    0.7180   -0.6419    0.0961   -0.1419    0.1882   -0.0837   -0.0246 |           0 
             c20 |   0.2379   -0.3204   -0.1916    0.5104   -0.7051   -0.1688    0.1142   -0.0697 |           0 
             c21 |   0.2496   -0.1812   -0.4078    0.4026    0.6572   -0.3738    0.0312    0.0621 |           0 
             c22 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c23 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
             c24 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 |           0 
    ------------------------------------------------------------------------------------------------------------

. estat loadings

Principal component loadings (unrotated)
    component normalization: sum of squares(column) = 1

    ----------------------------------------------------------------------------------------------
                 |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 
    -------------+--------------------------------------------------------------------------------
             c13 |    .3208     .0298   -.02084    -.1035    .09128      .336     .8725   -.05001 
             c14 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c15 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c16 |    .2263     .5218     .3625   -.05012   -.09875    -.7058     .1851    .02134 
             c17 |    .3314    .04087       .11   .006219    .09893     .0943    -.2182       -.9 
             c18 |   -.2049     .2666     .4631     .7441     .1512     .3054    .03432    .03871 
             c19 |  -.01034      .718    -.6419    .09615    -.1419     .1882   -.08369    -.0246 
             c20 |    .2379    -.3204    -.1916     .5104    -.7051    -.1688     .1142   -.06972 
             c21 |    .2496    -.1812    -.4078     .4026     .6572    -.3738     .0312    .06212 
             c22 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c23 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
             c24 |    .3391    .02494    .07299   -.01532  -.003855     .1289    -.1641     .1877 
    ----------------------------------------------------------------------------------------------

. predict AL1, score 
(7 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    ----------------------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6     Comp7     Comp8 
    -------------+--------------------------------------------------------------------------------
             c13 |   0.3208    0.0298   -0.0208   -0.1035    0.0913    0.3360    0.8725   -0.0500 
             c14 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c15 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c16 |   0.2263    0.5218    0.3625   -0.0501   -0.0987   -0.7058    0.1851    0.0213 
             c17 |   0.3314    0.0409    0.1100    0.0062    0.0989    0.0943   -0.2182   -0.9000 
             c18 |  -0.2049    0.2666    0.4631    0.7441    0.1512    0.3054    0.0343    0.0387 
             c19 |  -0.0103    0.7180   -0.6419    0.0961   -0.1419    0.1882   -0.0837   -0.0246 
             c20 |   0.2379   -0.3204   -0.1916    0.5104   -0.7051   -0.1688    0.1142   -0.0697 
             c21 |   0.2496   -0.1812   -0.4078    0.4026    0.6572   -0.3738    0.0312    0.0621 
             c22 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c23 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
             c24 |   0.3391    0.0249    0.0730   -0.0153   -0.0039    0.1289   -0.1641    0.1877 
    ----------------------------------------------------------------------------------------------

. sum AL1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         AL1 |         63   -3.78e-09    2.929351  -3.588274   3.158526

. 
. gen moral_perspective=c13+c16+c19+c22
(385 missing values generated)

. gen balance_processing=c14+c17+c20+c23
(384 missing values generated)

. gen relational_transparency=c15+c18+c21+c24
(384 missing values generated)

. label variable moral_perspective "AL moral perspective, total score on c13 c16 c19 and c22"

. label variable balance_processing "AL balance processing, total score on c14 c17 c20 and c23"

. label variable relational_transparency "AL relational transparency, total score on c15 c18 c21 and c24"

. 
. pwcorr moral balance

             | moral_~e balanc~g
-------------+------------------
moral_pers~e |   1.0000 
balance_pr~g |   0.8252   1.0000 

. pwcorr moral relational

             | moral_~e relati~y
-------------+------------------
moral_pers~e |   1.0000 
relational~y |   0.7987   1.0000 

. pwcorr balance relationa

             | balanc~g relati~y
-------------+------------------
balance_pr~g |   1.0000 
relational~y |   0.9073   1.0000 

. egen helpauthentic = rowmean(moral_pers balance_pro relational_trans)
(384 missing values generated)

. gen authentic_leader1=0 if helpauthe!=.
(384 missing values generated)

. replace authentic_leader1=1 if helpauthe>12 & helpauthe!=.
(34 real changes made)

. label variable authentic_leader1 "1=high authentic leadership, 0 otherwise"

. lab def authentic 0 "Low" 1 "High", replace

. lab val authentic_leader1 authentic

. 
. /* AGAIN, very strong correlation among AL variables. Including them jointly in regressions may be no good idea*/
. gen strong_moral=0 if leader!=.
(384 missing values generated)

. replace strong_moral=1 if moral_perspective>=13 & leader!=.
(23 real changes made)

. gen strong_balance=0 if leader!=.
(384 missing values generated)

. replace strong_balance=1 if balance_processing>=13 & leader!=.
(36 real changes made)

. gen strong_relational=0 if leader!=.
(384 missing values generated)

. replace strong_relational=1 if relational_transparency>=13 & leader!=.
(28 real changes made)

. 
. foreach var of varlist  strong_moral strong_balance strong_relational{
  2. tab2 `var' leader, chi2
  3. }

-> tabulation of strong_moral by leader  

strong_mor |        leader
        al |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        21         20 |        41 
         1 |        11         12 |        23 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.0679   Pr = 0.794

-> tabulation of strong_balance by leader  

strong_bal |        leader
      ance |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        13         15 |        28 
         1 |        19         17 |        36 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.2540   Pr = 0.614

-> tabulation of strong_relational by leader  

strong_rel |        leader
   ational |       DEL     Chiefs |     Total
-----------+----------------------+----------
         0 |        17         19 |        36 
         1 |        15         13 |        28 
-----------+----------------------+----------
     Total |        32         32 |        64 

          Pearson chi2(1) =   0.2540   Pr = 0.614

. /* No differences, will not change if we use Fisher exact test for values being very similar*/
. label variable strong_moral"AL dummy for moral perspective"

. label variable strong_balance "AL dummy for balance processing"

. label variable strong_relational "AL dummy for relational transparency"

. 
. gen authentic_leader2=0 if leader!=.
(384 missing values generated)

. replace authentic_leader2=1 if strong_moral==1 & strong_balance==1 & strong_relational==1
(17 real changes made)

. label variable authentic_leader2 "Measure of authentic leadership based on dummies"

. 
. * standardize authentic leadership scale (z-scores)
. egen AL_score=rowmean(moral_perspective balance_processing relational_transparency)
(384 missing values generated)

. egen z_AL_score=std(AL_score)
(384 missing values generated)

. 
. * Village level leader motivation
. bysort village: egen aux_motivation=total(motivation)

. gen intrinsic_DEL=0 if motivation==0 & TL==0
(437 missing values generated)

. replace intrinsic_DEL=1 if motivation==1 & TL==0
(21 real changes made)

. gen intrinsic_TL=0 if motivation==0 & TL==1
(430 missing values generated)

. replace intrinsic_TL=1 if motivation==1 & TL==1
(14 real changes made)

. gen sum_motivation=.
(448 missing values generated)

. replace sum_motivation=0 if aux_motivation==0
(56 real changes made)

. replace sum_motivation=1 if aux_motivation==1 & intrinsic_DEL==0
(7 real changes made)

. replace sum_motivation=1 if aux_motivation==1 & intrinsic_TL==1
(7 real changes made)

. replace sum_motivation=2 if aux_motivation==1 & intrinsic_TL==0
(14 real changes made)

. replace sum_motivation=2 if aux_motivation==1 & intrinsic_DEL==1
(14 real changes made)

. replace sum_motivation=3 if aux_motivation==2
(98 real changes made)

. lab def motivation2 0 "both extrinsic" 1 "DEL extrinsic/ TL intrinsic" 2 "TL extrinsic/ DEL intrinsic"  3 "both intrinsic", replace

. lab val sum_motivation motivation2

. 
. gen bonus_AL=bonus*authentic_leader1
(384 missing values generated)

. 
. 
. 
. /* NOTE:
> - FWe drop d5j (Motorrad), cell phone and freezer as this has too little variation. Drop sewing machine as no obs for leader
> - Include dummies for d6 and d7a, in case of d6 a dummy if main source is private tap (d6==1) und in case of d7 if d7a=02 (concrete)
> */
. 
. * Dummies for main income sources
. gen i_sf=0

. replace i_sf=1 if d1==3 | d1==4
(138 real changes made)

. lab var i_sf "Farming"

. 
. gen i_ob=0 

. replace i_ob=1 if d1==5
(67 real changes made)

. label var i_ob "Own business"

. 
. gen i_em=0

. replace i_em=1 if d1==1 | d1==2
(45 real changes made)

. label var i_em "Employment"

. 
. gen i_p=0

. replace i_p=1 if d1==6
(93 real changes made)

. label var i_p "Pension"

. 
. 
. 
. gen privatetap = (d6==1) if d6!=.
(5 missing values generated)

. gen robustfloor = (d7a==2 | d7a==4) if d7a!=.
(6 missing values generated)

. label variable robustfloor "Dummy taking 1 if concrete or wooden housefloor, based on d7a"

. label variable privatetap "Dummy if privat tap, based on d6"

. 
. // Normalize livestock assets to [0,1] range
. sum d3a 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3a |        442    8.873303    19.44391          0        300

. gen z_cattle = (d3a - r(min))/(r(max)-r(min))
(6 missing values generated)

. sum d3b

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3b |        442    .3733032    2.747666          0         30

. gen z_sheeps = (d3b - r(min))/(r(max)-r(min))
(6 missing values generated)

. sum d3c

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         d3c |        442    13.35068    16.80289          0        200

. gen z_goats = (d3c - r(min))/(r(max)-r(min))
(6 missing values generated)

. 
. bysort villager: sum z_cattle z_sheeps z_goats

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> villager = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         64    .0488021    .0654421          0         .4
    z_sheeps |         64      .00625         .05          0         .4
     z_goats |         64    .1092188    .1390792          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> villager = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |        378    .0263228    .0642247          0          1
    z_sheeps |        378    .0134921    .0968875          0          1
     z_goats |        378    .0595635    .0683105          0         .5


. 
. global asset z_cattle z_sheeps z_goats d5a d5b d5c d5d d5e d5f d5g d5i d5j d5k d5l d5m d5n robustfloor privatetap

. global asset2 d5a d5b d5d d5f d5g d5i d5k-d5n privatetap

. 
. pca $asset2, comp(1)

Principal components/correlation                 Number of obs    =        431
                                                 Number of comp.  =          1
                                                 Trace            =         11
    Rotation: (unrotated = principal)            Rho              =     0.2645

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      2.90923      1.66106             0.2645       0.2645
           Comp2 |      1.24818      .104836             0.1135       0.3779
           Comp3 |      1.14334      .186404             0.1039       0.4819
           Comp4 |      .956937      .136826             0.0870       0.5689
           Comp5 |      .820111     .0212259             0.0746       0.6434
           Comp6 |      .798885     .0776617             0.0726       0.7161
           Comp7 |      .721223     .0385552             0.0656       0.7816
           Comp8 |      .682668     .0664126             0.0621       0.8437
           Comp9 |      .616255     .0419399             0.0560       0.8997
          Comp10 |      .574316     .0454601             0.0522       0.9519
          Comp11 |      .528855            .             0.0481       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
             d5a |   0.1841 |       .9014 
             d5b |   0.3884 |       .5612 
             d5d |   0.3551 |       .6332 
             d5f |   0.2575 |       .8071 
             d5g |   0.3441 |       .6556 
             d5i |   0.3654 |       .6117 
             d5k |   0.2157 |       .8646 
             d5l |   0.2627 |       .7992 
             d5m |   0.3276 |       .6878 
             d5n |   0.2742 |       .7813 
      privatetap |   0.2702 |       .7877 
    --------------------------------------

. estat loadings

Principal component loadings (unrotated)
    component normalization: sum of squares(column) = 1

    ------------------------
                 |    Comp1 
    -------------+----------
             d5a |    .1841 
             d5b |    .3884 
             d5d |    .3551 
             d5f |    .2575 
             d5g |    .3441 
             d5i |    .3654 
             d5k |    .2157 
             d5l |    .2627 
             d5m |    .3276 
             d5n |    .2742 
      privatetap |    .2702 
    ------------------------

. predict pc1, score

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
             d5a |   0.1841 
             d5b |   0.3884 
             d5d |   0.3551 
             d5f |   0.2575 
             d5g |   0.3441 
             d5i |   0.3654 
             d5k |   0.2157 
             d5l |   0.2627 
             d5m |   0.3276 
             d5n |   0.2742 
      privatetap |   0.2702 
    ------------------------

. estat kmo // legitimate pca, kmo=0.79 > 0.7

Kaiser-Meyer-Olkin measure of sampling adequacy

    -----------------------
        Variable |     kmo 
    -------------+---------
             d5a |  0.7485 
             d5b |  0.8123 
             d5d |  0.7777 
             d5f |  0.7751 
             d5g |  0.8669 
             d5i |  0.8242 
             d5k |  0.7672 
             d5l |  0.7011 
             d5m |  0.7625 
             d5n |  0.7944 
      privatetap |  0.8454 
    -------------+---------
         Overall |  0.7924 
    -----------------------

. sum pc1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pc1 |        431   -7.56e-09    1.705647  -2.108749   6.471886

. gen pca_wealth=pc1
(17 missing values generated)

. label var pca_wealth "Socio-economic status proxy based on first component of pca"

. 
. xtile quintile=pca_wealth, nq(5)

. bysort leader: sum pca_wealth

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = DEL

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |         32     .451963    1.621559  -2.108749   3.726418

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = Chiefs

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |         32    1.702505    1.805242  -1.535614   6.471886

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> leader = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  pca_wealth |        367   -.1878555    1.616336  -2.108749    5.90319


. label define quints 1 "Poorest" 2 "Poor" 3 "Medium" 4 "Wealthy" 5 "Wealthiest"

. label values quintile quints

. 
. bysort quintile: sum $asset

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Poorest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         90    .0064074    .0161085          0         .1
    z_sheeps |         90    .0018519    .0175682          0   .1666667
     z_goats |         90    .0268889    .0432498          0         .2
         d5a |         91    .4395604    .4990834          0          1
         d5b |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5c |         91    .9230769    .2679457          0          1
         d5d |         91           0           0          0          0
         d5e |         91           0           0          0          0
         d5f |         91           0           0          0          0
         d5g |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5i |         91           0           0          0          0
         d5j |         91           0           0          0          0
         d5k |         91     .010989    .1048285          0          1
         d5l |         91           0           0          0          0
         d5m |         91           0           0          0          0
-------------+---------------------------------------------------------
         d5n |         91    .1648352    .3730873          0          1
 robustfloor |         91     .032967    .1795395          0          1
  privatetap |         91    .0659341    .2495417          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Poor

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         82    .0156911    .0245088          0   .1066667
    z_sheeps |         82    .0146341    .1068437          0   .9333333
     z_goats |         82    .0370122    .0440318          0         .2
         d5a |         83    .9036145    .2969133          0          1
         d5b |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5c |         83    .9638554    .1877845          0          1
         d5d |         83    .0120482    .1097643          0          1
         d5e |         83    .0120482    .1097643          0          1
         d5f |         83           0           0          0          0
         d5g |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5i |         83     .060241    .2393792          0          1
         d5j |         83           0           0          0          0
         d5k |         83    .1325301    .3411274          0          1
         d5l |         83           0           0          0          0
         d5m |         83           0           0          0          0
-------------+---------------------------------------------------------
         d5n |         83    .5421687    .5012473          0          1
 robustfloor |         83    .0481928    .2154753          0          1
  privatetap |         83     .313253    .4666359          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Medium

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |        100       .0332    .1024579          0          1
    z_sheeps |        100    .0036667    .0176606          0         .1
     z_goats |        100      .06995    .0820953          0         .5
         d5a |        101    .9108911    .2863218          0          1
         d5b |        101     .039604    .1959996          0          1
-------------+---------------------------------------------------------
         d5c |        101     .950495    .2180017          0          1
         d5d |        101     .049505    .2180017          0          1
         d5e |        101     .019802    .1400141          0          1
         d5f |        101     .009901    .0995037          0          1
         d5g |        101    .0792079      .27141          0          1
-------------+---------------------------------------------------------
         d5i |        101    .2475248    .4337267          0          1
         d5j |        101     .029703    .1706133          0          1
         d5k |        101    .3762376     .486857          0          1
         d5l |        101     .009901    .0995037          0          1
         d5m |        101           0           0          0          0
-------------+---------------------------------------------------------
         d5n |        101    .7821782    .4148243          0          1
 robustfloor |        100         .07    .2564324          0          1
  privatetap |        101    .5544554    .4995047          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Wealthy

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         70    .0448571    .0639738          0   .3333333
    z_sheeps |         70    .0171429    .1215497          0          1
     z_goats |         70    .0861429    .0781033          0        .35
         d5a |         70    .9285714    .2593989          0          1
         d5b |         70    .2142857    .4132886          0          1
-------------+---------------------------------------------------------
         d5c |         70    .9714286    .1678015          0          1
         d5d |         70    .1571429    .3665631          0          1
         d5e |         70    .0714286    .2593989          0          1
         d5f |         70    .0142857    .1195229          0          1
         d5g |         70    .2142857    .4132886          0          1
-------------+---------------------------------------------------------
         d5i |         70    .6714286    .4730851          0          1
         d5j |         70    .0857143     .281963          0          1
         d5k |         70    .2857143    .4550158          0          1
         d5l |         70    .0714286    .2593989          0          1
         d5m |         70    .1142857    .3204552          0          1
-------------+---------------------------------------------------------
         d5n |         70    .8857143    .3204552          0          1
 robustfloor |         70    .0714286    .2593989          0          1
  privatetap |         70    .6428571    .4826171          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = Wealthiest

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         86    .0513953    .0617892          0         .4
    z_sheeps |         86     .029845    .1392819          0   .8666667
     z_goats |         86    .1172093    .1187424          0          1
         d5a |         86    .9186047    .2750451          0          1
         d5b |         86    .6162791    .4891434          0          1
-------------+---------------------------------------------------------
         d5c |         86    .9534884    .2118255          0          1
         d5d |         86    .5348837    .5017071          0          1
         d5e |         86     .244186    .4321233          0          1
         d5f |         86    .2906977    .4567476          0          1
         d5g |         86    .5813953    .4962238          0          1
-------------+---------------------------------------------------------
         d5i |         86    .7790698    .4173068          0          1
         d5j |         86    .0581395    .2353796          0          1
         d5k |         86    .4767442    .5023883          0          1
         d5l |         86     .244186    .4321233          0          1
         d5m |         86    .3837209    .4891434          0          1
-------------+---------------------------------------------------------
         d5n |         86    .9069767    .2921686          0          1
 robustfloor |         86    .1046512    .3078988          0          1
  privatetap |         86    .7790698    .4173068          0          1

------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> quintile = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    z_cattle |         14    .0235714    .0295685          0   .0833333
    z_sheeps |         14           0           0          0          0
     z_goats |         14       .0675    .0560134          0       .175
         d5a |         11    .8181818    .4045199          0          1
         d5b |         11    .2727273    .4670994          0          1
-------------+---------------------------------------------------------
         d5c |         12    .9166667    .2886751          0          1
         d5d |         11    .1818182    .4045199          0          1
         d5e |         12    .1666667    .3892495          0          1
         d5f |         11    .0909091    .3015113          0          1
         d5g |         11    .0909091    .3015113          0          1
-------------+---------------------------------------------------------
         d5i |         12    .0833333    .2886751          0          1
         d5j |         11    .0909091    .3015113          0          1
         d5k |         11    .1818182    .4045199          0          1
         d5l |         10          .1    .3162278          0          1
         d5m |         10          .2     .421637          0          1
-------------+---------------------------------------------------------
         d5n |         10          .2     .421637          0          1
 robustfloor |         12    .0833333    .2886751          0          1
  privatetap |         12         .25     .452267          0          1


. 
. 
. 
. 
. *** Create Variable that informs about years living in village ***
. /* Problem: for 50% of sample, a6 takes the value of "1". What does this mean? */
. 
. ** lifetime spent in village
. replace a6=2000 if id==380
(1 real change made)

. *Assistant for got a zero in the year
. gen years_in_village = .
(448 missing values generated)

. gen a6_new = 2015-a6 if a6 > 1
(226 missing values generated)

. label variable a6_new "Transformation of a6 in years"

. replace years_in_village = age if a6==1
(222 real changes made)

. replace  years_in_village = a6_new if a6 > 1
(222 real changes made)

. gen rootedness=years_in_village/age
(5 missing values generated)

. replace rootedness=1 if rootedness > 1
(58 real changes made)

. label variable rootedness "Fraction of lifetime spent in village"

. *some are younger than the time spent in the village (they probably have been living there all their life)
. 
. 
. *** experience in years
. gen experience = 2015-f1
(384 missing values generated)

. label variable experience "Years in office"

. 
. 
. // Competition
. gen f5new=f5
(390 missing values generated)

. replace f5new=0 if f5new==. & leader!=.
(6 real changes made)

. rename f5new competitor

. 
. gen dcompetitor = (competitor>0 & competitor!=.)

. label variable competitor "Number of competitors in previous election"

. label variable dcompetitor "Dummy=1 if there were some other candidates in previous election"

. 
. /*
> gen competitor2=competitor
> replace competitor2=20 if competitor2>=20 & competitor2!=.
> */
. 
. // Term office
. gen term=f2a
(384 missing values generated)

. label variable term "Dummy=1 if person faces term office"

. 
. // Elected
. gen elected =1 if f3b==1 | (f3==1 | f3==2)
(412 missing values generated)

. replace elected=0 if elected ==. & leader!=.
(28 real changes made)

. label variable elected "Dummy=1 if person was elected rather than appointed"

. 
. // Secret elections
. gen secretelec = 1 if f4c==1
(432 missing values generated)

. replace secretelec = 0 if f4c>1 & f4c!=.
(47 real changes made)

. label var secretelec "Dummy =1 if elections were secretly held"

. 
. 
. save "$working_ANALYSIS\processed\analysis_wide.dta", replace
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\processed\analysis_wide.dta saved

. 
. 
. /*
> Reshape dataset into long-format for analysis of bonus payment rounds.
> Generate additional variables for analysis in long-format.
> */
. reshape long rule vote majority payoff, i(id) j(decision)
(note: j = 1 2 3 4 5 6)
(note: payoff2 not found)
(note: payoff3 not found)
(note: payoff4 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      448   ->    2688
Number of variables                 442   ->     426
j variable (6 values)                     ->   decision
xij variables:
                  rule1 rule2 ... rule6   ->   rule
                  vote1 vote2 ... vote6   ->   vote
      majority1 majority2 ... majority6   ->   majority
            payoff1 payoff2 ... payoff6   ->   payoff
-----------------------------------------------------------------------------

. 
. *Drop all decisions except 1, 5 and 6 (basic, bonus1, bonus2)
. drop if decision>1 & decision<5
(1,344 observations deleted)

. drop if id>64
(1,152 observations deleted)

. order decision rule vote majority payoff, after(session_id)

. order session_id, after(id)

. 
. *---------------------------------------------------------
. * Generating additional variables for long-format analysis
. *---------------------------------------------------------
. * Binary rule choice
. gen dem=0

. replace dem=1 if rule==1
(123 real changes made)

. 
. gen dic=0

. replace dic=1 if rule==3
(14 real changes made)

. 
. gen fake=0

. replace fake=1 if rule==2
(55 real changes made)

. *bonus: 0=no bonus, 1=any bonus
. gen bonus=0

. replace bonus=1 if decision>4
(128 real changes made)

. 
. 
. *bonus_size: 0=no, 1=small, 2=large
. gen bonus_size=0

. replace bonus_size=1 if decision==5
(64 real changes made)

. replace bonus_size=2 if decision==6
(64 real changes made)

. lab def bonus_size1 0 "Baseline" 1 "Small Bonus" 2 "Large Bonus", replace

. lab val bonus_size bonus_size1

. 
. 
. *Generate identifier for the first bonus that was offered
. gen bonus_first=0 if (decision==6 & randomization<7) | (decision==5 & randomization>6)
(128 missing values generated)

. replace bonus_first=1 if (decision==5 & randomization<7) | (decision==6 & randomization>6)
(64 real changes made)

. label def first_lab 0 "3rd round" 1 "2nd round", replace

. lab val bonus_first first_lab

. 
. replace rule=1 if dem==1
(0 real changes made)

. replace rule=2 if fake==1
(0 real changes made)

. replace rule=3 if dic==1
(0 real changes made)

. 
. label def bonus 0 "Baseline (n=64)" 1 "Pooled Bonus (n=128)", replace

. label def rule 1 "Democratic" 2 "Pseudo-democratic" 3 "Autocratic" , replace

. label val bonus bonus

. label val rule rule

. 
. order bonus bonus_size bonus_order randomization dem dic fake, after(majority)

. 
. *rule choice variable for basic round
. gen rule_basic = rule if decision==1
(128 missing values generated)

. replace rule_basic = rule_basic[_n-1] if missing(rule_basic)
(128 real changes made)

. order rule_basic, after(rule)

. label def rule_basic 1 "Base: Democratic (n=41)" 2 "Base: Pseudo (n=14)" 3 "Base: Autocrat (n=9)", replace

. label val rule_basic rule_basic

. 
. 
. qui tab bonus_size, gen(bonus_)

. qui tab bonus_order, gen(order_)

. qui tab rule_basic, gen(baseline_)

. 
. *interactions 
. gen bonus_democrat=bonus*baseline_1

. gen bonus_pseudo=bonus*baseline_2

. gen bonus_dictator=bonus*baseline_3

. 
. *
. 
. // Globals
. global order order_3

. global socio education age pca_wealth male experience married rootedness

. 
. *interactions
. gen bonus_extrinsic=bonus*extrinsic_leader

. gen bonus_TL=bonus*TL

. 
. 
. save "$working_ANALYSIS\processed\analysis_long.dta", replace
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\processed\analysis_long.dta saved

. 
. 
. 
. 
. ** EOF
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. 
. 
. 
. *--------------------------------------------------
. * (2) Analysis WIDE format
. *--------------------------------------------------
. clear all

. use "$working_ANALYSIS/processed/analysis_wide.dta"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. 
. * Figure S2.    Rule choices dependent on baseline
. *Small bonus
. catplot rule5, over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:A} Small bonus") b1title("") legend(ring(1) po
> s(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2a.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2a.gph saved)

. 
. *Large bonus
. catplot rule6, over(rule_base) asyvar recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:B} Large bonus") b1title("") legend(ring(1) pos
> (6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2b.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2b.gph saved)

. 
. *First bonus
. catplot rule_bonus_first, over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:C} First bonus") b1title("") legend
> (ring(1) pos(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2c.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2c.gph saved)

. 
. *Second bonus
. catplot rule_bonus_second , over(rule_base) asyvar  recast(bar) yla(0(5)30) blabel(bar, format(%9.0f) pos(top)  gap(0.1)) title("{bf:D} Second bonus") b1title("") leg
> end(ring(1) pos(6) rows(1)) 
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2d.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2d.gph saved)

. 
. grc1leg "$working_ANALYSIS/results/intermediate/figureS2a.gph""$working_ANALYSIS/results/intermediate/figureS2b.gph" "$working_ANALYSIS/results/intermediate/figureS2c
> .gph" "$working_ANALYSIS/results/intermediate/figureS2d.gph", rows(2) pos(6) ring(1)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)
(note:  named style top not found in class barlabelpos, default attributes used)
(note:  barlabelpos not found in scheme, default attributes used)

. gr save "$working_ANALYSIS/results/intermediate/figureS2.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS2.gph saved)

. gr export "$working_ANALYSIS/results/figures/figureS2.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS2.tif written in TIFF format)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD42b8_000000.tmp"

. * Figure S4.    Preferred distribution by leaders and villagers in the baseline
. *PANEL A: Leaders
. catplot vote1 , over(rule_base) asyvar recast(bar) yla(0(20)100, nogrid) percent(rule_base) bargap(10) blabel(bar, format(%9.0f) pos(outside)  gap(0.1)) title("{bf:A}
>  Leaders")  b1title("") legend(ring(1) pos(6) rows(1))

. gr save  "$working_ANALYSIS/results/intermediate/figureS4a.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS4a.gph saved)

. 
. *PANEL B: Villagers
. catplot vote1 if id>64, asyvar recast(bar) yla(0(20)100, nogrid) percent bargap(10)  blabel(bar, format(%9.0f)pos(outside)  gap(0.1)) title("{bf:B} Villagers")  b1tit
> le("") legend(ring(1) pos(6) rows(1))

. gr save  "$working_ANALYSIS/results/intermediate/figureS4b.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS4b.gph saved)

. 
. grc1leg  "$working_ANALYSIS/results/intermediate/figureS4a.gph" "$working_ANALYSIS/results/intermediate/figureS4b.gph", rows(1) pos(6) ring(1) 

. gr save "$working_ANALYSIS/results/intermediate/figureS4.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/figureS4.gph saved)

. gr export "$working_ANALYSIS/results/figures/figureS4.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/figureS4.tif written in TIFF format)

. 
end of do-file

. exit, clear
