-------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/logs/2023.08.23-12.27.51.log.txt
  log type:  text
 opened on:  23 Aug 2023, 12:27:51

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 23 Aug 2023 12:27:51

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;
> lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduces transpar
> ency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
. 
. *--------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. *--------------------------------------------------
. * Load cleaned dataset (long-format)
. clear

. use "$working_ANALYSIS/processed/analysis_long.dta"

. 
. *set panel
. xtset id decision
       panel variable:  id (strongly balanced)
        time variable:  decision, 1 to 6, but with gaps
                delta:  1 unit

. 
. *revision: time trend
. gen round= 1 if bonus_first==.
(128 missing values generated)

. replace round = 2 if bonus_first==1
(64 real changes made)

. replace round = 3 if bonus_first==0
(64 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. lab def order1 0 "Base-Large-Small" 1 "Base-Small-Large", replace

. lab val bonus_order order1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit fake bonus_1 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood =  -114.9984  
Iteration 1:   log pseudolikelihood = -113.09846  
Iteration 2:   log pseudolikelihood = -113.09531  
Iteration 3:   log pseudolikelihood = -113.09531  

Fitting full model:

rho =  0.0     log pseudolikelihood = -113.09531
rho =  0.1     log pseudolikelihood = -109.50028
rho =  0.2     log pseudolikelihood = -106.85965
rho =  0.3     log pseudolikelihood = -104.95446
rho =  0.4     log pseudolikelihood = -103.67659
rho =  0.5     log pseudolikelihood = -102.99775
rho =  0.6     log pseudolikelihood = -102.97063
rho =  0.7     log pseudolikelihood = -103.77414

Iteration 0:   log pseudolikelihood = -102.97557  
Iteration 1:   log pseudolikelihood = -101.54769  
Iteration 2:   log pseudolikelihood = -101.40994  
Iteration 3:   log pseudolikelihood = -101.40943  
Iteration 4:   log pseudolikelihood = -101.40943  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       3.97
Log pseudolikelihood  = -101.40943              Prob > chi2       =     0.2652

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.4614349   .3139349    -1.47   0.142    -1.076736    .1538663
     bonus_3 |   .0713124   .2771217     0.26   0.797    -.4718362     .614461
 bonus_order |   .3387109   .4152962     0.82   0.415    -.4752546    1.152676
       _cons |  -.9703856   .3528396    -2.75   0.006    -1.661939   -.2788326
-------------+----------------------------------------------------------------
    /lnsig2u |   .4616659   .4812244                     -.4815165    1.404848
-------------+----------------------------------------------------------------
     sigma_u |   1.259649   .3030868                      .7860316     2.01864
         rho |   .6134093   .1141167                      .3818941    .8029521
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(fake=1), predict(pr)
dy/dx w.r.t. : bonus_1 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.0961699    .063935    -1.50   0.133    -.2214802    .0291404
     bonus_3 |   .0148626   .0577308     0.26   0.797    -.0982878    .1280129
 bonus_order |   .0705924   .0860772     0.82   0.412    -.0981159    .2393007
------------------------------------------------------------------------------

. 
end of do-file

. tab bonus3
variable bonus3 not found
r(111);

. tab bonus_3

bonus_size= |
     =Large |
      Bonus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        128       66.67       66.67
          1 |         64       33.33      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dem bonus_1 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -125.38709  
Iteration 1:   log pseudolikelihood = -125.13711  
Iteration 2:   log pseudolikelihood =  -125.1371  

Fitting full model:

rho =  0.0     log pseudolikelihood =  -125.1371
rho =  0.1     log pseudolikelihood = -120.75301
rho =  0.2     log pseudolikelihood = -117.40806
rho =  0.3     log pseudolikelihood = -114.86156
rho =  0.4     log pseudolikelihood = -112.98925
rho =  0.5     log pseudolikelihood = -111.75008
rho =  0.6     log pseudolikelihood = -111.18782
rho =  0.7     log pseudolikelihood = -111.49319

Iteration 0:   log pseudolikelihood = -111.19027  
Iteration 1:   log pseudolikelihood =  -110.5521  
Iteration 2:   log pseudolikelihood = -110.53321  
Iteration 3:   log pseudolikelihood = -110.53321  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       0.20
Log pseudolikelihood  = -110.53321              Prob > chi2       =     0.9783

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.0040703   .2964191    -0.01   0.989    -.5850411    .5769005
     bonus_3 |  -.0004308   .2642776    -0.00   0.999    -.5184054    .5175438
 bonus_order |  -.1862215   .4213684    -0.44   0.659    -1.012088    .6396453
       _cons |   .6984892   .3495222     2.00   0.046     .0134383     1.38354
-------------+----------------------------------------------------------------
    /lnsig2u |   .5654265   .4499982                     -.3165538    1.447407
-------------+----------------------------------------------------------------
     sigma_u |   1.326725   .2985119                      .8536134    2.062056
         rho |   .6377072   .1039661                      .4215158     .809599
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dem=1), predict(pr)
dy/dx w.r.t. : bonus_1 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |  -.0009149   .0666289    -0.01   0.989    -.1315052    .1296754
     bonus_3 |  -.0000968   .0594032    -0.00   0.999     -.116525    .1163313
 bonus_order |  -.0418581   .0944824    -0.44   0.658    -.2270401     .143324
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dic bonus_1 bonus_3 bonus_order, vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -50.134837  
Iteration 1:   log pseudolikelihood = -46.751419  
Iteration 2:   log pseudolikelihood = -46.668355  
Iteration 3:   log pseudolikelihood = -46.668238  
Iteration 4:   log pseudolikelihood = -46.668238  

Fitting full model:

rho =  0.0     log pseudolikelihood = -46.668238
rho =  0.1     log pseudolikelihood =  -46.34144
rho =  0.2     log pseudolikelihood = -46.487345

Iteration 0:   log pseudolikelihood =  -46.34144  
Iteration 1:   log pseudolikelihood = -46.224904  
Iteration 2:   log pseudolikelihood = -45.725694  
Iteration 3:   log pseudolikelihood = -45.716321  
Iteration 4:   log pseudolikelihood = -45.716168  
Iteration 5:   log pseudolikelihood = -45.716168  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(3)      =       5.89
Log pseudolikelihood  = -45.716168              Prob > chi2       =     0.1171

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |   .7685142   .3654187     2.10   0.035     .0523066    1.484722
     bonus_3 |  -.2117097   .4085308    -0.52   0.604    -1.012415    .5889961
 bonus_order |  -.3149328   .3841314    -0.82   0.412    -1.067817    .4379509
       _cons |  -1.933231   .4224659    -4.58   0.000    -2.761249   -1.105213
-------------+----------------------------------------------------------------
    /lnsig2u |   -.664432   .8165016                     -2.264746    .9358817
-------------+----------------------------------------------------------------
     sigma_u |   .7173324   .2928515                      .3222677    1.596703
         rho |   .3397447   .1831562                      .0940851     .718267
------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dic=1), predict(pr)
dy/dx w.r.t. : bonus_1 bonus_3 bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     bonus_1 |   .0804475   .0394257     2.04   0.041     .0031745    .1577204
     bonus_3 |  -.0221616   .0421551    -0.53   0.599    -.1047841    .0604609
 bonus_order |  -.0329669   .0402543    -0.82   0.413    -.1118639    .0459301
------------------------------------------------------------------------------

. 
end of do-file

. tab rule_base

       rule_base |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base: Democratic |        123       64.06       64.06
    Base: Pseudo |         42       21.88       85.94
Base: Autocratic |         27       14.06      100.00
-----------------+-----------------------------------
           Total |        192      100.00

. tab rule_base, nolab

  rule_base |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        123       64.06       64.06
          2 |         42       21.88       85.94
          3 |         27       14.06      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab rule_base1

group_rule_ |
base==Base: |
 Democratic |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         69       35.94       35.94
          1 |        123       64.06      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo reg_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id: if rule_base!=1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
extrinsic_leader |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
 bonus_extrinsic |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
     bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
           _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo reg_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id: if rule_base!=1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -49.060375  
Iteration 1:   log restricted-likelihood = -49.060289  
Iteration 2:   log restricted-likelihood = -49.060289  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.73
Log restricted-likelihood = -49.060289          Prob > chi2       =     0.1511

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |       -.25   .1446355    -1.73   0.084    -.5334803    .0334803
extrinsic_leader |  -.4776405   .2054262    -2.33   0.020    -.8802684   -.0750125
 bonus_extrinsic |   .3863636   .2091426     1.85   0.065    -.0235482    .7962755
     bonus_order |    .149792   .1544132     0.97   0.332    -.1528524    .4524363
           _cons |   .7459547   .1681187     4.44   0.000     .4164481    1.075461
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2728565   .0785525      .1551966    .4797182
-----------------------------+------------------------------------------------
                sd(Residual) |   .4090909   .0436092      .3319567    .5041482
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.35          Prob >= chibar2 = 0.0103

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo reg_het3: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id: if rule_base!=1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -24.37734  
Iteration 1:   log restricted-likelihood = -24.375499  
Iteration 2:   log restricted-likelihood = -24.375499  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      37.01
Log restricted-likelihood = -24.375499          Prob > chi2       =     0.0000

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0416667   .1022903    -0.41   0.684    -.2421519    .1588186
extrinsic_leader |   .4741345    .136293     3.48   0.001     .2070051     .741264
 bonus_extrinsic |   -.594697   .1479115    -4.02   0.000    -.8845981   -.3047958
     bonus_order |  -.0836801   .0963009    -0.87   0.385    -.2724263    .1050662
           _cons |     .21548    .109669     1.96   0.049     .0005328    .4304273
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1508404   .0566407      .0722588    .3148798
-----------------------------+------------------------------------------------
                sd(Residual) |   .2893206   .0308417      .2347691    .3565477
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.60          Prob >= chibar2 = 0.0534

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. gen type=0

. replace type=1 if rule_base!=1 & extrinsic==0
(36 real changes made)

. replace type=2 if rule_base!=1 & extrinsic==1
(33 real changes made)

. replace type=3 if rule_base==1 & extrinsic==0
(69 real changes made)

. replace type=4 if rule_base==1 & extrinsic==1
(54 real changes made)

. lab def typo 1 "Box I" 2 "Box III" 3 "Box II" 4 "Box IV", replace

. lab val type typo

. 
end of do-file

. tab type

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |         36       18.75       18.75
    Box III |         33       17.19       35.94
     Box II |         69       35.94       71.88
     Box IV |         54       28.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab type if round==1

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |         12       18.75       18.75
    Box III |         11       17.19       35.94
     Box II |         23       35.94       71.88
     Box IV |         18       28.13      100.00
------------+-----------------------------------
      Total |         64      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmprobit rule bonus bonus_order, robust
command xtmprobit is unrecognized
r(199);

end of do-file

r(199);

. help xtprobit

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mprobit rule bonus bonus_order, vce(id)
vcetype 'id' not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mprobit rule bonus bonus_order, cluster(id)

Iteration 0:   log pseudolikelihood = -156.05588  
Iteration 1:   log pseudolikelihood = -155.59802  
Iteration 2:   log pseudolikelihood = -155.59245  
Iteration 3:   log pseudolikelihood = -155.59245  

Multinomial probit regression                   Number of obs     =        192
                                                Wald chi2(4)      =       7.06
Log pseudolikelihood = -155.59245               Prob > chi2       =     0.1327

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             rule |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
Democratic        |  (base outcome)
------------------+----------------------------------------------------------------
Pseudo_democratic |
            bonus |   .2975364   .2353973     1.26   0.206    -.1638339    .7589067
      bonus_order |   .3016971   .3706743     0.81   0.416    -.4248112    1.028205
            _cons |  -1.059987   .3027227    -3.50   0.000    -1.653312   -.4666611
------------------+----------------------------------------------------------------
Autocratic        |
            bonus |  -.7899665   .4054291    -1.95   0.051    -1.584593    .0046599
      bonus_order |  -.2020001    .453668    -0.45   0.656    -1.091173    .6871729
            _cons |  -1.091828    .356129    -3.07   0.002    -1.789828    -.393828
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins, dydx(bonus)

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

dy/dx w.r.t. : bonus
1._predict   : Pr(rule==Democratic), predict(pr outcome(1))
2._predict   : Pr(rule==Pseudo-democratic), predict(pr outcome(2))
3._predict   : Pr(rule==Autocratic), predict(pr outcome(3))

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
bonus        |
    _predict |
          1  |  -.0109626   .0598247    -0.18   0.855     -.128217    .1062917
          2  |    .100676    .056045     1.80   0.072    -.0091703    .2105222
          3  |  -.0897134   .0386461    -2.32   0.020    -.1654584   -.0139683
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mprobit rule i.bonus##i.type bonus_order, cluster(id)

Iteration 0:   log pseudolikelihood = -97.075701  (not concave)
Iteration 1:   log pseudolikelihood = -97.040902  (not concave)
Iteration 2:   log pseudolikelihood = -96.925358  (not concave)
Iteration 3:   log pseudolikelihood = -96.915024  (not concave)
Iteration 4:   log pseudolikelihood = -96.906238  (not concave)
Iteration 5:   log pseudolikelihood = -96.897531  (not concave)
Iteration 6:   log pseudolikelihood = -96.893314  (not concave)
Iteration 7:   log pseudolikelihood = -96.877996  (not concave)
Iteration 8:   log pseudolikelihood =  -96.87433  (not concave)
Iteration 9:   log pseudolikelihood =  -96.87323  (not concave)
Iteration 10:  log pseudolikelihood = -96.872198  (not concave)
Iteration 11:  log pseudolikelihood = -96.871405  (not concave)
Iteration 12:  log pseudolikelihood = -96.870696  (not concave)
Iteration 13:  log pseudolikelihood = -96.869111  (not concave)
Iteration 14:  log pseudolikelihood = -96.867468  (not concave)
Iteration 15:  log pseudolikelihood =  -96.86725  (not concave)
Iteration 16:  log pseudolikelihood = -96.866982  (not concave)
Iteration 17:  log pseudolikelihood = -96.866715  (not concave)
Iteration 18:  log pseudolikelihood =  -96.86659  (not concave)
Iteration 19:  log pseudolikelihood = -96.866523  (not concave)
Iteration 20:  log pseudolikelihood = -96.866382  (not concave)
Iteration 21:  log pseudolikelihood = -96.866315  (not concave)
Iteration 22:  log pseudolikelihood = -96.866034  (not concave)
Iteration 23:  log pseudolikelihood = -96.865965  (not concave)
Iteration 24:  log pseudolikelihood =  -96.86593  (not concave)
Iteration 25:  log pseudolikelihood = -96.865904  (not concave)
Iteration 26:  log pseudolikelihood = -96.865882  (not concave)
Iteration 27:  log pseudolikelihood = -96.865868  (not concave)
Iteration 28:  log pseudolikelihood = -96.865853  (not concave)
Iteration 29:  log pseudolikelihood = -96.865739  (not concave)
Iteration 30:  log pseudolikelihood = -96.865726  (not concave)
Iteration 31:  log pseudolikelihood = -96.865724  (not concave)
Iteration 32:  log pseudolikelihood = -96.865722  (not concave)
Iteration 33:  log pseudolikelihood = -96.865721  (not concave)
Iteration 34:  log pseudolikelihood = -96.865719  (not concave)
Iteration 35:  log pseudolikelihood = -96.865717  (not concave)
Iteration 36:  log pseudolikelihood = -96.865716  (not concave)
Iteration 37:  log pseudolikelihood = -96.865715  (not concave)
Iteration 38:  log pseudolikelihood = -96.865715  (not concave)
Iteration 39:  log pseudolikelihood = -96.865714  (not concave)
Iteration 40:  log pseudolikelihood = -96.865713  (not concave)
Iteration 41:  log pseudolikelihood = -96.865712  (not concave)
Iteration 42:  log pseudolikelihood = -96.865712  (not concave)
Iteration 43:  log pseudolikelihood = -96.865711  (not concave)
Iteration 44:  log pseudolikelihood = -96.865711  (not concave)
Iteration 45:  log pseudolikelihood = -96.865711  (not concave)
Iteration 46:  log pseudolikelihood =  -96.86571  (not concave)
Iteration 47:  log pseudolikelihood =  -96.86571  (not concave)
Iteration 48:  log pseudolikelihood =  -96.86571  (not concave)
Iteration 49:  log pseudolikelihood = -96.865709  (not concave)
Iteration 50:  log pseudolikelihood = -96.865709  (not concave)
Iteration 51:  log pseudolikelihood = -96.865708  (not concave)
Iteration 52:  log pseudolikelihood = -96.865708  (not concave)
Iteration 53:  log pseudolikelihood = -96.865708  (not concave)
Iteration 54:  log pseudolikelihood = -96.865708  (not concave)
Iteration 55:  log pseudolikelihood = -96.865708  (not concave)
Iteration 56:  log pseudolikelihood = -96.865708  (not concave)
Iteration 57:  log pseudolikelihood = -96.865707  (not concave)
Iteration 58:  log pseudolikelihood = -96.865707  (not concave)
Iteration 59:  log pseudolikelihood = -96.865707  (not concave)
Iteration 60:  log pseudolikelihood = -96.865707  (not concave)
Iteration 61:  log pseudolikelihood = -96.865707  (not concave)
Iteration 62:  log pseudolikelihood = -96.865707  (not concave)
Iteration 63:  log pseudolikelihood = -96.865707  (not concave)
Iteration 64:  log pseudolikelihood = -96.865707  (not concave)
Iteration 65:  log pseudolikelihood = -96.865707  (not concave)
Iteration 66:  log pseudolikelihood = -96.865707  (not concave)
Iteration 67:  log pseudolikelihood = -96.865707  (not concave)
Iteration 68:  log pseudolikelihood = -96.865707  (not concave)
Iteration 69:  log pseudolikelihood = -96.865706  (not concave)
Iteration 70:  log pseudolikelihood = -96.865706  (not concave)
Iteration 71:  log pseudolikelihood = -96.865706  (not concave)
Iteration 72:  log pseudolikelihood = -96.865706  (not concave)
Iteration 73:  log pseudolikelihood = -96.865706  (not concave)
Iteration 74:  log pseudolikelihood = -96.865706  (not concave)
Iteration 75:  log pseudolikelihood = -96.865706  (not concave)
Iteration 76:  log pseudolikelihood = -96.865706  (not concave)
Iteration 77:  log pseudolikelihood = -96.865706  (not concave)
Iteration 78:  log pseudolikelihood = -96.865706  (not concave)
Iteration 79:  log pseudolikelihood = -96.865706  (not concave)
Iteration 80:  log pseudolikelihood = -96.865706  (not concave)
Iteration 81:  log pseudolikelihood = -96.865706  (not concave)
Iteration 82:  log pseudolikelihood = -96.865706  (not concave)
Iteration 83:  log pseudolikelihood = -96.865706  (not concave)
Iteration 84:  log pseudolikelihood = -96.865706  (not concave)
Iteration 85:  log pseudolikelihood = -96.865706  (not concave)
Iteration 86:  log pseudolikelihood = -96.865706  (not concave)
Iteration 87:  log pseudolikelihood = -96.865706  (not concave)
Iteration 88:  log pseudolikelihood = -96.865706  (not concave)
Iteration 89:  log pseudolikelihood = -96.865706  (not concave)
Iteration 90:  log pseudolikelihood = -96.865706  (not concave)
Iteration 91:  log pseudolikelihood = -96.865706  (not concave)
Iteration 92:  log pseudolikelihood = -96.865706  (not concave)
Iteration 93:  log pseudolikelihood = -96.865706  (not concave)
Iteration 94:  log pseudolikelihood = -96.865706  (not concave)
Iteration 95:  log pseudolikelihood = -96.865706  (not concave)
Iteration 96:  log pseudolikelihood = -96.865706  (not concave)
Iteration 97:  log pseudolikelihood = -96.865706  (not concave)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. reg rule i.bonus##i.type bonus_order, cluster(id)

Linear regression                               Number of obs     =        192
                                                F(8, 63)          =      58.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5000
                                                Root MSE          =     .45303

                                                     (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                         rule |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                        bonus |
        Pooled Bonus (n=128)  |  -.3333333   .1643105    -2.03   0.047    -.6616817    -.004985
                              |
                         type |
                     Box III  |   .4733789   .1806081     2.62   0.011     .1124624    .8342955
                      Box II  |  -1.170943    .108027   -10.84   0.000    -1.386818   -.9550686
                      Box IV  |   -1.17631   .1108639   -10.61   0.000    -1.397854    -.954766
                              |
                   bonus#type |
Pooled Bonus (n=128)#Box III  |  -.8030303   .3051496    -2.63   0.011    -1.412823   -.1932376
 Pooled Bonus (n=128)#Box II  |   .6376812    .191724     3.33   0.001     .2545514    1.020811
 Pooled Bonus (n=128)#Box IV  |         .5   .1786243     2.80   0.007     .1430477    .8569523
                              |
                  bonus_order |  -.0694311   .0775324    -0.90   0.374    -.2243673    .0855051
                        _cons |   2.207168   .1307617    16.88   0.000     1.945862    2.468475
-----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. reg dem i.bonus##i.type bonus_order, cluster(id)

Linear regression                               Number of obs     =        192
                                                F(8, 63)          =   22817.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4500
                                                Root MSE          =     .36449

                                                     (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                          dem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                        bonus |
        Pooled Bonus (n=128)  |   .2916667   .1128361     2.58   0.012     .0661817    .5171516
                              |
                         type |
                     Box III  |  -.0009538   .0051977    -0.18   0.855    -.0113406     .009433
                      Box II  |   1.001108   .0051789   193.30   0.000     .9907586    1.011457
                      Box IV  |   1.002498   .0096205   104.20   0.000      .983273    1.021723
                              |
                   bonus#type |
Pooled Bonus (n=128)#Box III  |   .2083333   .1739463     1.20   0.236    -.1392706    .5559373
 Pooled Bonus (n=128)#Box II  |  -.5525362   .1400585    -3.95   0.000    -.8324207   -.2726517
 Pooled Bonus (n=128)#Box IV  |  -.4583333   .1328183    -3.45   0.001    -.7237495   -.1929171
                              |
                  bonus_order |   .0179858   .0647289     0.28   0.782    -.1113646    .1473363
                        _cons |  -.0104917   .0378713    -0.28   0.783    -.0861716    .0651881
-----------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule type, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus motivation) asyvar recast(bar) yla(`pctlabel') blabel(bar, format(%9.0f) pos(c
> enter) gap(0.1)) title("{bf:A} Rule Choices") 

. gr_edit scaleaxis.title.draw_view.setstyle, style(no)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule type, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus type) asyvar recast(bar) yla(`pctlabel') blabel(bar, format(%9.0f) pos(center)
>  gap(0.1)) title("{bf:A} Rule Choices") 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule type if round>1, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus type) asyvar recast(bar) yla(`pctlabel') blabel(bar, format(%9.0f) 
> pos(center) gap(0.1)) title("{bf:A} Rule Choices") 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. mylabels 0(20)100, myscale(@) local(pctlabel) suffix("%")
0 "0%" 20 "20%" 40 "40%" 60 "60%" 80 "80%" 100 "100%"

. catplot rule motivation, over(bonus, label(labsize(8pt))) horizontal stack percent(bonus motivation) asyvar recast(bar) yla(`pctlabel') blabel(bar, format(%9.0f)
>  pos(center) gap(0.1)) title("{bf:A} Rule Choices") 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. *Baseline democrats
. preserve

. drop if rule_base!=1
(69 observations deleted)

. eststo dem_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
extrinsic_leader |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
 bonus_extrinsic |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
     bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
           _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dem_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -42.56502  
Iteration 1:   log restricted-likelihood = -42.561915  
Iteration 2:   log restricted-likelihood = -42.561915  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.58
Log restricted-likelihood = -42.561915          Prob > chi2       =     0.0135

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2173913   .0752281     2.89   0.004      .069947    .3648356
extrinsic_leader |  -.0022367   .1041568    -0.02   0.983    -.2063803    .2019069
 bonus_extrinsic |  -.0507246   .1135365    -0.45   0.655    -.2732521    .1718029
     bonus_order |  -.0289374   .0710378    -0.41   0.684     -.168169    .1102942
           _cons |   .0150978   .0782513     0.19   0.847    -.1382719    .1684675
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1498833   .0421851      .0863336    .2602117
-----------------------------+------------------------------------------------
                sd(Residual) |   .2945766   .0232883      .2522928    .3439471
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.50          Prob >= chibar2 = 0.0169

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dem_het3: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  67.949525  
Iteration 1:   log restricted-likelihood =  68.443412  
Iteration 2:   log restricted-likelihood =  68.443466  
Iteration 3:   log restricted-likelihood =  68.443466  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       5.66
Log restricted-likelihood =  68.443466          Prob > chi2       =     0.2259

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0434783   .0322121     1.35   0.177    -.0196564    .1066129
extrinsic_leader |    -.00264   .0397336    -0.07   0.947    -.0805165    .0752364
 bonus_extrinsic |  -.0434783   .0486155    -0.89   0.371     -.138763    .0518064
     bonus_order |  -.0341556   .0228206    -1.50   0.134    -.0788831    .0105719
           _cons |   .0178203   .0288706     0.62   0.537     -.038765    .0744056
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   8.86e-12   2.33e-11      5.09e-14    1.54e-09
-----------------------------+------------------------------------------------
                sd(Residual) |   .1261356   .0082107      .1110272       .1433
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.8e-14       Prob >= chibar2 = 1.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. restore

. 
. *Baseline autocrats
. preserve

. drop if rule_base!=1
(69 observations deleted)

. eststo dem_het4: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
extrinsic_leader |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
 bonus_extrinsic |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
     bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
           _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dem_het5: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -42.56502  
Iteration 1:   log restricted-likelihood = -42.561915  
Iteration 2:   log restricted-likelihood = -42.561915  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.58
Log restricted-likelihood = -42.561915          Prob > chi2       =     0.0135

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2173913   .0752281     2.89   0.004      .069947    .3648356
extrinsic_leader |  -.0022367   .1041568    -0.02   0.983    -.2063803    .2019069
 bonus_extrinsic |  -.0507246   .1135365    -0.45   0.655    -.2732521    .1718029
     bonus_order |  -.0289374   .0710378    -0.41   0.684     -.168169    .1102942
           _cons |   .0150978   .0782513     0.19   0.847    -.1382719    .1684675
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1498833   .0421851      .0863336    .2602117
-----------------------------+------------------------------------------------
                sd(Residual) |   .2945766   .0232883      .2522928    .3439471
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.50          Prob >= chibar2 = 0.0169

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dem_het6: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  67.949525  
Iteration 1:   log restricted-likelihood =  68.443412  
Iteration 2:   log restricted-likelihood =  68.443466  
Iteration 3:   log restricted-likelihood =  68.443466  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       5.66
Log restricted-likelihood =  68.443466          Prob > chi2       =     0.2259

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0434783   .0322121     1.35   0.177    -.0196564    .1066129
extrinsic_leader |    -.00264   .0397336    -0.07   0.947    -.0805165    .0752364
 bonus_extrinsic |  -.0434783   .0486155    -0.89   0.371     -.138763    .0518064
     bonus_order |  -.0341556   .0228206    -1.50   0.134    -.0788831    .0105719
           _cons |   .0178203   .0288706     0.62   0.537     -.038765    .0744056
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   8.86e-12   2.33e-11      5.09e-14    1.54e-09
-----------------------------+------------------------------------------------
                sd(Residual) |   .1261356   .0082107      .1110272       .1433
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.8e-14       Prob >= chibar2 = 1.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. restore

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base==1
(123 observations deleted)

. eststo dem_het4: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
extrinsic_leader |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
 bonus_extrinsic |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
     bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
           _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo dem_het5: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -49.060375  
Iteration 1:   log restricted-likelihood = -49.060289  
Iteration 2:   log restricted-likelihood = -49.060289  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.73
Log restricted-likelihood = -49.060289          Prob > chi2       =     0.1511

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |       -.25   .1446355    -1.73   0.084    -.5334803    .0334803
extrinsic_leader |  -.4776405   .2054262    -2.33   0.020    -.8802684   -.0750125
 bonus_extrinsic |   .3863636   .2091426     1.85   0.065    -.0235482    .7962755
     bonus_order |    .149792   .1544132     0.97   0.332    -.1528524    .4524363
           _cons |   .7459547   .1681187     4.44   0.000     .4164481    1.075461
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2728565   .0785525      .1551966    .4797182
-----------------------------+------------------------------------------------
                sd(Residual) |   .4090909   .0436092      .3319567    .5041482
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.35          Prob >= chibar2 = 0.0103

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo dem_het6: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -24.37734  
Iteration 1:   log restricted-likelihood = -24.375499  
Iteration 2:   log restricted-likelihood = -24.375499  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      37.01
Log restricted-likelihood = -24.375499          Prob > chi2       =     0.0000

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0416667   .1022903    -0.41   0.684    -.2421519    .1588186
extrinsic_leader |   .4741345    .136293     3.48   0.001     .2070051     .741264
 bonus_extrinsic |   -.594697   .1479115    -4.02   0.000    -.8845981   -.3047958
     bonus_order |  -.0836801   .0963009    -0.87   0.385    -.2724263    .1050662
           _cons |     .21548    .109669     1.96   0.049     .0005328    .4304273
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1508404   .0566407      .0722588    .3148798
-----------------------------+------------------------------------------------
                sd(Residual) |   .2893206   .0308417      .2347691    .3565477
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.60          Prob >= chibar2 = 0.0534

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. restore

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base!=1
(69 observations deleted)

. eststo dem_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
extrinsic_leader |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
 bonus_extrinsic |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
     bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
           _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo fake_het1: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -42.56502  
Iteration 1:   log restricted-likelihood = -42.561915  
Iteration 2:   log restricted-likelihood = -42.561915  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.58
Log restricted-likelihood = -42.561915          Prob > chi2       =     0.0135

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2173913   .0752281     2.89   0.004      .069947    .3648356
extrinsic_leader |  -.0022367   .1041568    -0.02   0.983    -.2063803    .2019069
 bonus_extrinsic |  -.0507246   .1135365    -0.45   0.655    -.2732521    .1718029
     bonus_order |  -.0289374   .0710378    -0.41   0.684     -.168169    .1102942
           _cons |   .0150978   .0782513     0.19   0.847    -.1382719    .1684675
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1498833   .0421851      .0863336    .2602117
-----------------------------+------------------------------------------------
                sd(Residual) |   .2945766   .0232883      .2522928    .3439471
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.50          Prob >= chibar2 = 0.0169

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dic_het1: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  67.949525  
Iteration 1:   log restricted-likelihood =  68.443412  
Iteration 2:   log restricted-likelihood =  68.443466  
Iteration 3:   log restricted-likelihood =  68.443466  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       5.66
Log restricted-likelihood =  68.443466          Prob > chi2       =     0.2259

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0434783   .0322121     1.35   0.177    -.0196564    .1066129
extrinsic_leader |    -.00264   .0397336    -0.07   0.947    -.0805165    .0752364
 bonus_extrinsic |  -.0434783   .0486155    -0.89   0.371     -.138763    .0518064
     bonus_order |  -.0341556   .0228206    -1.50   0.134    -.0788831    .0105719
           _cons |   .0178203   .0288706     0.62   0.537     -.038765    .0744056
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   8.86e-12   2.33e-11      5.09e-14    1.54e-09
-----------------------------+------------------------------------------------
                sd(Residual) |   .1261356   .0082107      .1110272       .1433
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.8e-14       Prob >= chibar2 = 1.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. restore

. 
. *Baseline autocrats
. preserve

. drop if rule_base==1
(123 observations deleted)

. eststo dem_het2: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
extrinsic_leader |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
 bonus_extrinsic |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
     bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
           _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo fake_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -49.060375  
Iteration 1:   log restricted-likelihood = -49.060289  
Iteration 2:   log restricted-likelihood = -49.060289  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.73
Log restricted-likelihood = -49.060289          Prob > chi2       =     0.1511

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |       -.25   .1446355    -1.73   0.084    -.5334803    .0334803
extrinsic_leader |  -.4776405   .2054262    -2.33   0.020    -.8802684   -.0750125
 bonus_extrinsic |   .3863636   .2091426     1.85   0.065    -.0235482    .7962755
     bonus_order |    .149792   .1544132     0.97   0.332    -.1528524    .4524363
           _cons |   .7459547   .1681187     4.44   0.000     .4164481    1.075461
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2728565   .0785525      .1551966    .4797182
-----------------------------+------------------------------------------------
                sd(Residual) |   .4090909   .0436092      .3319567    .5041482
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.35          Prob >= chibar2 = 0.0103

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo dic_het2: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -24.37734  
Iteration 1:   log restricted-likelihood = -24.375499  
Iteration 2:   log restricted-likelihood = -24.375499  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      37.01
Log restricted-likelihood = -24.375499          Prob > chi2       =     0.0000

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0416667   .1022903    -0.41   0.684    -.2421519    .1588186
extrinsic_leader |   .4741345    .136293     3.48   0.001     .2070051     .741264
 bonus_extrinsic |   -.594697   .1479115    -4.02   0.000    -.8845981   -.3047958
     bonus_order |  -.0836801   .0963009    -0.87   0.385    -.2724263    .1050662
           _cons |     .21548    .109669     1.96   0.049     .0005328    .4304273
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1508404   .0566407      .0722588    .3148798
-----------------------------+------------------------------------------------
                sd(Residual) |   .2893206   .0308417      .2347691    .3565477
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.60          Prob >= chibar2 = 0.0534

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. restore

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1 dem_het2, offset(0.2) msymbol(D)) (fake_het1 fake_het2, offset(0) msymbol(S)) (dic_het1 dic_het2, offset(-0.2) msymbol(O)), keep(bonus extrins
> ic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction") xline(0, lpattern(dash) lcolo
> r(gs3)) title("{bf:B} Interaction effects") xtitle("Regression estimated impact relative to baseline in pp") msymbol(d)  xla(-0.4(0.1)0.4, nogrid) grid(none) lev
> els(95 90) ciopts(lwidth(0.3 1) lcolor(*.8 *.2)recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) mlabsize(7pt) mlabpos
> ition(12) mlabgap(-0.1)  legend(order(3 "Democratic" 6 "Pseudo-democratic" 9 "Autocratic")) graphregion(margin(tiny))
(note:  named style medthin not found in class linestyle, default attributes used)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(0) label(Autocratic )), bylabel(Baseline: De
> mocrats (in SBD)) ||(rv2, offset(0.3) label(ATE)) (rv4,offset(-0.3) label(Heterogeneous effects)), bylabel(RV: Likert Index (in SD)) ||, keep(bonus extrinsic_lea
> der bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern
> (dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) 
> mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(n
> one) margin(medium) nobox justification(left)  bmargin(top))  xsize(4) ysize(3)
estimation result rv2 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo-democratic or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bon
> us_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) 
> levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbo
> l(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo-democratic or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bon
> us_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) 
> levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbo
> l(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.25)1, nogrid)  xsize(4) y
> size(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base==1
(123 observations deleted)

. eststo dem_het2: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
extrinsic_leader |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
 bonus_extrinsic |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
     bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
           _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo fake_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -49.060375  
Iteration 1:   log restricted-likelihood = -49.060289  
Iteration 2:   log restricted-likelihood = -49.060289  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.73
Log restricted-likelihood = -49.060289          Prob > chi2       =     0.1511

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |       -.25   .1446355    -1.73   0.084    -.5334803    .0334803
extrinsic_leader |  -.4776405   .2054262    -2.33   0.020    -.8802684   -.0750125
 bonus_extrinsic |   .3863636   .2091426     1.85   0.065    -.0235482    .7962755
     bonus_order |    .149792   .1544132     0.97   0.332    -.1528524    .4524363
           _cons |   .7459547   .1681187     4.44   0.000     .4164481    1.075461
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2728565   .0785525      .1551966    .4797182
-----------------------------+------------------------------------------------
                sd(Residual) |   .4090909   .0436092      .3319567    .5041482
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.35          Prob >= chibar2 = 0.0103

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo dic_het2: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -24.37734  
Iteration 1:   log restricted-likelihood = -24.375499  
Iteration 2:   log restricted-likelihood = -24.375499  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      37.01
Log restricted-likelihood = -24.375499          Prob > chi2       =     0.0000

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0416667   .1022903    -0.41   0.684    -.2421519    .1588186
extrinsic_leader |   .4741345    .136293     3.48   0.001     .2070051     .741264
 bonus_extrinsic |   -.594697   .1479115    -4.02   0.000    -.8845981   -.3047958
     bonus_order |  -.0836801   .0963009    -0.87   0.385    -.2724263    .1050662
           _cons |     .21548    .109669     1.96   0.049     .0005328    .4304273
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1508404   .0566407      .0722588    .3148798
-----------------------------+------------------------------------------------
                sd(Residual) |   .2893206   .0308417      .2347691    .3565477
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.60          Prob >= chibar2 = 0.0534

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. restore

. 
end of do-file

. tab type

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |         36       18.75       18.75
    Box III |         33       17.19       35.94
     Box II |         69       35.94       71.88
     Box IV |         54       28.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab type if round==1

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |         12       18.75       18.75
    Box III |         11       17.19       35.94
     Box II |         23       35.94       71.88
     Box IV |         18       28.13      100.00
------------+-----------------------------------
      Total |         64      100.00

. bys rule: tab type if round==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> rule = Democratic

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
     Box II |         23       56.10       56.10
     Box IV |         18       43.90      100.00
------------+-----------------------------------
      Total |         41      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> rule = Pseudo-democratic

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |         10       71.43       71.43
    Box III |          4       28.57      100.00
------------+-----------------------------------
      Total |         14      100.00

-------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> rule = Autocratic

       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      Box I |          2       22.22       22.22
    Box III |          7       77.78      100.00
------------+-----------------------------------
      Total |          9      100.00


. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.2) label(Baseline: Democratic rule)) (dem_het2, offset(-0.2) label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bon
> us_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) 
> lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(
> cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) ma
> rgin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.2) label(Baseline: Democratic rule)) (dem_het2, offset(-0.2) label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bon
> us_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) 
> lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(
> cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) ma
> rgin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1 fake_het1, label(Baseline: Democratic rule)) (dem_het2 fake_het2,label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bonus_ext
> rinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor
> (gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@
> pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(m
> edium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Baseline: Democratic rule)) (dem_het2,label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(b
> onus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regre
> ssion estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", con
> d(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justifi
> cation(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bonus_extrinsic) coe
> flabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtit
> le("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "
> ***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobo
> x justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)
invalid 'keep' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) c
> oeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xt
> itle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01,
>  "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) no
> box justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Democratic)) (fake_het1, label(Pseudo-democratic)), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autoc
> ratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction") 
>  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.
> 8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabpositi
> on(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. tab rule

             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |        123       64.06       64.06
Pseudo-democratic |         55       28.65       92.71
       Autocratic |         14        7.29      100.00
------------------+-----------------------------------
            Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo-democratic or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bon
> us_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) 
> levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbo
> l(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ys
> ize(3)

. 
end of do-file

.  do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsi
> c = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 9
> 0) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsi
> ze(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. tab order_1

bonus_order |
    ==Large |
      first |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        102       53.13       53.13
          1 |         90       46.88      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab bonus_order

     bonus_order |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base-Large-Small |         90       46.88       46.88
Base-Small-Large |        102       53.13      100.00
-----------------+-----------------------------------
           Total |        192      100.00

. tab bonus_order, nolab

bonus_order |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         90       46.88       46.88
          1 |        102       53.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base!=1 & bonus_order==1
(42 observations deleted)

. eststo dem_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -80.893308  
Iteration 1:   log restricted-likelihood = -80.893271  
Iteration 2:   log restricted-likelihood = -80.893271  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        150
Group variable: id                              Number of groups  =         50

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      11.27
Log restricted-likelihood = -80.893271          Prob > chi2       =     0.0237

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.1607143   .0793225    -2.03   0.043    -.3161836    -.005245
extrinsic_leader |   .0112695   .1197042     0.09   0.925    -.2233465    .2458855
 bonus_extrinsic |    .137987   .1195832     1.15   0.249    -.0963918    .3723658
     bonus_order |   .2235507   .0904771     2.47   0.013     .0462188    .4008827
           _cons |   .7256211   .0882791     8.22   0.000     .5525974    .8986449
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2421931    .043224      .1707058    .3436173
-----------------------------+------------------------------------------------
                sd(Residual) |   .3427125   .0244795      .2979407    .3942122
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 14.36         Prob >= chibar2 = 0.0001

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "50´"

. eststo fake_het1: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -70.911477  
Iteration 1:   log restricted-likelihood = -70.911319  
Iteration 2:   log restricted-likelihood = -70.911319  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        150
Group variable: id                              Number of groups  =         50

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.67
Log restricted-likelihood = -70.911319          Prob > chi2       =     0.0130

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .1785714   .0752797     2.37   0.018      .031026    .3261169
extrinsic_leader |  -.0703463   .1104961    -0.64   0.524    -.2869147    .1462221
 bonus_extrinsic |  -.0194805   .1134884    -0.17   0.864    -.2419136    .2029526
     bonus_order |  -.1333333   .0815969    -1.63   0.102    -.2932604    .0265937
           _cons |   .1642857   .0811338     2.02   0.043     .0052664     .323305
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2104503   .0407836       .143944    .3076845
-----------------------------+------------------------------------------------
                sd(Residual) |   .3252453   .0232318      .2827554    .3741202
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 11.29         Prob >= chibar2 = 0.0004

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "50´"

. eststo dic_het1: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  5.3887507  
Iteration 1:   log restricted-likelihood =  5.5018326  
Iteration 2:   log restricted-likelihood =  5.5019554  
Iteration 3:   log restricted-likelihood =  5.5019554  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        150
Group variable: id                              Number of groups  =         50

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      11.61
Log restricted-likelihood =  5.5019554          Prob > chi2       =     0.0205

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0178571   .0489763    -0.36   0.715     -.113849    .0781347
extrinsic_leader |   .0590768   .0626941     0.94   0.346    -.0638013    .1819549
 bonus_extrinsic |  -.1185065   .0738346    -1.61   0.108    -.2632196    .0262067
     bonus_order |  -.0902174   .0393426    -2.29   0.022    -.1673275   -.0131073
           _cons |   .1100932   .0448427     2.46   0.014     .0222031    .1979832
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .0597374   .0365797      .0179895    .1983686
-----------------------------+------------------------------------------------
                sd(Residual) |   .2116019   .0151144      .1839584    .2433995
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.75          Prob >= chibar2 = 0.1937

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "50´"

. restore

. 
. *Baseline autocrats
. preserve

. drop if rule_base==1 & bonus_order==1
(60 observations deleted)

. eststo dem_het2: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -85.003692  
Iteration 1:   log restricted-likelihood = -85.003523  
Iteration 2:   log restricted-likelihood = -85.003523  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        132
Group variable: id                              Number of groups  =         44

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      19.66
Log restricted-likelihood = -85.003523          Prob > chi2       =     0.0006

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -3.33e-16   .0990773    -0.00   1.000    -.1941879    .1941879
extrinsic_leader |   .0104694   .1391805     0.08   0.940    -.2623194    .2832583
 bonus_extrinsic |   .1666667   .1434138     1.16   0.245    -.1144192    .4477525
     bonus_order |  -.4326241   .1084649    -3.99   0.000    -.6452113   -.2200369
           _cons |   .6099291   .1016384     6.00   0.000     .4107214    .8091367
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |    .249034   .0520673      .1653072    .3751676
-----------------------------+------------------------------------------------
                sd(Residual) |   .3879649    .029582      .3341096    .4505012
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 9.65          Prob >= chibar2 = 0.0009

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "44´"

. eststo fake_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -81.959745  
Iteration 1:   log restricted-likelihood = -81.959611  
Iteration 2:   log restricted-likelihood = -81.959611  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        132
Group variable: id                              Number of groups  =         44

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.86
Log restricted-likelihood = -81.959611          Prob > chi2       =     0.0021

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0217391   .0964638    -0.23   0.822    -.2108046    .1673264
extrinsic_leader |  -.2552898    .136126    -1.88   0.061    -.5220918    .0115122
 bonus_extrinsic |   .1884058   .1396307     1.35   0.177    -.0852653    .4620769
     bonus_order |    .378926   .1065121     3.56   0.000     .1701661    .5876859
           _cons |   .3194573     .09945     3.21   0.001      .124539    .5143756
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2462249   .0507077      .1644505    .3686625
-----------------------------+------------------------------------------------
                sd(Residual) |   .3777309   .0288017      .3252962    .4386175
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 10.08         Prob >= chibar2 = 0.0008

. matrix N_g = e(N_g)

. local individuals 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsi
> c = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 9
> 0) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsi
> ze(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. tab bonus_order

     bonus_order |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base-Large-Small |         90       46.88       46.88
Base-Small-Large |        102       53.13      100.00
-----------------+-----------------------------------
           Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base!=1 & bonus_order=0
=exp not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. *Baseline democrats
. preserve

. drop if rule_base!=1 & bonus_order==0
(27 observations deleted)

. eststo dem_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -96.627051  
Iteration 1:   log restricted-likelihood =  -96.62705  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        165
Group variable: id                              Number of groups  =         55

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       7.51
Log restricted-likelihood =  -96.62705          Prob > chi2       =     0.1112

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.1333333   .0775128    -1.72   0.085    -.2852556    .0185889
extrinsic_leader |  -.0535504    .123229    -0.43   0.664    -.2950749    .1879741
 bonus_extrinsic |   .1333333     .11497     1.16   0.246    -.0920038    .3586704
     bonus_order |  -.2065124   .0988945    -2.09   0.037    -.4003421   -.0126827
           _cons |   .8974579   .1040213     8.63   0.000     .6935799    1.101336
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2945519   .0432197       .220935    .3926983
-----------------------------+------------------------------------------------
                sd(Residual) |   .3466477   .0235864      .3033691    .3961003
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 25.34         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "55´"

. eststo fake_het1: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -89.567329  
Iteration 1:   log restricted-likelihood = -89.567326  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        165
Group variable: id                              Number of groups  =         55

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       8.66
Log restricted-likelihood = -89.567326          Prob > chi2       =     0.0703

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0666667   .0750034     0.89   0.374    -.0803374    .2136707
extrinsic_leader |  -.1073636   .1167766    -0.92   0.358    -.3362416    .1215144
 bonus_extrinsic |   .0933333   .1112481     0.84   0.401    -.1247089    .3113755
     bonus_order |   .1790917   .0924473     1.94   0.053    -.0021018    .3602852
           _cons |   .1199086   .0980934     1.22   0.222     -.072351    .3121682
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2707699   .0412245      .2009119     .364918
-----------------------------+------------------------------------------------
                sd(Residual) |   .3354255   .0228228       .293548    .3832772
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 22.36         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "55´"

. eststo dic_het1: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  14.701284  
Iteration 1:   log restricted-likelihood =  14.732693  
Iteration 2:   log restricted-likelihood =  14.732701  
Iteration 3:   log restricted-likelihood =  14.732701  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        165
Group variable: id                              Number of groups  =         55

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      13.99
Log restricted-likelihood =  14.732701          Prob > chi2       =     0.0073

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0666667   .0438385     1.52   0.128    -.0192551    .1525885
extrinsic_leader |    .160914   .0570092     2.82   0.005      .049178      .27265
 bonus_extrinsic |  -.2266667   .0650229    -3.49   0.000    -.3541093    -.099224
     bonus_order |   .0274207   .0379483     0.72   0.470    -.0469565    .1017979
           _cons |  -.0173665   .0453232    -0.38   0.702    -.1061984    .0714655
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .0765561   .0264898      .0388551    .1508382
-----------------------------+------------------------------------------------
                sd(Residual) |   .1960516   .0133396      .1715747    .2240202
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.59          Prob >= chibar2 = 0.0538

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "55´"

. restore

. 
. *Baseline autocrats
. preserve

. drop if rule_base==1 & bonus_order==0
(63 observations deleted)

. eststo dem_het2: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -81.695629  
Iteration 1:   log restricted-likelihood = -81.695629  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        129
Group variable: id                              Number of groups  =         43

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      10.86
Log restricted-likelihood = -81.695629          Prob > chi2       =     0.0282

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0416667   .0887874     0.47   0.639    -.1323535    .2156868
extrinsic_leader |  -.0782423   .1493621    -0.52   0.600    -.3709867    .2145021
 bonus_extrinsic |   .1951754     .13357     1.46   0.144    -.0666169    .4569678
     bonus_order |   .3215203   .1463852     2.20   0.028     .0346105      .60843
           _cons |   .2454631   .1526025     1.61   0.108    -.0536324    .5445586
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .3323361   .0522208      .2442452    .4521982
-----------------------------+------------------------------------------------
                sd(Residual) |   .3551497   .0274004      .3053091    .4131265
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 24.57         Prob >= chibar2 = 0.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "43´"

. eststo fake_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -82.648684  
Iteration 1:   log restricted-likelihood = -82.648683  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        129
Group variable: id                              Number of groups  =         43

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       3.74
Log restricted-likelihood = -82.648683          Prob > chi2       =     0.4420

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0208333   .0909077    -0.23   0.819    -.1990091    .1573424
extrinsic_leader |  -.2064875    .148226    -1.39   0.164    -.4970051    .0840301
 bonus_extrinsic |   .1524123   .1367596     1.11   0.265    -.1156317    .4204562
     bonus_order |  -.1582948   .1426664    -1.11   0.267    -.4379159    .1213263
           _cons |   .5419834   .1498815     3.62   0.000     .2482211    .8357457
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .3174365   .0521269      .2300802    .4379599
-----------------------------+------------------------------------------------
                sd(Residual) |   .3636307   .0280547      .3125999     .422992
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 20.91         Prob >= chibar2 = 0.0000

. matrix N_g = e(N
too few ')' or ']'
r(132);

end of do-file

r(132);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. coefplot (dem_het1, offset(0.3) label(Democratic)) (fake_het1, offset(0) label(Pseudo Democratic)) (dic_het1, offset(-0.3) label(Autocratic)), bylabel(Baseline: 
> Democrats) || (dem_het2, offset(0.3) label(Democratic)) (fake_het2,offset(0) label(Pseudo Democratic)) (dic_het2, offset(-0.3) label(Autocratic)), bylabel(Baseli
> ne: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsi
> c = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 9
> 0) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsi
> ze(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base!=1
(69 observations deleted)

. eststo dem_het1: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
extrinsic_leader |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
 bonus_extrinsic |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
     bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
           _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo fake_het1: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -42.56502  
Iteration 1:   log restricted-likelihood = -42.561915  
Iteration 2:   log restricted-likelihood = -42.561915  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.58
Log restricted-likelihood = -42.561915          Prob > chi2       =     0.0135

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2173913   .0752281     2.89   0.004      .069947    .3648356
extrinsic_leader |  -.0022367   .1041568    -0.02   0.983    -.2063803    .2019069
 bonus_extrinsic |  -.0507246   .1135365    -0.45   0.655    -.2732521    .1718029
     bonus_order |  -.0289374   .0710378    -0.41   0.684     -.168169    .1102942
           _cons |   .0150978   .0782513     0.19   0.847    -.1382719    .1684675
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1498833   .0421851      .0863336    .2602117
-----------------------------+------------------------------------------------
                sd(Residual) |   .2945766   .0232883      .2522928    .3439471
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.50          Prob >= chibar2 = 0.0169

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dic_het1: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  67.949525  
Iteration 1:   log restricted-likelihood =  68.443388  
Iteration 2:   log restricted-likelihood =  68.443466  
Iteration 3:   log restricted-likelihood =  68.443466  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       5.66
Log restricted-likelihood =  68.443466          Prob > chi2       =     0.2259

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0434783   .0322121     1.35   0.177    -.0196564    .1066129
extrinsic_leader |    -.00264   .0397336    -0.07   0.947    -.0805165    .0752364
 bonus_extrinsic |  -.0434783   .0486155    -0.89   0.371     -.138763    .0518064
     bonus_order |  -.0341556   .0228206    -1.50   0.134    -.0788831    .0105719
           _cons |   .0178203   .0288706     0.62   0.537     -.038765    .0744056
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   8.62e-12   2.01e-11      8.87e-14    8.38e-10
-----------------------------+------------------------------------------------
                sd(Residual) |   .1261356   .0082107      .1110272       .1433
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.8e-14       Prob >= chibar2 = 1.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. restore

. 
. *Baseline autocrats
. preserve

. drop if rule_base==1 
(123 observations deleted)

. eststo dem_het2: xtmixed dem bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

----------------------------------------------------------------------------------
             dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
extrinsic_leader |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
 bonus_extrinsic |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
     bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
           _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo fake_het2: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -49.060375  
Iteration 1:   log restricted-likelihood = -49.060289  
Iteration 2:   log restricted-likelihood = -49.060289  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       6.73
Log restricted-likelihood = -49.060289          Prob > chi2       =     0.1511

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |       -.25   .1446355    -1.73   0.084    -.5334803    .0334803
extrinsic_leader |  -.4776405   .2054262    -2.33   0.020    -.8802684   -.0750125
 bonus_extrinsic |   .3863636   .2091426     1.85   0.065    -.0235482    .7962755
     bonus_order |    .149792   .1544132     0.97   0.332    -.1528524    .4524363
           _cons |   .7459547   .1681187     4.44   0.000     .4164481    1.075461
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2728565   .0785525      .1551966    .4797182
-----------------------------+------------------------------------------------
                sd(Residual) |   .4090909   .0436092      .3319567    .5041482
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.35          Prob >= chibar2 = 0.0103

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. eststo dic_het2: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -24.37734  
Iteration 1:   log restricted-likelihood = -24.375499  
Iteration 2:   log restricted-likelihood = -24.375499  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      37.01
Log restricted-likelihood = -24.375499          Prob > chi2       =     0.0000

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |  -.0416667   .1022903    -0.41   0.684    -.2421519    .1588186
extrinsic_leader |   .4741345    .136293     3.48   0.001     .2070051     .741264
 bonus_extrinsic |   -.594697   .1479115    -4.02   0.000    -.8845981   -.3047958
     bonus_order |  -.0836801   .0963009    -0.87   0.385    -.2724263    .1050662
           _cons |     .21548    .109669     1.96   0.049     .0005328    .4304273
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1508404   .0566407      .0722588    .3148798
-----------------------------+------------------------------------------------
                sd(Residual) |   .2893206   .0308417      .2347691    .3565477
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.60          Prob >= chibar2 = 0.0534

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "23´"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Democratic)), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader
>  bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(da
> sh) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mla
> bel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none
> ) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Democratic)), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader
>  bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(da
> sh) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mla
> bel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none
> ) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Democratic)), bylabel(Baseline: Democratic rule) || (dem_het2), bylabel(Baseline: Pseudo or Autocratic) ||, keep(bonus extrinsic_leader
>  bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(da
> sh) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mla
> bel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none
> ) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Democratic)), bylabel(Baseline: Democratic rule) (dem_het2), bylabel(Baseline: Pseudo or Autocratic), keep(bonus extrinsic_leader bonus
> _extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lc
> olor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(co
> nd(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) marg
> in(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)
invalid 'bylabel' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Baseline: Democratic rule)) (dem_het2, label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(
> bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regr
> ession estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", co
> nd(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justif
> ication(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Baseline: Democratic rule)) (dem_het2, label(Baseline: Pseudo or Autocratic)), keep(bonus extrinsic_leader bonus_extrinsic) coeflabels(
> bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regr
> ession estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", co
> nd(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin(medium) nobox justif
> ication(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph not fo
> und)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif not found)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Baseline: Democrat)), bylabel(Crowding-out) || (dem_het2, label(Baseline: Autocrat) bylabel(Baseline: Pseudo or Autocratic) ||, keep(bo
> nus extrinsic_leader bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) 
> xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.
> 3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, s
> ize(8pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)
parentheses unbalanced
r(132);

end of do-file

r(132);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1, label(Baseline: Democrat)), bylabel(Crowding-out) || (dem_het2, label(Baseline: Autocrat)), bylabel(Crowding-in) ||, keep(bonus extrinsic_lea
> der bonus_extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern
> (dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) 
> mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(n
> one) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin
> (medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(4) ysize(3)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(10pt) mlabposition(3) subtitle(, size(8pt) lstyle(none) margin
> (medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.165) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) subtitle(, size(8pt) lstyle(none) margin(
> medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.165) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(8pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.165) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(8pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.165) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(8pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-1(0.5)1, nogrid)  xsize(3.465) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrat)) ||, keep(bonus extrinsic_leader bonus_e
> xtrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lcol
> or(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond
> (@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle
> (none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep(bonus extrinsic_leader bonus_
> extrinsic) coeflabels(bonus =  "Pooled Bonus" extrinsic_leader = "Exstrinsic (=1)" bonus_extrinsic = "Interaction")  byopts(xrescale) xline(0, lpattern(dash) lco
> lor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(con
> d(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyl
> e(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. cibar dem if rule_base!=1, over1(bonus) over2(extrinsic_leader)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. cibar dem if rule_base!=1, over1(bonus) over2(extrinsic_leader)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. cibar dem, over1(bonus) over2(extrinsic_leader)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. cibar dem if rule_base==1, over1(bonus) over2(extrinsic_leader)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. preserve

. drop if rule_base!=1
(69 observations deleted)

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo fake_het1: xtmixed fake bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  -42.56502  
Iteration 1:   log restricted-likelihood = -42.561915  
Iteration 2:   log restricted-likelihood = -42.561915  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      12.58
Log restricted-likelihood = -42.561915          Prob > chi2       =     0.0135

----------------------------------------------------------------------------------
            fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .2173913   .0752281     2.89   0.004      .069947    .3648356
extrinsic_leader |  -.0022367   .1041568    -0.02   0.983    -.2063803    .2019069
 bonus_extrinsic |  -.0507246   .1135365    -0.45   0.655    -.2732521    .1718029
     bonus_order |  -.0289374   .0710378    -0.41   0.684     -.168169    .1102942
           _cons |   .0150978   .0782513     0.19   0.847    -.1382719    .1684675
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1498833   .0421851      .0863336    .2602117
-----------------------------+------------------------------------------------
                sd(Residual) |   .2945766   .0232883      .2522928    .3439471
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 4.50          Prob >= chibar2 = 0.0169

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. eststo dic_het1: xtmixed dic bonus extrinsic_leader bonus_extrinsic bonus_order || id:,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood =  67.949525  
Iteration 1:   log restricted-likelihood =  68.443388  
Iteration 2:   log restricted-likelihood =  68.443466  
Iteration 3:   log restricted-likelihood =  68.443466  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =       5.66
Log restricted-likelihood =  68.443466          Prob > chi2       =     0.2259

----------------------------------------------------------------------------------
             dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
           bonus |   .0434783   .0322121     1.35   0.177    -.0196564    .1066129
extrinsic_leader |    -.00264   .0397336    -0.07   0.947    -.0805165    .0752364
 bonus_extrinsic |  -.0434783   .0486155    -0.89   0.371     -.138763    .0518064
     bonus_order |  -.0341556   .0228206    -1.50   0.134    -.0788831    .0105719
           _cons |   .0178203   .0288706     0.62   0.537     -.038765    .0744056
----------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   8.62e-12   2.01e-11      8.87e-14    8.38e-10
-----------------------------+------------------------------------------------
                sd(Residual) |   .1261356   .0082107      .1110272       .1433
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 2.8e-14       Prob >= chibar2 = 1.0000

. matrix N_g = e(N_g)

. local individuals = N_g[1, 1]

. estadd local individuals `individuals'´

added macro:
        e(individuals) : "41´"

. restore

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base!=1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
                                |
               extrinsic_leader |
                     Extrinsic  |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .2083333   .1805213     1.15   0.248     -.145482    .5621487
                                |
                    bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
                          _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het2: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base!=1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
Pooled Bonus (n=128)#Intrinsic  |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
Pooled Bonus (n=128)#Extrinsic  |   .5035059   .1519528     3.31   0.001     .2056839     .801328
                                |
                    bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
                          _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test i.bonus#i.extrinsic_leader
i:  operator invalid
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm i.bonus#i.extrinsic_leader

 ( 1)  [dem]0b.bonus#1.extrinsic_leader = 0
 ( 2)  [dem]1.bonus#0b.extrinsic_leader = 0
 ( 3)  [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  3) =   21.58
         Prob > chi2 =    0.0001

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader

 ( 1)  [dem]1.bonus#0b.extrinsic_leader = 0
 ( 2)  [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  2) =   11.47
         Prob > chi2 =    0.0032

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader

 ( 1)  [dem]1.bonus#0b.extrinsic_leader = 0
 ( 2)  [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  2) =   11.47
         Prob > chi2 =    0.0032

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader. equal
extrinsic_leader. invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. eststo dem_het2: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base!=1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
Pooled Bonus (n=128)#Intrinsic  |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
Pooled Bonus (n=128)#Extrinsic  |   .5035059   .1519528     3.31   0.001     .2056839     .801328
                                |
                    bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
                          _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.51
         Prob > chi2 =    0.1133

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep(1.bonus#0b.extrinsic_leader 1
> .bonus#1b.extrinsic_leader) coeflabels(1.bonus#0b.extrinsic_leader = "Bonus*Intrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0
> , lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) reca
> st(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtit
> le(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
(dem_het1: no coefficients found, all dropped, or none kept)
(dem_het2: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. eststo dem_het2: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base!=1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0035059   .1695793     0.02   0.984    -.3288633    .3358752
Pooled Bonus (n=128)#Intrinsic  |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
Pooled Bonus (n=128)#Extrinsic  |   .5035059   .1519528     3.31   0.001     .2056839     .801328
                                |
                    bonus_order |  -.0661119   .1222836    -0.54   0.589    -.3057834    .1735597
                          _cons |   .0385653   .1371917     0.28   0.779    -.2303256    .3074561
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.51
         Prob > chi2 =    0.1133

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep(1.bonus#0b.extrinsic_leader 1
> .bonus#1b.extrinsic_leader) coeflabels(1.bonus#0b.extrinsic_leader = "Bonus*Intrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0
> , lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) reca
> st(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtit
> le(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
(dem_het1: no coefficients found, all dropped, or none kept)
(dem_het2: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep() coeflabels(1.bonus#0b.extri
> nsic_leader = "Bonus*Intrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estima
> ted impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05,
>  "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justif
> ication(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. marginsplot
previous command was not margins
r(301);

end of do-file

r(301);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins,dydx(*)

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus 1.extrinsic_leader bonus_order

---------------------------------------------------------------------------------------
                      |            Delta-method
                      |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.2195122   .0577389    -3.80   0.000    -.3326783   -.1063461
                      |
     extrinsic_leader |
           Extrinsic  |   .0676787   .0751232     0.90   0.368    -.0795601    .2149175
          bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
---------------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. marginsplot

  Variables that uniquely identify margins: _deriv

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep(1.bonus#0b.extrinsic_leader 1
> .bonus#1b.extrinsic_leader) coeflabels(1.bonus#0b.extrinsic_leader = "Bonus*Intrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0
> , lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) reca
> st(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtit
> le(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
(dem_het1: no coefficients found, all dropped, or none kept)
(dem_het2: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1b.bonus 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    4.02
         Prob > chi2 =    0.0450

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768  _b[0b.bonus#1.extrinsic_leader]
Pooled Bonus (n=128)#Intrinsic  |  -.2608696  _b[1.bonus#0b.extrinsic_leader]
Pooled Bonus (n=128)#Extrinsic  |  -.1617899  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. contrast bonus

Contrasts of marginal linear predictions

Margins      : asbalanced

------------------------------------------------
             |         df        chi2     P>chi2
-------------+----------------------------------
dem          |
       bonus |          1       13.50     0.0002
------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. contrast bonus

Contrasts of marginal linear predictions

Margins      : asbalanced

------------------------------------------------
             |         df        chi2     P>chi2
-------------+----------------------------------
dem          |
       bonus |          1       13.50     0.0002
------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. contrast bonus, at(extrinsic_leader=(0 1))
option at() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. contrast bonus, by(extrinsic_leader)
option by() not allowed
r(198);

end of do-file

r(198);

. help contrast

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. contrast .bonus##i.extrinsic_leader
.bonus invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. contrast i.bonus##i.extrinsic_leader

Contrasts of marginal linear predictions

Margins      : asbalanced

----------------------------------------------------------
                       |         df        chi2     P>chi2
-----------------------+----------------------------------
dem                    |
                 bonus |          1       13.50     0.0002
                       |
      extrinsic_leader |          1        0.45     0.5029
                       |
bonus#extrinsic_leader |          1        0.66     0.4181
----------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins i.bonus##i.extrinsic_leader

Predictive margins                              Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()

-------------------------------------------------------------------------------------------------
                                |            Delta-method
                                |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
               Baseline (n=64)  |          1   .0535106    18.69   0.000     .8951212    1.104879
          Pooled Bonus (n=128)  |   .7804878   .0418584    18.65   0.000     .6984468    .8625288
                                |
               extrinsic_leader |
                     Intrinsic  |   .8239459   .0496935    16.58   0.000     .7265484    .9213435
                     Extrinsic  |   .8916246   .0561932    15.87   0.000     .7814879    1.001761
                                |
         bonus#extrinsic_leader |
     Baseline (n=64)#Intrinsic  |    .997859   .0714892    13.96   0.000     .8577428    1.137975
     Baseline (n=64)#Extrinsic  |   1.002736   .0808246    12.41   0.000     .8443225    1.161149
Pooled Bonus (n=128)#Intrinsic  |   .7369894   .0559443    13.17   0.000     .6273407    .8466382
Pooled Bonus (n=128)#Extrinsic  |   .8360691   .0632567    13.22   0.000     .7120882      .96005
-------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins,  dydx(i.bonus##i.extrinsic_leader)
invalid dydx() option;
levels of interactions not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins i.bonus##i.extrinsic_leader

Predictive margins                              Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()

-------------------------------------------------------------------------------------------------
                                |            Delta-method
                                |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
               Baseline (n=64)  |          1   .0535106    18.69   0.000     .8951212    1.104879
          Pooled Bonus (n=128)  |   .7804878   .0418584    18.65   0.000     .6984468    .8625288
                                |
               extrinsic_leader |
                     Intrinsic  |   .8239459   .0496935    16.58   0.000     .7265484    .9213435
                     Extrinsic  |   .8916246   .0561932    15.87   0.000     .7814879    1.001761
                                |
         bonus#extrinsic_leader |
     Baseline (n=64)#Intrinsic  |    .997859   .0714892    13.96   0.000     .8577428    1.137975
     Baseline (n=64)#Extrinsic  |   1.002736   .0808246    12.41   0.000     .8443225    1.161149
Pooled Bonus (n=128)#Intrinsic  |   .7369894   .0559443    13.17   0.000     .6273407    .8466382
Pooled Bonus (n=128)#Extrinsic  |   .8360691   .0632567    13.22   0.000     .7120882      .96005
-------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. help testparm

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.bonus + 1.extrinsic_leader + 1b.bonus#1.extrinsic_leader) = 1.bonus 
regressor I1B.bonus#I1.extrinsic_leader not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 0

 ( 1)  [dem]1.bonus + [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.87
         Prob > chi2 =    0.0904

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. di (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader)
1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. di (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader)
1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 0

 ( 1)  [dem]1.bonus + [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.87
         Prob > chi2 =    0.0904

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. margins, dydx(*) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus 1.extrinsic_leader bonus_order

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

-------------------------------------------------------------------------------------
                    |            Delta-method
                    |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
0.bonus             |  (base outcome)
--------------------+----------------------------------------------------------------
1.bonus             |
                _at |
                 1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                 2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
--------------------+----------------------------------------------------------------
0.extrinsic_leader  |  (base outcome)
--------------------+----------------------------------------------------------------
1.extrinsic_leader  |
                _at |
                 1  |   .0676787   .0751232     0.90   0.368    -.0795601    .2149175
                 2  |   .0676787   .0751232     0.90   0.368    -.0795601    .2149175
--------------------+----------------------------------------------------------------
bonus_order         |
                _at |
                 1  |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                 2  |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
-------------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 0

 ( 1)  [dem]1.bonus + [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.87
         Prob > chi2 =    0.0904

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1.bonus

 ( 1)  [dem]1.bonus = 0

           chi2(  1) =   11.45
         Prob > chi2 =    0.0007

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. eststo dem_het1: margins, dydx(bonus) at(extrinsic_leader=(0 1)) coeflegend
option coeflegend not allowed without post option
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (dem_het1), bylabel(Crowding-out (Baseline: Democrats)) || (dem_het2), bylabel(Crowding-in (Baseline: Autocrats)) ||, keep() coeflabels(1.bonus#0b.extri
> nsic_leader = "Bonus*Intrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estima
> ted impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05,
>  "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justif
> ication(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. marginsplot

  Variables that uniquely identify margins: extrinsic_leader

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. help testparm

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus bonus_order || id: if type==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -18.564637  
Iteration 1:   log restricted-likelihood = -18.564241  
Iteration 2:   log restricted-likelihood = -18.564241  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       5.90
Log restricted-likelihood = -18.564241          Prob > chi2       =     0.0522

---------------------------------------------------------------------------------------
                  dem |      Coef.  Legend
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667  _b[1.bonus]
          bonus_order |  -.0095238  _b[bonus_order]
                _cons |   .0055556  _b[_cons]
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1959065   .0923388      .0777754    .4934637
-----------------------------+------------------------------------------------
                sd(Residual) |   .3396147   .0500735      .2543804    .4534082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.80          Prob >= chibar2 = 0.0899

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dem i.bonus bonus_order || id: if type==1 ,  reml
| invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dem i.bonus bonus_order if type==1 ,  cluster(id)
option cluster() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dem i.bonus bonus_order if type==1, robust
option robust not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtprobit dem i.bonus bonus_order if type==1, 
note: 0.bonus != 0 predicts failure perfectly
      0.bonus dropped and 12 obs not used

note: 1.bonus omitted because of collinearity

Fitting comparison model:

Iteration 0:   log likelihood = -14.487294  
Iteration 1:   log likelihood = -14.484417  
Iteration 2:   log likelihood = -14.484417  

Fitting full model:

rho =  0.0     log likelihood = -14.484417
rho =  0.1     log likelihood = -14.242435
rho =  0.2     log likelihood = -14.051568
rho =  0.3     log likelihood = -13.908428
rho =  0.4     log likelihood = -13.813519
rho =  0.5     log likelihood = -13.772104
rho =  0.6     log likelihood =  -13.79693

Iteration 0:   log likelihood = -13.772081  
Iteration 1:   log likelihood = -13.602498  
Iteration 2:   log likelihood =  -13.59405  
Iteration 3:   log likelihood =  -13.59401  
Iteration 4:   log likelihood =  -13.59401  

Random-effects probit regression                Number of obs     =         24
Group variable: id                              Number of groups  =         12

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          2
                                                              avg =        2.0
                                                              max =          2

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(1)      =       0.00
Log likelihood  =  -13.59401                    Prob > chi2       =     0.9679

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
     Baseline (n=64)  |          0  (empty)
Pooled Bonus (n=128)  |          0  (omitted)
                      |
          bonus_order |  -.0413248   1.026964    -0.04   0.968    -2.054137    1.971487
                _cons |  -.8459757   .8651682    -0.98   0.328    -2.541674    .8497228
----------------------+----------------------------------------------------------------
             /lnsig2u |   .4168481   1.501022                       -2.5251    3.358797
----------------------+----------------------------------------------------------------
              sigma_u |   1.231735   .9244308                      .2829316    5.362329
                  rho |   .6027288   .3594148                      .0741172    .9663917
---------------------------------------------------------------------------------------
LR test of rho=0: chibar2(01) = 1.78                   Prob >= chibar2 = 0.091

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. reg dem i.bonus bonus_order if type==1, cluster(id)

Linear regression                               Number of obs     =         36
                                                F(2, 11)          =       3.08
                                                Prob > F          =     0.0869
                                                R-squared         =     0.1208
                                                Root MSE          =     .38759

                                             (Std. Err. adjusted for 12 clusters in id)
---------------------------------------------------------------------------------------
                      |               Robust
                  dem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667   .1178714     2.47   0.031     .0322334    .5510999
          bonus_order |  -.0095238   .1618654    -0.06   0.954    -.3657872    .3467395
                _cons |   .0055556   .0944327     0.06   0.954    -.2022895    .2134006
---------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. probit dem i.bonus bonus_order if type==1, cluster(id)

note: 0.bonus != 0 predicts failure perfectly
      0.bonus dropped and 12 obs not used

note: 1.bonus omitted because of collinearity
Iteration 0:   log pseudolikelihood = -14.487294  
Iteration 1:   log pseudolikelihood = -14.484417  
Iteration 2:   log pseudolikelihood = -14.484417  

Probit regression                               Number of obs     =         24
                                                Wald chi2(1)      =       0.00
                                                Prob > chi2       =     0.9516
Log pseudolikelihood = -14.484417               Pseudo R2         =     0.0002

                                             (Std. Err. adjusted for 12 clusters in id)
---------------------------------------------------------------------------------------
                      |               Robust
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
     Baseline (n=64)  |          0  (empty)
Pooled Bonus (n=128)  |          0  (omitted)
                      |
          bonus_order |  -.0415483   .6838863    -0.06   0.952    -1.381941    1.298844
                _cons |  -.5244005   .5373705    -0.98   0.329    -1.577627    .5288263
---------------------------------------------------------------------------------------

. 
end of do-file

. tab bonus

               bonus |      Freq.     Percent        Cum.
---------------------+-----------------------------------
     Baseline (n=64) |         64       33.33       33.33
Pooled Bonus (n=128) |        128       66.67      100.00
---------------------+-----------------------------------
               Total |        192      100.00

. tab bonus if type=01
invalid syntax
r(198);

. tab bonus if type==1

               bonus |      Freq.     Percent        Cum.
---------------------+-----------------------------------
     Baseline (n=64) |         12       33.33       33.33
Pooled Bonus (n=128) |         24       66.67      100.00
---------------------+-----------------------------------
               Total |         36      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub2: xtmixed dem i.bonus bonus_order  || id: if type==2,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.596737  
Iteration 1:   log restricted-likelihood = -19.596494  
Iteration 2:   log restricted-likelihood = -19.596494  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         33
Group variable: id                              Number of groups  =         11

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      14.05
Log restricted-likelihood = -19.596494          Prob > chi2       =     0.0009

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |         .5   .1356402     3.69   0.000     .2341501    .7658499
          bonus_order |  -.1309524   .1920815    -0.68   0.495    -.5074253    .2455205
                _cons |   .0833333   .1779209     0.47   0.640    -.2653852    .4320519
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2212279   .1048617      .0873719    .5601549
-----------------------------+------------------------------------------------
                sd(Residual) |   .3673154    .056678      .2714538    .4970298
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.85          Prob >= chibar2 = 0.0870

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub3: xtmixed dem i.bonus bonus_order  || id: if type==3,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -29.466679  
Iteration 1:   log restricted-likelihood = -29.466581  
Iteration 2:   log restricted-likelihood = -29.466581  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      11.38
Log restricted-likelihood = -29.466581          Prob > chi2       =     0.0034

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.2608696   .0788491    -3.31   0.001     -.415411   -.1063282
          bonus_order |   .0732323   .1114045     0.66   0.511    -.1451165    .2915812
                _cons |   .9617918    .096117    10.01   0.000      .773406    1.150178
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1986239   .0578471      .1122349    .3515078
-----------------------------+------------------------------------------------
                sd(Residual) |   .3087557   .0325457      .2511253    .3796117
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.02          Prob >= chibar2 = 0.0125

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub4: xtmixed dem i.bonus bonus_order  || id: if type==4,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -17.148897  
Iteration 1:   log restricted-likelihood = -17.135093  
Iteration 2:   log restricted-likelihood = -17.135079  
Iteration 3:   log restricted-likelihood = -17.135079  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         54
Group variable: id                              Number of groups  =         18

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       4.16
Log restricted-likelihood = -17.135079          Prob > chi2       =     0.1249

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.1666667   .0845154    -1.97   0.049    -.3323139   -.0010195
          bonus_order |        .05   .0960143     0.52   0.603    -.1381846    .2381846
                _cons |   .9777778    .085275    11.47   0.000     .8106419    1.144914
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1113588   .0719082      .0314105    .3947976
-----------------------------+------------------------------------------------
                sd(Residual) |     .29277   .0349927      .2316267    .3700536
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.74          Prob >= chibar2 = 0.1944

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep() coeflabels(1.bonus#0b.extrinsic_leader = "Bonus*I
> ntrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to
>  baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, 
> "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin
> (top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
estimation result sub1 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. eststo sub1: xtmixed dem i.bonus bonus_order  || id: if type==1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -18.564637  
Iteration 1:   log restricted-likelihood = -18.564241  
Iteration 2:   log restricted-likelihood = -18.564241  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       5.90
Log restricted-likelihood = -18.564241          Prob > chi2       =     0.0522

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667   .1200719     2.43   0.015       .05633    .5270033
          bonus_order |  -.0095238   .1622964    -0.06   0.953     -.327619    .3085714
                _cons |   .0055556   .1475559     0.04   0.970    -.2836488    .2947599
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1959065   .0923388      .0777754    .4934637
-----------------------------+------------------------------------------------
                sd(Residual) |   .3396147   .0500735      .2543804    .4534082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.80          Prob >= chibar2 = 0.0899

. eststo sub2: xtmixed dem i.bonus bonus_order  || id: if type==2,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.596737  
Iteration 1:   log restricted-likelihood = -19.596494  
Iteration 2:   log restricted-likelihood = -19.596494  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         33
Group variable: id                              Number of groups  =         11

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      14.05
Log restricted-likelihood = -19.596494          Prob > chi2       =     0.0009

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |         .5   .1356402     3.69   0.000     .2341501    .7658499
          bonus_order |  -.1309524   .1920815    -0.68   0.495    -.5074253    .2455205
                _cons |   .0833333   .1779209     0.47   0.640    -.2653852    .4320519
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2212279   .1048617      .0873719    .5601549
-----------------------------+------------------------------------------------
                sd(Residual) |   .3673154    .056678      .2714538    .4970298
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.85          Prob >= chibar2 = 0.0870

. eststo sub3: xtmixed dem i.bonus bonus_order  || id: if type==3,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -29.466679  
Iteration 1:   log restricted-likelihood = -29.466581  
Iteration 2:   log restricted-likelihood = -29.466581  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      11.38
Log restricted-likelihood = -29.466581          Prob > chi2       =     0.0034

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.2608696   .0788491    -3.31   0.001     -.415411   -.1063282
          bonus_order |   .0732323   .1114045     0.66   0.511    -.1451165    .2915812
                _cons |   .9617918    .096117    10.01   0.000      .773406    1.150178
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1986239   .0578471      .1122349    .3515078
-----------------------------+------------------------------------------------
                sd(Residual) |   .3087557   .0325457      .2511253    .3796117
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.02          Prob >= chibar2 = 0.0125

. eststo sub4: xtmixed dem i.bonus bonus_order  || id: if type==4,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -17.148897  
Iteration 1:   log restricted-likelihood = -17.135093  
Iteration 2:   log restricted-likelihood = -17.135079  
Iteration 3:   log restricted-likelihood = -17.135079  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         54
Group variable: id                              Number of groups  =         18

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       4.16
Log restricted-likelihood = -17.135079          Prob > chi2       =     0.1249

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.1666667   .0845154    -1.97   0.049    -.3323139   -.0010195
          bonus_order |        .05   .0960143     0.52   0.603    -.1381846    .2381846
                _cons |   .9777778    .085275    11.47   0.000     .8106419    1.144914
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1113588   .0719082      .0314105    .3947976
-----------------------------+------------------------------------------------
                sd(Residual) |     .29277   .0349927      .2316267    .3700536
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 0.74          Prob >= chibar2 = 0.1944

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep() coeflabels(1.bonus#0b.extrinsic_leader = "Bonus*I
> ntrinsic" 1.bonus#1b.extrinsic_leader = "Bonus*Extrinsic")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to
>  baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, 
> "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin
> (top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep(i.bonus) coeflabels(i.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
(sub1: no coefficients found, all dropped, or none kept)
(sub3: no coefficients found, all dropped, or none kept)
(sub2: no coefficients found, all dropped, or none kept)
(sub4: no coefficients found, all dropped, or none kept)
(nothing to plot)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. tab bonus_size

 bonus_size |      Freq.     Percent        Cum.
------------+-----------------------------------
   Baseline |         64       33.33       33.33
Small Bonus |         64       33.33       66.67
Large Bonus |         64       33.33      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub1_1: xtmixed dem i.bonus_size bonus_order  || id: if type==1,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.436537  
Iteration 1:   log restricted-likelihood = -19.435949  
Iteration 2:   log restricted-likelihood = -19.435949  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(3)      =       6.09
Log restricted-likelihood = -19.435949          Prob > chi2       =     0.1074

------------------------------------------------------------------------------
         dem |      Coef.  Legend
-------------+----------------------------------------------------------------
  bonus_size |
Small Bonus  |        .25  _b[1.bonus_size]
Large Bonus  |   .3333333  _b[2.bonus_size]
             |
 bonus_order |  -.0095238  _b[bonus_order]
       _cons |   .0055556  _b[_cons]
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1930365   .0942028      .0741735    .5023776
-----------------------------+------------------------------------------------
                sd(Residual) |   .3445096   .0519368      .2563763    .4629401
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.62          Prob >= chibar2 = 0.1016

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub1: xtmixed dem i.bonus bonus_order  || id: if type==1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -18.564637  
Iteration 1:   log restricted-likelihood = -18.564241  
Iteration 2:   log restricted-likelihood = -18.564241  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       5.90
Log restricted-likelihood = -18.564241          Prob > chi2       =     0.0522

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667   .1200719     2.43   0.015       .05633    .5270033
          bonus_order |  -.0095238   .1622964    -0.06   0.953     -.327619    .3085714
                _cons |   .0055556   .1475559     0.04   0.970    -.2836488    .2947599
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1959065   .0923388      .0777754    .4934637
-----------------------------+------------------------------------------------
                sd(Residual) |   .3396147   .0500735      .2543804    .4534082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.80          Prob >= chibar2 = 0.0899

. eststo sub1_1: xtmixed dem i.bonus_size bonus_order  || id: if type==1,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.436537  
Iteration 1:   log restricted-likelihood = -19.435949  
Iteration 2:   log restricted-likelihood = -19.435949  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(3)      =       6.09
Log restricted-likelihood = -19.435949          Prob > chi2       =     0.1074

------------------------------------------------------------------------------
         dem |      Coef.  Legend
-------------+----------------------------------------------------------------
  bonus_size |
Small Bonus  |        .25  _b[1.bonus_size]
Large Bonus  |   .3333333  _b[2.bonus_size]
             |
 bonus_order |  -.0095238  _b[bonus_order]
       _cons |   .0055556  _b[_cons]
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1930365   .0942028      .0741735    .5023776
-----------------------------+------------------------------------------------
                sd(Residual) |   .3445096   .0519368      .2563763    .4629401
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.62          Prob >= chibar2 = 0.1016

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. 
. coefplot (sub1 sub1_1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep(1.bonus 1.bonus_size 2.bonus_size) coeflabel
> s(1.bonus = "Pooled Bonus" 1.bonus_size = "Small bonus" 2.bonus_size="Large bonus")  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression est
> imated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.
> 05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox jus
> tification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1 sub1_1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus"
> )  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(
> 0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposit
> ion(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).5, nogrid)  xsize(3.465) ysize(2)
(sub1_1: no coefficients found, all dropped, or none kept)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1 sub1_1, label (Box I)) (sub3, label (Box II))  (sub2, label (Box III))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus"
> )  byopts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(
> 0.8 2)  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposit
> ion(1) mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).75, nogrid)  xsize(3.465) ysize(2)
(sub1_1: no coefficients found, all dropped, or none kept)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub1: xtmixed dem i.bonus bonus_order  || id: if type==1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -18.564637  
Iteration 1:   log restricted-likelihood = -18.564241  
Iteration 2:   log restricted-likelihood = -18.564241  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       5.90
Log restricted-likelihood = -18.564241          Prob > chi2       =     0.0522

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667   .1200719     2.43   0.015       .05633    .5270033
          bonus_order |  -.0095238   .1622964    -0.06   0.953     -.327619    .3085714
                _cons |   .0055556   .1475559     0.04   0.970    -.2836488    .2947599
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1959065   .0923388      .0777754    .4934637
-----------------------------+------------------------------------------------
                sd(Residual) |   .3396147   .0500735      .2543804    .4534082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.80          Prob >= chibar2 = 0.0899

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub3: xtmixed dem i.bonus bonus_order  || id: if type==3,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -29.466679  
Iteration 1:   log restricted-likelihood = -29.466581  
Iteration 2:   log restricted-likelihood = -29.466581  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      11.38
Log restricted-likelihood = -29.466581          Prob > chi2       =     0.0034

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.2608696   .0788491    -3.31   0.001     -.415411   -.1063282
          bonus_order |   .0732323   .1114045     0.66   0.511    -.1451165    .2915812
                _cons |   .9617918    .096117    10.01   0.000      .773406    1.150178
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1986239   .0578471      .1122349    .3515078
-----------------------------+------------------------------------------------
                sd(Residual) |   .3087557   .0325457      .2511253    .3796117
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.02          Prob >= chibar2 = 0.0125

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub3: xtmixed dem i.bonus bonus_order  || id: if type==3,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -29.466679  
Iteration 1:   log restricted-likelihood = -29.466581  
Iteration 2:   log restricted-likelihood = -29.466581  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      11.38
Log restricted-likelihood = -29.466581          Prob > chi2       =     0.0034

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |  -.2608696   .0788491    -3.31   0.001     -.415411   -.1063282
          bonus_order |   .0732323   .1114045     0.66   0.511    -.1451165    .2915812
                _cons |   .9617918    .096117    10.01   0.000      .773406    1.150178
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1986239   .0578471      .1122349    .3515078
-----------------------------+------------------------------------------------
                sd(Residual) |   .3087557   .0325457      .2511253    .3796117
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.02          Prob >= chibar2 = 0.0125

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub2: xtmixed dem i.bonus bonus_order  || id: if type==2,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.596737  
Iteration 1:   log restricted-likelihood = -19.596494  
Iteration 2:   log restricted-likelihood = -19.596494  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         33
Group variable: id                              Number of groups  =         11

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      14.05
Log restricted-likelihood = -19.596494          Prob > chi2       =     0.0009

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |         .5   .1356402     3.69   0.000     .2341501    .7658499
          bonus_order |  -.1309524   .1920815    -0.68   0.495    -.5074253    .2455205
                _cons |   .0833333   .1779209     0.47   0.640    -.2653852    .4320519
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2212279   .1048617      .0873719    .5601549
-----------------------------+------------------------------------------------
                sd(Residual) |   .3673154    .056678      .2714538    .4970298
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.85          Prob >= chibar2 = 0.0870

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub3, label (Box II))  (sub3, label (Box III))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).75, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub2, label (Box III))  (sub3, label (Box II))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).75, nogrid)  xsize(3.465) ysize(2)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub2, label (Box III))  (sub3, label (Box II))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).75, nogrid)  xsize(3.465) ysize(2)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000) scale(1.1)
option scale() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. coefplot (sub1, label (Box I)) (sub2, label (Box III))  (sub3, label (Box II))  (sub4, label (Box IV)) , keep(1.bonus) coeflabels(1.bonus = "Pooled Bonus")  byop
> ts(xrescale) xline(0, lpattern(dash) lcolor(gs3)) xtitle("Regression estimated impact relative to baseline in pp") grid(none) levels(95 90) ciopts(lwidth(0.8 2) 
>  lcolor(*1 *.3) recast(rcap)) mlabel(cond(@pval<.01, "***", cond(@pval<.05, "**", cond(@pval<.1, "*", "")))) msize(3pt) msymbol(D) mlabsize(8pt) mlabposition(1) 
> mlabgap(-0.4) subtitle(, size(6pt) lstyle(none) margin(medium) nobox justification(left)  bmargin(top))  xla(-.5(0.25).75, nogrid)  xsize(3.465) ysize(2) scale(1
> .1)

. gr_edit style.editstyle margin(vsmall) editcopy

. gr save  "$working_ANALYSIS\results\intermediate\figureX_crowding_effects.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\intermediate\figureX_crowding_effects.gph saved)

. gr export "$working_ANALYSIS\results\figures\figureX_crowding_effects.tif", replace width(4000) 
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\figures\figureX_crowding_effects.tif written in TIFF f
> ormat)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub1: xtmixed dem i.bonus bonus_order  || id: if type==1,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -18.564637  
Iteration 1:   log restricted-likelihood = -18.564241  
Iteration 2:   log restricted-likelihood = -18.564241  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         36
Group variable: id                              Number of groups  =         12

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =       5.90
Log restricted-likelihood = -18.564241          Prob > chi2       =     0.0522

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |   .2916667   .1200719     2.43   0.015       .05633    .5270033
          bonus_order |  -.0095238   .1622964    -0.06   0.953     -.327619    .3085714
                _cons |   .0055556   .1475559     0.04   0.970    -.2836488    .2947599
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1959065   .0923388      .0777754    .4934637
-----------------------------+------------------------------------------------
                sd(Residual) |   .3396147   .0500735      .2543804    .4534082
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.80          Prob >= chibar2 = 0.0899

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo sub2: xtmixed dem i.bonus bonus_order  || id: if type==2,  reml 

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -19.596737  
Iteration 1:   log restricted-likelihood = -19.596494  
Iteration 2:   log restricted-likelihood = -19.596494  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         33
Group variable: id                              Number of groups  =         11

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(2)      =      14.05
Log restricted-likelihood = -19.596494          Prob > chi2       =     0.0009

---------------------------------------------------------------------------------------
                  dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                bonus |
Pooled Bonus (n=128)  |         .5   .1356402     3.69   0.000     .2341501    .7658499
          bonus_order |  -.1309524   .1920815    -0.68   0.495    -.5074253    .2455205
                _cons |   .0833333   .1779209     0.47   0.640    -.2653852    .4320519
---------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2212279   .1048617      .0873719    .5601549
-----------------------------+------------------------------------------------
                sd(Residual) |   .3673154    .056678      .2714538    .4970298
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 1.85          Prob >= chibar2 = 0.0870

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus#0b.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
. 
. *Baseline democrats
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmixed dem i.bonus#i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
         bonus#extrinsic_leader |
     Baseline (n=64)#Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
Pooled Bonus (n=128)#Intrinsic  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
Pooled Bonus (n=128)#Extrinsic  |  -.1617899   .0955431    -1.69   0.090    -.3490509    .0254711
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768     .10798     0.05   0.964    -.2067602    .2165137
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029   .1163461     0.81   0.418    -.1338313    .3222371
                                |
                    bonus_order |    .063093   .0745847     0.85   0.398    -.0830903    .2092763
                          _cons |   .9670819   .0813546    11.89   0.000     .8076298    1.126534
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal
option equal not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1b.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader)=1.bonus
regressor I1B.bonus not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader)=1.bonus

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1.bonus 1.extrinsic_leader 1.bonus#1.extrinsic_leader

 ( 1)  [dem]1.bonus = 0
 ( 2)  [dem]1.extrinsic_leader = 0
 ( 3)  [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  3) =   15.92
         Prob > chi2 =    0.0012

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm  1.extrinsic_leader 1.bonus#1.extrinsic_leader

 ( 1)  [dem]1.extrinsic_leader = 0
 ( 2)  [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  2) =    1.47
         Prob > chi2 =    0.4802

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm  1.extrinsic_leader 1.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    0.18
         Prob > chi2 =    0.6675

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm 1b.bonus#0.extrinsic_leader 1b.bonus#1.extrinsic_leader, equal
too few variables specified
r(102);

end of do-file

r(102);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. testparm  1.bonus 1.extrinsic_leader 1.bonus#1.extrinsic_leader, equal

 ( 1)  - [dem]1.bonus + [dem]1.extrinsic_leader = 0
 ( 2)  - [dem]1.bonus + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  2) =   12.05
         Prob > chi2 =    0.0024

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. test (1.extrinsic_leader + 1.bonus#1.extrinsic_leader)=0

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.extrinsic_leader + 1.bonus#1.extrinsic_leader)=0

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base1=1 ,  reml coeflegend
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. *difference significant?
. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het2: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base1!=1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -37.919898  
Iteration 1:   log restricted-likelihood = -37.919156  
Iteration 2:   log restricted-likelihood = -37.919156  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =         69
Group variable: id                              Number of groups  =         23

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      21.81
Log restricted-likelihood = -37.919156          Prob > chi2       =     0.0002

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |   .2916667  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0035059  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .2083333  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |  -.0661119  _b[bonus_order]
                          _cons |   .0385653  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .2002879   .0681672      .1027902    .3902633
-----------------------------+------------------------------------------------
                sd(Residual) |   .3531067   .0376413      .2865283    .4351554
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 3.36          Prob >= chibar2 = 0.0334

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    2.51
         Prob > chi2 =    0.1133

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =         69

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |   .2916667   .1248421     2.34   0.019     .0469807    .5363526
          2  |         .5   .1303933     3.83   0.000     .2444338    .7555662
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD6a14_000000.tmp"

. eststo dem_het1: xtmixed dem i.bonus##i.extrinsic_leader  bonus_order || id: if rule_base==1 ,  reml coeflegend

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:   log restricted-likelihood = -46.370698  
Iteration 1:   log restricted-likelihood = -46.368955  
Iteration 2:   log restricted-likelihood = -46.368955  

Computing standard errors:

Mixed-effects REML regression                   Number of obs     =        123
Group variable: id                              Number of groups  =         41

                                                Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

                                                Wald chi2(4)      =      16.53
Log restricted-likelihood = -46.368955          Prob > chi2       =     0.0024

-------------------------------------------------------------------------------------------------
                            dem |      Coef.  Legend
--------------------------------+----------------------------------------------------------------
                          bonus |
          Pooled Bonus (n=128)  |  -.2608696  _b[1.bonus]
                                |
               extrinsic_leader |
                     Extrinsic  |   .0048768  _b[1.extrinsic_leader]
                                |
         bonus#extrinsic_leader |
Pooled Bonus (n=128)#Extrinsic  |   .0942029  _b[1.bonus#1.extrinsic_leader]
                                |
                    bonus_order |    .063093  _b[bonus_order]
                          _cons |   .9670819  _b[_cons]
-------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects Parameters  |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
id: Identity                 |
                   sd(_cons) |   .1620974   .0427378      .0966835    .2717688
-----------------------------+------------------------------------------------
                sd(Residual) |   .3018662   .0238646       .258536    .3524584
------------------------------------------------------------------------------
LR test vs. linear model: chibar2(01) = 5.31          Prob >= chibar2 = 0.0106

. test (1.bonus + 1.extrinsic_leader + 1.bonus#1.extrinsic_leader) = 1.bonus 

 ( 1)  [dem]1.extrinsic_leader + [dem]1.bonus#1.extrinsic_leader = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2412

. margins, dydx(bonus) at(extrinsic_leader=(0 1))

Average marginal effects                        Number of obs     =        123

Expression   : Linear prediction, fixed portion, predict()
dy/dx w.r.t. : 1.bonus

1._at        : extrinsic_leader=           0

2._at        : extrinsic_leader=           1

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.bonus      |  (base outcome)
-------------+----------------------------------------------------------------
1.bonus      |
         _at |
          1  |  -.2608696   .0770897    -3.38   0.001    -.4119625   -.1097766
          2  |  -.1666667   .0871413    -1.91   0.056    -.3374604    .0041271
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. exit, clear
