---------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/logs/2023.07.18-14.00.04.log.txt
  log type:  text
 opened on:  18 Jul 2023, 14:00:04

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 18 Jul 2023 14:00:04

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss
> ;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduce
> s transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. *power analysis: MDES with 80% power
. power pairedproportions 0.64, corr(0.39) diff(0(0.01)0.2) alpha(0.05 0.1) n(64)

Estimated power for a two-sample paired-proportions test
Large-sample McNemar's test
Ho: p+1 = p1+  versus  Ha: p+1 != p1+

  +-----------------------------------------------------------------+
  |   alpha   power       N   delta  pmarg1  pmarg2    corr    diff |
  |-----------------------------------------------------------------|
  |     .05       .       .       .     .64     .64     .39       0 |
  |     .05  .05259      64     .01     .64     .65     .39     .01 |
  |     .05  .06045      64     .02     .64     .66     .39     .02 |
  |     .05   .0738      64     .03     .64     .67     .39     .03 |
  |     .05   .0929      64     .04     .64     .68     .39     .04 |
  |     .05    .118      64     .05     .64     .69     .39     .05 |
  |     .05   .1494      64     .06     .64      .7     .39     .06 |
  |     .05    .187      64     .07     .64     .71     .39     .07 |
  |     .05    .231      64     .08     .64     .72     .39     .08 |
  |     .05   .2808      64     .09     .64     .73     .39     .09 |
  |     .05   .3359      64      .1     .64     .74     .39      .1 |
  |     .05   .3953      64     .11     .64     .75     .39     .11 |
  |     .05   .4578      64     .12     .64     .76     .39     .12 |
  |     .05    .522      64     .13     .64     .77     .39     .13 |
  |     .05   .5862      64     .14     .64     .78     .39     .14 |
  |     .05   .6487      64     .15     .64     .79     .39     .15 |
  |     .05   .7081      64     .16     .64      .8     .39     .16 |
  |     .05   .7628      64     .17     .64     .81     .39     .17 |
  |     .05   .8118      64     .18     .64     .82     .39     .18 |
  |     .05   .8545      64     .19     .64     .83     .39     .19 |
  |     .05   .8905      64      .2     .64     .84     .39      .2 |
  |     .05       .      64       .     .64     .64     .39       0 |
  |      .1   .1038      64     .01     .64     .65     .39     .01 |
  |      .1   .1154      64     .02     .64     .66     .39     .02 |
  |      .1   .1346      64     .03     .64     .67     .39     .03 |
  |      .1   .1616      64     .04     .64     .68     .39     .04 |
  |      .1    .196      64     .05     .64     .69     .39     .05 |
  |      .1   .2376      64     .06     .64      .7     .39     .06 |
  |      .1   .2857      64     .07     .64     .71     .39     .07 |
  |      .1   .3395      64     .08     .64     .72     .39     .08 |
  |      .1   .3979      64     .09     .64     .73     .39     .09 |
  |      .1   .4595      64      .1     .64     .74     .39      .1 |
  |      .1   .5229      64     .11     .64     .75     .39     .11 |
  |      .1   .5864      64     .12     .64     .76     .39     .12 |
  |      .1   .6484      64     .13     .64     .77     .39     .13 |
  |      .1   .7072      64     .14     .64     .78     .39     .14 |
  |      .1   .7615      64     .15     .64     .79     .39     .15 |
  |      .1   .8104      64     .16     .64      .8     .39     .16 |
  |      .1   .8529      64     .17     .64     .81     .39     .17 |
  |      .1   .8889      64     .18     .64     .82     .39     .18 |
  |      .1   .9184      64     .19     .64     .83     .39     .19 |
  |      .1   .9419      64      .2     .64     .84     .39      .2 |
  +-----------------------------------------------------------------+
   Warning: some of the computations failed; execute each computation separately to see the specific error

. *MDES alpha 0.05 --> d=0.18, alpha 0.1 --> d=0.16
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. *equivalence testing response to first bonus1
. clear all

. use "$working_ANALYSIS/processed/analysis_wide.dta"

. drop if villager==1
(384 observations deleted)

. bys bonus_order: tab1 rule5 rule6

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Large first

-> tabulation of rule5  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         20       66.67       66.67
Pseudo-democratic |          8       26.67       93.33
       Autocratic |          2        6.67      100.00
------------------+-----------------------------------
            Total |         30      100.00

-> tabulation of rule6  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         19       63.33       63.33
Pseudo-democratic |         10       33.33       96.67
       Autocratic |          1        3.33      100.00
------------------+-----------------------------------
            Total |         30      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Small first

-> tabulation of rule5  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         21       61.76       61.76
Pseudo-democratic |         12       35.29       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00

-> tabulation of rule6  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         22       64.71       64.71
Pseudo-democratic |         11       32.35       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00

. 
. *Two-sample paired mean-equivalence t test
. tab rule_bonus_first, gen(rule_bonus_first_)

 rule_bonus_first |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         40       62.50       62.50
Pseudo-democratic |         22       34.38       96.88
       Autocratic |          2        3.13      100.00
------------------+-----------------------------------
            Total |         64      100.00

. tab rule_bonus_second, gen(rule_bonus_second_)

rule_bonus_second |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         42       65.63       65.63
Pseudo-democratic |         19       29.69       95.31
       Autocratic |          3        4.69      100.00
------------------+-----------------------------------
            Total |         64      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .164375   .0852131                     -.0026397    .3313897
         θ+Δ |    .195625   .0852131                      .0286103    .3626397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1800  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.929                   z2 = 2.296   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0269          Pr(Z > z2) = 0.0108


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base3: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bonus_f |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .109375   .0485932                      .0141341    .2046159
             |  under Ho:   .0495455     2.21   0.027
------------------------------------------------------------------------------
        diff = prop(rule_base3) - prop(rule_bonus_f)              z =   2.2076
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9864         Pr(|Z| > |z|) = 0.0273          Pr(Z > z) = 0.0136



Two-sample test of proportion equivalence rule_base3: Number of obs =       64
                                        rule_bon~t_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bon~t_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .070625   .0495455                     -.0264824    .1677324
         θ+Δ |    .289375   .0495455                      .1922676    .3864824
------------------------------------------------------------------------------
         θ = prop(rule_base3) - prop(rule_bonus_first_3) = .109375
         Δ = 0.1800  Δ expressed in same units as prop(rule_base3)

Ho: |θ| >= Δ:

        z1 = 1.425                   z2 = 5.841   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0770          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. pwcorr rule_base rule_bonus_first

             | rule_b~e rule_b~t
-------------+------------------
   rule_base |   1.0000 
rule_bonus~t |   0.1945   1.0000 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. pwcorr rule_base rule_bonus_first rule_bonus_second

             | rule_b~e rule_b~t rule_b~d
-------------+---------------------------
   rule_base |   1.0000 
rule_bonus~t |   0.1945   1.0000 
rule_bonus~d |   0.3536   0.5338   1.0000 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_second_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_s: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_s |     .65625   .0593699                      .5398872    .7726128
-------------+----------------------------------------------------------------
        diff |   -.015625   .0843922                     -.1810306    .1497806
             |  under Ho:   .0844035    -0.19   0.853
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_s)              z =  -0.1851
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.4266         Pr(|Z| > |z|) = 0.8531          Pr(Z > z) = 0.5734



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~d_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~d_1 |     .65625   .0593699                      .5398872    .7726128
-------------+----------------------------------------------------------------
         Δ-θ |    .195625   .0844035                      .0301972    .3610528
         θ+Δ |    .164375   .0844035                     -.0010528    .3298028
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_second_1) = -.015625
         Δ = 0.1800  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 2.318                   z2 = 1.947   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0102          Pr(Z > z2) = 0.0257


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. bys bonus_order: tab1 rule5 rule6

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Large first

-> tabulation of rule5  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         20       66.67       66.67
Pseudo-democratic |          8       26.67       93.33
       Autocratic |          2        6.67      100.00
------------------+-----------------------------------
            Total |         30      100.00

-> tabulation of rule6  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         19       63.33       63.33
Pseudo-democratic |         10       33.33       96.67
       Autocratic |          1        3.33      100.00
------------------+-----------------------------------
            Total |         30      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Small first

-> tabulation of rule5  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         21       61.76       61.76
Pseudo-democratic |         12       35.29       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00

-> tabulation of rule6  

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         22       64.71       64.71
Pseudo-democratic |         11       32.35       97.06
       Autocratic |          1        2.94      100.00
------------------+-----------------------------------
            Total |         34      100.00

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. bys bonus_order: sum rule5 rule6

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Large first

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rule5 |         30         1.4    .6214555          1          3
       rule6 |         30         1.4    .5632418          1          3

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> bonus_order = Small first

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rule5 |         34    1.411765    .5569205          1          3
       rule6 |         34    1.382353    .5512908          1          3


. 
end of do-file

. sum rule_base1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1

. sum rule_base1 rule_bonus_first_1 rule_bonus_second_1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1
rule_bon~t_1 |         64        .625      .48795          0          1
rule_bon~d_1 |         64      .65625    .4787136          0          1

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. sum rule_base1 rule_bonus_first_1 rule_bonus_second_1 rule_base3 rule_bonus_first_3 rule_bonus_second_3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1
rule_bon~t_1 |         64        .625      .48795          0          1
rule_bon~d_1 |         64      .65625    .4787136          0          1
  rule_base3 |         64     .140625    .3503824          0          1
rule_bon~t_3 |         64      .03125    .1753681          0          1
-------------+---------------------------------------------------------
rule_bon~d_3 |         64     .046875     .213042          0          1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. sum rule_base1 rule_bonus_first_1  rule_base3 rule_bonus_first_3 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1
rule_bon~t_1 |         64        .625      .48795          0          1
  rule_base3 |         64     .140625    .3503824          0          1
rule_bon~t_3 |         64      .03125    .1753681          0          1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base2: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bonus_f |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
        diff |      -.125   .0787088                     -.2792663    .0292663
             |  under Ho:   .0794804    -1.57   0.116
------------------------------------------------------------------------------
        diff = prop(rule_base2) - prop(rule_bonus_f)              z =  -1.5727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0579         Pr(|Z| > |z|) = 0.1158          Pr(Z > z) = 0.9421



Two-sample test of proportion equivalence rule_base2: Number of obs =       64
                                        rule_bon~t_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bon~t_2 |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
         Δ-θ |       .305   .0794804                      .1492212    .4607788
         θ+Δ |       .055   .0794804                     -.1007788    .2107788
------------------------------------------------------------------------------
         θ = prop(rule_base2) - prop(rule_bonus_first_2) = -.125
         Δ = 0.1800  Δ expressed in same units as prop(rule_base2)

Ho: |θ| >= Δ:

        z1 = 3.837                   z2 = .692    

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0001          Pr(Z > z2) = 0.2445


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. sum rule_base1 rule_bonus_first_1   rule_base2 rule_bonus_first_2  rule_base3 rule_bonus_first_3 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1
rule_bon~t_1 |         64        .625      .48795          0          1
  rule_base2 |         64      .21875    .4166667          0          1
rule_bon~t_2 |         64      .34375    .4787136          0          1
  rule_base3 |         64     .140625    .3503824          0          1
-------------+---------------------------------------------------------
rule_bon~t_3 |         64      .03125    .1753681          0          1

. 
end of do-file

. help tost

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostt rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
    diff |      64     .015625     .068618    .5489438   -.1214971    .1527471
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base1 - rule_bonus_fir~1)             t =   0.2277
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5897         Pr(|T| > |t|) = 0.8206          Pr(T > t) = 0.4103



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
     Δ-θ |             .164375     .068618                .0272529    .3014971
     θ+Δ |             .195625     .068618                .0585029    .3327471
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base1 - rule_bonus_first_1)
         Δ = 0.1800  Δ expressed in same units as rule_base1
        df = 63      

Ho: |θ| >= Δ:

        t1 = 2.396                   t2 = 2.851   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0098          Pr(T > t2) = 0.0029


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .164375   .0852131                     -.0026397    .3313897
         θ+Δ |    .195625   .0852131                      .0286103    .3626397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1800  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.929                   z2 = 2.296   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0269          Pr(Z > z2) = 0.0108


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostt rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
    diff |      64     .015625     .068618    .5489438   -.1214971    .1527471
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base1 - rule_bonus_fir~1)             t =   0.2277
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5897         Pr(|T| > |t|) = 0.8206          Pr(T > t) = 0.4103



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
     Δ-θ |             .134375     .068618               -.0027471    .2714971
     θ+Δ |             .165625     .068618                .0285029    .3027471
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base1 - rule_bonus_first_1)
         Δ = 0.1500  Δ expressed in same units as rule_base1
        df = 63      

Ho: |θ| >= Δ:

        t1 = 1.958                   t2 = 2.414   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0273          Pr(T > t2) = 0.0094


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostt rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
    diff |      64     .015625     .068618    .5489438   -.1214971    .1527471
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base1 - rule_bonus_fir~1)             t =   0.2277
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5897         Pr(|T| > |t|) = 0.8206          Pr(T > t) = 0.4103



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
     Δ-θ |             .134375     .068618               -.0027471    .2714971
     θ+Δ |             .165625     .068618                .0285029    .3027471
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base1 - rule_bonus_first_1)
         Δ = 0.1500  Δ expressed in same units as rule_base1
        df = 63      

Ho: |θ| >= Δ:

        t1 = 1.958                   t2 = 2.414   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0273          Pr(T > t2) = 0.0094


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostt rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
    diff |      64     .015625     .068618    .5489438   -.1214971    .1527471
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base1 - rule_bonus_fir~1)             t =   0.2277
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5897         Pr(|T| > |t|) = 0.8206          Pr(T > t) = 0.4103



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
     Δ-θ |             .134375     .068618               -.0027471    .2714971
     θ+Δ |             .165625     .068618                .0285029    .3027471
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base1 - rule_bonus_first_1)
         Δ = 0.1500  Δ expressed in same units as rule_base1
        df = 63      

Ho: |θ| >= Δ:

        t1 = 1.958                   t2 = 2.414   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0273          Pr(T > t2) = 0.0094


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. tostt rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e2 |      64      .21875    .0520833    .4166667    .1146698    .3228302
rule~t_2 |      64      .34375    .0598392    .4787136    .2241709    .4633291
---------+--------------------------------------------------------------------
    diff |      64       -.125    .0609938      .48795   -.2468863   -.0031137
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base2 - rule_bonus_fir~2)             t =  -2.0494
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0223         Pr(|T| > |t|) = 0.0446          Pr(T > t) = 0.9777



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e2 |      64      .21875    .0520833    .4166667    .1146698    .3228302
rule~t_2 |      64      .34375    .0598392    .4787136    .2241709    .4633291
---------+--------------------------------------------------------------------
     Δ-θ |                .275    .0609938                .1531137    .3968863
     θ+Δ |                .025    .0609938               -.0968863    .1468863
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base2 - rule_bonus_first_2)
         Δ = 0.1500  Δ expressed in same units as rule_base2
        df = 63      

Ho: |θ| >= Δ:

        t1 = 4.509                   t2 = .4099   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0000          Pr(T > t2) = 0.3416


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. tostt rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e3 |      64     .140625    .0437978    .3503824    .0531021    .2281479
rule~t_3 |      64      .03125     .021921    .1753681   -.0125556    .0750556
---------+--------------------------------------------------------------------
    diff |      64     .109375    .0503814    .4030514    .0086958    .2100542
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base3 - rule_bonus_fir~3)             t =   2.1709
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9831         Pr(|T| > |t|) = 0.0337          Pr(T > t) = 0.0169



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e3 |      64     .140625    .0437978    .3503824    .0531021    .2281479
rule~t_3 |      64      .03125     .021921    .1753681   -.0125556    .0750556
---------+--------------------------------------------------------------------
     Δ-θ |             .040625    .0503814               -.0600542    .1413042
     θ+Δ |             .259375    .0503814                .1586958    .3600542
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base3 - rule_bonus_first_3)
         Δ = 0.1500  Δ expressed in same units as rule_base3
        df = 63      

Ho: |θ| >= Δ:

        t1 = .8063                   t2 = 5.148   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.2115          Pr(T > t2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .134375   .0852131                     -.0326397    .3013897
         θ+Δ |    .165625   .0852131                     -.0013897    .3326397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1500  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.577                   z2 = 1.944   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0574          Pr(Z > z2) = 0.0260


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. tostpr rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base2: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bonus_f |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
        diff |      -.125   .0787088                     -.2792663    .0292663
             |  under Ho:   .0794804    -1.57   0.116
------------------------------------------------------------------------------
        diff = prop(rule_base2) - prop(rule_bonus_f)              z =  -1.5727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0579         Pr(|Z| > |z|) = 0.1158          Pr(Z > z) = 0.9421



Two-sample test of proportion equivalence rule_base2: Number of obs =       64
                                        rule_bon~t_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bon~t_2 |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
         Δ-θ |       .275   .0794804                      .1192212    .4307788
         θ+Δ |       .025   .0794804                     -.1307788    .1807788
------------------------------------------------------------------------------
         θ = prop(rule_base2) - prop(rule_bonus_first_2) = -.125
         Δ = 0.1500  Δ expressed in same units as prop(rule_base2)

Ho: |θ| >= Δ:

        z1 = 3.46                    z2 = .3145   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0003          Pr(Z > z2) = 0.3766


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. tostpr rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base3: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bonus_f |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .109375   .0485932                      .0141341    .2046159
             |  under Ho:   .0495455     2.21   0.027
------------------------------------------------------------------------------
        diff = prop(rule_base3) - prop(rule_bonus_f)              z =   2.2076
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9864         Pr(|Z| > |z|) = 0.0273          Pr(Z > z) = 0.0136



Two-sample test of proportion equivalence rule_base3: Number of obs =       64
                                        rule_bon~t_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bon~t_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .040625   .0495455                     -.0564824    .1377324
         θ+Δ |    .259375   .0495455                      .1622676    .3564824
------------------------------------------------------------------------------
         θ = prop(rule_base3) - prop(rule_bonus_first_3) = .109375
         Δ = 0.1500  Δ expressed in same units as prop(rule_base3)

Ho: |θ| >= Δ:

        z1 = .82                     z2 = 5.235   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.2061          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .134375   .0852131                     -.0326397    .3013897
         θ+Δ |    .165625   .0852131                     -.0013897    .3326397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1500  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.577                   z2 = 1.944   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0574          Pr(Z > z2) = 0.0260


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .164375   .0852131                     -.0026397    .3313897
         θ+Δ |    .195625   .0852131                      .0286103    .3626397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1800  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.929                   z2 = 2.296   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0269          Pr(Z > z2) = 0.0108


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base2: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bonus_f |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
        diff |      -.125   .0787088                     -.2792663    .0292663
             |  under Ho:   .0794804    -1.57   0.116
------------------------------------------------------------------------------
        diff = prop(rule_base2) - prop(rule_bonus_f)              z =  -1.5727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0579         Pr(|Z| > |z|) = 0.1158          Pr(Z > z) = 0.9421



Two-sample test of proportion equivalence rule_base2: Number of obs =       64
                                        rule_bon~t_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bon~t_2 |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
         Δ-θ |       .275   .0794804                      .1192212    .4307788
         θ+Δ |       .025   .0794804                     -.1307788    .1807788
------------------------------------------------------------------------------
         θ = prop(rule_base2) - prop(rule_bonus_first_2) = -.125
         Δ = 0.1500  Δ expressed in same units as prop(rule_base2)

Ho: |θ| >= Δ:

        z1 = 3.46                    z2 = .3145   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0003          Pr(Z > z2) = 0.3766


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base2: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bonus_f |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
        diff |      -.125   .0787088                     -.2792663    .0292663
             |  under Ho:   .0794804    -1.57   0.116
------------------------------------------------------------------------------
        diff = prop(rule_base2) - prop(rule_bonus_f)              z =  -1.5727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0579         Pr(|Z| > |z|) = 0.1158          Pr(Z > z) = 0.9421



Two-sample test of proportion equivalence rule_base2: Number of obs =       64
                                        rule_bon~t_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bon~t_2 |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
         Δ-θ |       .305   .0794804                      .1492212    .4607788
         θ+Δ |       .055   .0794804                     -.1007788    .2107788
------------------------------------------------------------------------------
         θ = prop(rule_base2) - prop(rule_bonus_first_2) = -.125
         Δ = 0.1800  Δ expressed in same units as prop(rule_base2)

Ho: |θ| >= Δ:

        z1 = 3.837                   z2 = .692    

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0001          Pr(Z > z2) = 0.2445


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base3: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bonus_f |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .109375   .0485932                      .0141341    .2046159
             |  under Ho:   .0495455     2.21   0.027
------------------------------------------------------------------------------
        diff = prop(rule_base3) - prop(rule_bonus_f)              z =   2.2076
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9864         Pr(|Z| > |z|) = 0.0273          Pr(Z > z) = 0.0136



Two-sample test of proportion equivalence rule_base3: Number of obs =       64
                                        rule_bon~t_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bon~t_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .070625   .0495455                     -.0264824    .1677324
         θ+Δ |    .289375   .0495455                      .1922676    .3864824
------------------------------------------------------------------------------
         θ = prop(rule_base3) - prop(rule_bonus_first_3) = .109375
         Δ = 0.1800  Δ expressed in same units as prop(rule_base3)

Ho: |θ| >= Δ:

        z1 = 1.425                   z2 = 5.841   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0770          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3f54_000000.tmp"

. tostpr rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base3: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bonus_f |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .109375   .0485932                      .0141341    .2046159
             |  under Ho:   .0495455     2.21   0.027
------------------------------------------------------------------------------
        diff = prop(rule_base3) - prop(rule_bonus_f)              z =   2.2076
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9864         Pr(|Z| > |z|) = 0.0273          Pr(Z > z) = 0.0136



Two-sample test of proportion equivalence rule_base3: Number of obs =       64
                                        rule_bon~t_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bon~t_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .070625   .0495455                     -.0264824    .1677324
         θ+Δ |    .289375   .0495455                      .1922676    .3864824
------------------------------------------------------------------------------
         θ = prop(rule_base3) - prop(rule_bonus_first_3) = .109375
         Δ = 0.1800  Δ expressed in same units as prop(rule_base3)

Ho: |θ| >= Δ:

        z1 = 1.425                   z2 = 5.841   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0770          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
end of do-file

. help testt

. help tost

. exit, clear
