---------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/logs/2023.07.19-10.49.11.log.txt
  log type:  text
 opened on:  19 Jul 2023, 10:49:11

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 19 Jul 2023 10:49:11

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/scripts/libraries/stata"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss
> ;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduce
> s transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. *Afrobarometer Data Round 6 (2014)
. clear

. use "$working_ANALYSIS/data/afro_r6.dta"

. keep if COUNTRY==22
(52,735 observations deleted)

. rename *, lower

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. 
. gen ohangwena= 0

. replace ohangwena = 1 if region == 588
(120 real changes made)

. lab def ohang 0 "Rest of Namibia" 1 "Ohangwena", replace

. lab val ohangwena ohang

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52k, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,080    2.312963    .0422911    1.389828    2.229981    2.395945
Ohangwen |     120    2.008333    .0771479    .8451128    1.855573    2.161094
---------+--------------------------------------------------------------------
combined |   1,200      2.2825    .0389181    1.348162    2.206145    2.358855
---------+--------------------------------------------------------------------
    diff |            .3046296    .1294823                .0505923     .558667
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.3527
Ho: diff = 0                                     degrees of freedom =     1198

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9906         Pr(|T| > |t|) = 0.0188          Pr(T > t) = 0.0094

.  
. 
end of do-file

. tab q52k

 Q52k. Trust traditional leaders |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                      Not at all |         65        5.42        5.42
                   Just a little |        206       17.17       22.58
                        Somewhat |        416       34.67       57.25
                           A lot |        486       40.50       97.75
Don't know/ Haven't heard enough |         27        2.25      100.00
---------------------------------+-----------------------------------
                           Total |      1,200      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52b, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,080    2.308333    .0443716    1.458199    2.221269    2.395398
Ohangwen |     120    2.383333    .0977215    1.070485    2.189835    2.576832
---------+--------------------------------------------------------------------
combined |   1,200    2.315833    .0411073    1.423999    2.235183    2.396484
---------+--------------------------------------------------------------------
    diff |               -.075    .1370644                -.343913     .193913
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =  -0.5472
Ho: diff = 0                                     degrees of freedom =     1198

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2922         Pr(|T| > |t|) = 0.5844          Pr(T > t) = 0.7078

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52j, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,080    2.144444    .0336748    1.106668    2.078369     2.21052
Ohangwen |     120    1.933333    .1009294    1.105626    1.733483    2.133184
---------+--------------------------------------------------------------------
combined |   1,200    2.123333    .0319828    1.107916    2.060585    2.186082
---------+--------------------------------------------------------------------
    diff |            .2111111    .1064792                .0022046    .4200176
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   1.9827
Ho: diff = 0                                     degrees of freedom =     1198

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9762         Pr(|T| > |t|) = 0.0476          Pr(T > t) = 0.0238

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q68d, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,080    3.255556    .0441694    1.451555    3.168888    3.342223
Ohangwen |     120       3.825    .2125813    2.328712    3.404068    4.245932
---------+--------------------------------------------------------------------
combined |   1,200      3.3125    .0453097    1.569574    3.223605    3.401395
---------+--------------------------------------------------------------------
    diff |           -.5694444     .150197               -.8641229    -.274766
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =  -3.7913
Ho: diff = 0                                     degrees of freedom =     1198

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0001         Pr(|T| > |t|) = 0.0002          Pr(T > t) = 0.9999

. 
end of do-file

. tab q68d

 Q68d. Performance: traditional |
                         leader |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
            Strongly Disapprove |         48        4.00        4.00
                     Disapprove |        184       15.33       19.33
                        Approve |        653       54.42       73.75
               Strongly Approve |        247       20.58       94.33
Don’t know/Haven't heard enough |         68        5.67      100.00
--------------------------------+-----------------------------------
                          Total |      1,200      100.00

. tab q52b

 Q52b. Trust parliament/national |
                        assembly |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                      Not at all |         83        6.92        6.92
                   Just a little |        186       15.50       22.42
                        Somewhat |        386       32.17       54.58
                           A lot |        514       42.83       97.42
Don't know/ Haven't heard enough |         31        2.58      100.00
---------------------------------+-----------------------------------
                           Total |      1,200      100.00

. tab q52b, nolab

Q52b. Trust |
parliament/ |
   national |
   assembly |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         83        6.92        6.92
          1 |        186       15.50       22.42
          2 |        386       32.17       54.58
          3 |        514       42.83       97.42
          9 |         31        2.58      100.00
------------+-----------------------------------
      Total |      1,200      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. for each x of varlist q30 q52b q52j q52k q68d {
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. for each x of varlist q30 q52b q52j q52k q68d {
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. foreach x of varlist q30 q52b q52j q52k q68d {
  2.         replace `x'=. if `x'==9
  3. }
(28 real changes made, 28 to missing)
(31 real changes made, 31 to missing)
(11 real changes made, 11 to missing)
(27 real changes made, 27 to missing)
(68 real changes made, 68 to missing)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52b, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,050    2.117143    .0287843    .9327182    2.060661    2.173624
Ohangwen |     119    2.327731    .0810391     .884032    2.167252    2.488211
---------+--------------------------------------------------------------------
combined |   1,169     2.13858    .0271916    .9296993     2.08523     2.19193
---------+--------------------------------------------------------------------
    diff |           -.2105882    .0897523               -.3866822   -.0344943
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =  -2.3463
Ho: diff = 0                                     degrees of freedom =     1167

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0096         Pr(|T| > |t|) = 0.0191          Pr(T > t) = 0.9904

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52j, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,070    2.080374    .0272134     .890175    2.026976    2.133772
Ohangwen |     119     1.87395    .0822994    .8977809    1.710974    2.036925
---------+--------------------------------------------------------------------
combined |   1,189    2.059714    .0258893    .8927129     2.00892    2.110508
---------+--------------------------------------------------------------------
    diff |            .2064243    .0860936                .0375116    .3753369
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.3977
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9917         Pr(|T| > |t|) = 0.0167          Pr(T > t) = 0.0083

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q52k, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,053      2.1415    .0276339    .8967179    2.087277    2.195724
Ohangwen |     120    2.008333    .0771479    .8451128    1.855573    2.161094
---------+--------------------------------------------------------------------
combined |   1,173    2.127877    .0260487    .8921436     2.07677    2.178984
---------+--------------------------------------------------------------------
    diff |            .1331671    .0859051                -.035378    .3017123
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   1.5502
Ho: diff = 0                                     degrees of freedom =     1171

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9393         Pr(|T| > |t|) = 0.1214          Pr(T > t) = 0.0607

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q68d, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,030    2.976699    .0226438    .7267222    2.932266    3.021132
Ohangwen |     102    2.911765    .0871282    .8799521    2.738926    3.084604
---------+--------------------------------------------------------------------
combined |   1,132    2.970848    .0220421    .7416127      2.9276    3.014096
---------+--------------------------------------------------------------------
    diff |            .0649343    .0769905               -.0861261    .2159947
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   0.8434
Ho: diff = 0                                     degrees of freedom =     1130

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8004         Pr(|T| > |t|) = 0.3992          Pr(T > t) = 0.1996

. 
end of do-file

. tab  q58

     Q58. Main reason for not reporting |
                             corruption |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Most people do report incidents of corr |         91        7.58        7.58
People don't have enough time to report |         48        4.00       11.58
   People don't know where to report it |        152       12.67       24.25
     People don't know how to report it |        118        9.83       34.08
Nothing will be done / It wouldn't make |        143       11.92       46.00
           It's too expensive to report |         30        2.50       48.50
Corruption is normal / Everyone does it |         77        6.42       54.92
  People are afraid of the consequences |        328       27.33       82.25
The officials where they would report t |         81        6.75       89.00
It's government's money, so it's not ou |         12        1.00       90.00
They would implicate themselves as brib |         24        2.00       92.00
   Corruption is too difficult to prove |         76        6.33       98.33
                                  Other |          2        0.17       98.50
                             Don't know |         18        1.50      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,200      100.00

. tab q58

     Q58. Main reason for not reporting |
                             corruption |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
Most people do report incidents of corr |         91        7.58        7.58
People don't have enough time to report |         48        4.00       11.58
   People don't know where to report it |        152       12.67       24.25
     People don't know how to report it |        118        9.83       34.08
Nothing will be done / It wouldn't make |        143       11.92       46.00
           It's too expensive to report |         30        2.50       48.50
Corruption is normal / Everyone does it |         77        6.42       54.92
  People are afraid of the consequences |        328       27.33       82.25
The officials where they would report t |         81        6.75       89.00
It's government's money, so it's not ou |         12        1.00       90.00
They would implicate themselves as brib |         24        2.00       92.00
   Corruption is too difficult to prove |         76        6.33       98.33
                                  Other |          2        0.17       98.50
                             Don't know |         18        1.50      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,200      100.00

. tab q71a

    Q71a. People can fight |
                corruption |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
         Strongly Disagree |         98        8.17        8.17
                  Disagree |        199       16.58       24.75
Neither Agree Nor Disagree |         68        5.67       30.42
                     Agree |        428       35.67       66.08
            Strongly Agree |        396       33.00       99.08
                Don’t Know |         11        0.92      100.00
---------------------------+-----------------------------------
                     Total |      1,200      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. foreach x of varlist q30 q52b q52j q52k q68d q71a {
  2.         replace `x'=. if `x'==9
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(11 real changes made, 11 to missing)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. ttest q71a, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,069    3.727783    .0394163    1.288739    3.650441    3.805125
Ohangwen |     120    3.391667     .130875    1.433664    3.132521    3.650812
---------+--------------------------------------------------------------------
combined |   1,189     3.69386    .0379148    1.307375    3.619473    3.768248
---------+--------------------------------------------------------------------
    diff |            .3361163    .1255415                .0898084    .5824242
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.6773
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9962         Pr(|T| > |t|) = 0.0075          Pr(T > t) = 0.0038

.  
. 
end of do-file

. tab region

              Province or Region |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Zambezi |         48        4.00        4.00
                          Erongo |         96        8.00       12.00
                          Hardap |         48        4.00       16.00
                          !Karas |         48        4.00       20.00
                    Kavango West |         40        3.33       23.33
                    Kavango East |         72        6.00       29.33
                          Khomas |        232       19.33       48.67
                          Kunene |         48        4.00       52.67
                       Ohangwena |        120       10.00       62.67
                         Omaheke |         40        3.33       66.00
                         Omusati |        128       10.67       76.67
                          Oshana |        104        8.67       85.33
                        Oshikoto |         96        8.00       93.33
                    Otjozondjupa |         80        6.67      100.00
---------------------------------+-----------------------------------
                           Total |      1,200      100.00

. tab 
varlist required
r(100);

. tab r5_only

     R5.only |      Freq.     Percent        Cum.
-------------+-----------------------------------
    Selected |      1,200      100.00      100.00
-------------+-----------------------------------
       Total |      1,200      100.00

. tab educ_cond

Education condensed |      Freq.     Percent        Cum.
--------------------+-----------------------------------
No formal education |         74        6.17        6.17
            Primary |        262       21.83       28.00
          Secondary |        636       53.00       81.00
     Post-secondary |        228       19.00      100.00
--------------------+-----------------------------------
              Total |      1,200      100.00

. ttest educ_cond, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,080    1.896296     .023985    .7882273    1.849234    1.943359
Ohangwen |     120    1.416667    .0665089    .7285687    1.284972    1.548361
---------+--------------------------------------------------------------------
combined |   1,200    1.848333    .0229587     .795314     1.80329    1.893377
---------+--------------------------------------------------------------------
    diff |            .4796296    .0752966                .3319018    .6273574
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   6.3699
Ho: diff = 0                                     degrees of freedom =     1198

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. tab location_level_1

                Location Level 1 |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                         Aminius |          8        0.67        0.67
                      Anamulenga |          8        0.67        1.33
                          Aranos |          8        0.67        2.00
                         Berseba |         16        1.33        3.33
                          Daures |          8        0.67        4.00
                         Eengodi |          8        0.67        4.67
                         Eenhana |          8        0.67        5.33
                            Elim |          8        0.67        6.00
                          Endola |         16        1.33        7.33
                          Engela |         16        1.33        8.67
                          Epembe |          8        0.67        9.33
                         Epukiro |          8        0.67       10.00
                           Epupa |          8        0.67       10.67
                           Etayi |         16        1.33       12.00
                          Gibeon |          8        0.67       12.67
                         Gobabis |         16        1.33       14.00
                       Groot Aub |          8        0.67       14.67
                    Grootfontein |         16        1.33       16.00
                    John Pandeni |         16        1.33       17.33
                      Kabe North |          8        0.67       18.00
                        Kamanjab |          8        0.67       18.67
                          Kapako |         16        1.33       20.00
                  Karasburg East |          8        0.67       20.67
                  Karasburg West |          8        0.67       21.33
                         Karibib |         16        1.33       22.67
             Katima Mulilo Rural |          8        0.67       23.33
             Katima Mulilo Urban |         16        1.33       24.67
                Katutura Central |         16        1.33       26.00
                   Katutura East |         16        1.33       27.33
              Keetmanshoop Urban |         16        1.33       28.67
                       Khomasdal |         32        2.67       31.33
                        Khorixas |          8        0.67       32.00
                         Kongola |          8        0.67       32.67
                 Mariental Urban |          8        0.67       33.33
                         Mashare |          8        0.67       34.00
                    Moses Garoeb |         24        2.00       36.00
                          Mpungu |          8        0.67       36.67
                           Mukwe |         16        1.33       38.00
                          Musese |          8        0.67       38.67
                        Ncuncuni |          8        0.67       39.33
                   Ndonga Linena |          8        0.67       40.00
                          Ogongo |          8        0.67       40.67
                       Ohangwena |          8        0.67       41.33
                       Okahandja |         16        1.33       42.67
                          Okahao |          8        0.67       43.33
                       Okakarara |          8        0.67       44.00
                           Okaku |         16        1.33       45.33
                        Okalongo |         16        1.33       46.67
                        Okankolo |          8        0.67       47.33
                        Okatyali |          8        0.67       48.00
                          Okongo |          8        0.67       48.67
                      Okorukambe |          8        0.67       49.33
                        Olukonda |          8        0.67       50.00
                         Omatako |          8        0.67       50.67
                        Omulonga |          8        0.67       51.33
                    Omundaungilo |          8        0.67       52.00
                        Omuntele |          8        0.67       52.67
           Omuthia Ya Gwii Pundi |          8        0.67       53.33
                         Onayena |          8        0.67       54.00
                  Ondangwa Rural |          8        0.67       54.67
                  Ondangwa Urban |         16        1.33       56.00
                         Ondombe |          8        0.67       56.67
                           Onesi |          8        0.67       57.33
                         Ongenga |          8        0.67       58.00
                       Ongwediva |         16        1.33       59.33
                          Oniipa |         16        1.33       60.67
                        Onyaanya |          8        0.67       61.33
                     Opuwo Rural |          8        0.67       62.00
                   Oshakati East |         16        1.33       63.33
                   Oshakati West |         16        1.33       64.67
                       Oshikango |         16        1.33       66.00
                        Oshikuku |          8        0.67       66.67
                       Oshikunde |          8        0.67       67.33
                        Otamanzi |          8        0.67       68.00
                           Otavi |          8        0.67       68.67
                     Otjiwarongo |         16        1.33       70.00
                          Outapi |         24        2.00       72.00
                           Outjo |          8        0.67       72.67
             Rehoboth East Urban |          8        0.67       73.33
                  Rehoboth Rural |          8        0.67       74.00
             Rehoboth West Urban |          8        0.67       74.67
                     Rundu Rural |          8        0.67       75.33
                     Rundu Urban |         32        2.67       78.00
                   Samora Machel |         32        2.67       80.67
                      Sesfontein |          8        0.67       81.33
                        Sibbinda |          8        0.67       82.00
                      Swakopmund |         24        2.00       84.00
                 Tobias Hainyeko |         40        3.33       87.33
                          Tsandi |         16        1.33       88.67
                          Tsumeb |         24        2.00       90.67
                         Tsumkwe |          8        0.67       91.33
                         Uukwiyu |          8        0.67       92.00
                      Walvis Bay |         16        1.33       93.33
                Walvis Bay Rural |          8        0.67       94.00
                Walvis Bay Urban |         24        2.00       96.00
                   Windhoek East |         16        1.33       97.33
                   Windhoek West |         32        2.67      100.00
---------------------------------+-----------------------------------
                           Total |      1,200      100.00

. tab location_level_1 location_level_1 if ohangwena==1

                      |                                               Location Level 1
     Location Level 1 |   Eenhana     Endola     Engela     Epembe  Ohangwena     Okongo   Omulonga  Omundau..    Ondombe    Ongenga |     Total
----------------------+--------------------------------------------------------------------------------------------------------------+----------
              Eenhana |         8          0          0          0          0          0          0          0          0          0 |         8 
               Endola |         0         16          0          0          0          0          0          0          0          0 |        16 
               Engela |         0          0         16          0          0          0          0          0          0          0 |        16 
               Epembe |         0          0          0          8          0          0          0          0          0          0 |         8 
            Ohangwena |         0          0          0          0          8          0          0          0          0          0 |         8 
               Okongo |         0          0          0          0          0          8          0          0          0          0 |         8 
             Omulonga |         0          0          0          0          0          0          8          0          0          0 |         8 
         Omundaungilo |         0          0          0          0          0          0          0          8          0          0 |         8 
              Ondombe |         0          0          0          0          0          0          0          0          8          0 |         8 
              Ongenga |         0          0          0          0          0          0          0          0          0          8 |         8 
            Oshikango |         0          0          0          0          0          0          0          0          0          0 |        16 
            Oshikunde |         0          0          0          0          0          0          0          0          0          0 |         8 
----------------------+--------------------------------------------------------------------------------------------------------------+----------
                Total |         8         16         16          8          8          8          8          8          8          8 |       120 


                      |   Location Level 1
     Location Level 1 | Oshikango  Oshikunde |     Total
----------------------+----------------------+----------
              Eenhana |         0          0 |         8 
               Endola |         0          0 |        16 
               Engela |         0          0 |        16 
               Epembe |         0          0 |         8 
            Ohangwena |         0          0 |         8 
               Okongo |         0          0 |         8 
             Omulonga |         0          0 |         8 
         Omundaungilo |         0          0 |         8 
              Ondombe |         0          0 |         8 
              Ongenga |         0          0 |         8 
            Oshikango |        16          0 |        16 
            Oshikunde |         0          8 |         8 
----------------------+----------------------+----------
                Total |        16          8 |       120 

. tabn q30
command tabn is unrecognized
r(199);

. tab q30

             Q30. Support for democracy |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
            STATEMENT 3: Doesn't matter |        192       16.38       16.38
STATEMENT 2: Sometimes non-democratic p |         96        8.19       24.57
      STATEMENT 1: Democracy preferable |        884       75.43      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,172      100.00

. tab q30, nolab

       Q30. |
Support for |
  democracy |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        192       16.38       16.38
          2 |         96        8.19       24.57
          3 |        884       75.43      100.00
------------+-----------------------------------
      Total |      1,172      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. replace demo_pref = 0 if q30<3
variable demo_pref not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. gen demo_pref= 1 if q30==3
(316 missing values generated)

. replace demo_pref = 0 if q30<3
(288 real changes made)

. 
end of do-file

. tab demo_pref

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        288       24.57       24.57
          1 |        884       75.43      100.00
------------+-----------------------------------
      Total |      1,172      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. cibar demo_pref if ohangwena==1, over(location_level_1)
string variables not allowed in varlist;
location_level_1 is a string variable
invalid over() option
r(109);

end of do-file

r(109);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. cibar demo_pref if ohangwena==1, over1(location_level_1)
string variables not allowed in varlist;
location_level_1 is a string variable
invalid over() option
r(109);

end of do-file

r(109);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. encode location_level_1, gen(constituency)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. cibar demo_pref if ohangwena==1, over1(constituency)

. 
end of do-file

. tab demo_pref if ohangwena==1

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       27.19       27.19
          1 |         83       72.81      100.00
------------+-----------------------------------
      Total |        114      100.00

. bys constituency: tab demo_pref if ohangwena==1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Aminius
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Anamulenga
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Aranos
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Berseba
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Daures
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Eengodi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Eenhana

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       12.50       12.50
          1 |          7       87.50      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Elim
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Endola

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       26.67       26.67
          1 |         11       73.33      100.00
------------+-----------------------------------
      Total |         15      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Engela

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       26.67       26.67
          1 |         11       73.33      100.00
------------+-----------------------------------
      Total |         15      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epembe

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       14.29       14.29
          1 |          6       85.71      100.00
------------+-----------------------------------
      Total |          7      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epukiro
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epupa
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Etayi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Gibeon
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Gobabis
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Groot Aub
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Grootfontein
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = John Pandeni
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kabe North
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kamanjab
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kapako
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karasburg East
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karasburg West
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karibib
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katima Mulilo Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katima Mulilo Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katutura Central
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katutura East
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Keetmanshoop Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Khomasdal
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Khorixas
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kongola
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mariental Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mashare
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Moses Garoeb
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mpungu
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mukwe
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Musese
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ncuncuni
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ndonga Linena
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ogongo
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ohangwena

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       75.00       75.00
          1 |          2       25.00      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okahandja
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okahao
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okakarara
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okaku
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okalongo
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okankolo
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okatyali
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okongo

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4       50.00       50.00
          1 |          4       50.00      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okorukambe
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Olukonda
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omatako
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omulonga

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3       37.50       37.50
          1 |          5       62.50      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omundaungilo

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2       25.00       25.00
          1 |          6       75.00      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omuntele
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omuthia Ya Gwii Pundi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onayena
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondangwa Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondangwa Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondombe

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3       42.86       42.86
          1 |          4       57.14      100.00
------------+-----------------------------------
      Total |          7      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onesi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ongenga

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       12.50       12.50
          1 |          7       87.50      100.00
------------+-----------------------------------
      Total |          8      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ongwediva
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oniipa
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onyaanya
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Opuwo Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshakati East
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshakati West
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikango

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        6.67        6.67
          1 |         14       93.33      100.00
------------+-----------------------------------
      Total |         15      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikuku
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikunde

  demo_pref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       14.29       14.29
          1 |          6       85.71      100.00
------------+-----------------------------------
      Total |          7      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otamanzi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otavi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otjiwarongo
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Outapi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Outjo
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth East Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth West Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rundu Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rundu Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Samora Machel
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Sesfontein
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Sibbinda
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Swakopmund
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tobias Hainyeko
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsandi
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsumeb
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsumkwe
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Uukwiyu
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay Rural
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay Urban
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Windhoek East
no observations

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Windhoek West
no observations


. bys constituency: sum demo_pref if ohangwena==1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Aminius

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Anamulenga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Aranos

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Berseba

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Daures

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Eengodi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Eenhana

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8        .875    .3535534          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Elim

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Endola

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |         15    .7333333    .4577377          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Engela

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |         15    .7333333    .4577377          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epembe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          7    .8571429    .3779645          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epukiro

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Epupa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Etayi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Gibeon

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Gobabis

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Groot Aub

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Grootfontein

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = John Pandeni

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kabe North

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kamanjab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kapako

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karasburg East

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karasburg West

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Karibib

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katima Mulilo Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katima Mulilo Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katutura Central

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Katutura East

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Keetmanshoop Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Khomasdal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Khorixas

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Kongola

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mariental Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mashare

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Moses Garoeb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mpungu

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Mukwe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Musese

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ncuncuni

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ndonga Linena

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ogongo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ohangwena

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8         .25      .46291          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okahandja

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okahao

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okakarara

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okaku

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okalongo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okankolo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okatyali

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okongo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8          .5    .5345225          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Okorukambe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Olukonda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omatako

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omulonga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8        .625    .5175492          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omundaungilo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8         .75      .46291          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omuntele

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Omuthia Ya Gwii Pundi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onayena

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondangwa Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondangwa Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ondombe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          7    .5714286    .5345225          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onesi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ongenga

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          8        .875    .3535534          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Ongwediva

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oniipa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Onyaanya

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Opuwo Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshakati East

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshakati West

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikango

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |         15    .9333333    .2581989          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikuku

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Oshikunde

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          7    .8571429    .3779645          0          1

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otamanzi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otavi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Otjiwarongo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Outapi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Outjo

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth East Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rehoboth West Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rundu Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Rundu Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Samora Machel

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Sesfontein

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Sibbinda

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Swakopmund

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tobias Hainyeko

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsandi

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsumeb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Tsumkwe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Uukwiyu

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay Rural

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Walvis Bay Urban

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Windhoek East

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0

---------------------------------------------------------------------------------------------------------------------------------------------------------
-> constituency = Windhoek West

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demo_pref |          0


. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. catplot q30 if ohagwena==1, over(constituency) asyvars stack horizontal recast(bar) yla(0(20)100, nogrid) percent(constituency) bargap(10) blabel(bar, 
> format(%9.0f) pos(center)  gap(0.1)) title("Which of these three statements is closest to your own opinion?")  b1title("") legend(ring(1) pos(6) rows(2
> ))
ohagwena not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. catplot q30 if ohangwena==1, over(constituency) asyvars stack horizontal recast(bar) yla(0(20)100, nogrid) percent(constituency) bargap(10) blabel(bar,
>  format(%9.0f) pos(center)  gap(0.1)) title("Which of these three statements is closest to your own opinion?")  b1title("") legend(ring(1) pos(6) rows(
> 2))

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. gr save  "$working_ANALYSIS/results/intermediate/support_dem_ohangwena.gph", replace
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/support_dem_ohangwena.gph
>  not found)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/support_dem_ohangwena.gph saved
> )

. gr export "$working_ANALYSIS/results/figures/afro_support_ohangwena.tif", replace width(4000)
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/afro_support_ohangwena.tif not
>  found)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/afro_support_ohangwena.tif written i
> n TIFF format)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. tab q30 constituency if ohangwena==1

     Q30. Support for |                                               Location Level 1
            democracy |   Eenhana     Endola     Engela     Epembe  Ohangwena     Okongo   Omulonga  Omundaung    Ondombe    Ongenga |     Total
----------------------+--------------------------------------------------------------------------------------------------------------+----------
STATEMENT 3: Doesn't  |         0          4          4          0          5          3          3          2          3          1 |        27 
STATEMENT 2: Sometime |         1          0          0          1          1          1          0          0          0          0 |         4 
STATEMENT 1: Democrac |         7         11         11          6          2          4          5          6          4          7 |        83 
----------------------+--------------------------------------------------------------------------------------------------------------+----------
                Total |         8         15         15          7          8          8          8          8          7          8 |       114 


     Q30. Support for |   Location Level 1
            democracy | Oshikango  Oshikunde |     Total
----------------------+----------------------+----------
STATEMENT 3: Doesn't  |         1          1 |        27 
STATEMENT 2: Sometime |         0          0 |         4 
STATEMENT 1: Democrac |        14          6 |        83 
----------------------+----------------------+----------
                Total |        15          7 |       114 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. reg q30 i.constituency if ohangwena==1, vce(hc3)

Linear regression                               Number of obs     =        114
                                                F(11, 102)        =       1.94
                                                Prob > F          =     0.0428
                                                R-squared         =     0.1639
                                                Root MSE          =     .82229

-------------------------------------------------------------------------------
              |             Robust HC3
          q30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 constituency |
      Endola  |  -.4083333    .278785    -1.46   0.146    -.9613021    .1446354
      Engela  |  -.4083333    .278785    -1.46   0.146    -.9613021    .1446354
      Epembe  |  -.0178571   .2041241    -0.09   0.930    -.4227364    .3870221
   Ohangwena  |      -1.25   .3711537    -3.37   0.001    -1.986182   -.5138183
      Okongo  |       -.75   .3976975    -1.89   0.062    -1.538831     .038831
    Omulonga  |      -.625   .4134227    -1.51   0.134    -1.445022    .1950221
Omundaungilo  |      -.375   .3745746    -1.00   0.319    -1.117967    .3679669
     Ondombe  |  -.7321429   .4564355    -1.60   0.112     -1.63748    .1731947
     Ongenga  |      -.125   .2988072    -0.42   0.677    -.7176826    .4676826
   Oshikango  |  -.0083333   .1921061    -0.04   0.965    -.3893749    .3727082
   Oshikunde  |  -.1607143   .3362964    -0.48   0.634    -.8277565    .5063279
              |
        _cons |      2.875   .1336306    21.51   0.000     2.609944    3.140056
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. mprobit q30 i.constituency if ohangwena==1, vce(hc3)
vcetype 'hc3' not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. *--------------------------------------------------------------------
. * SCRIPT: 03_analysis.do
. * PURPOSE: replicates the tables and figures and saves the results
. *--------------------------------------------------------------------
. 
. *--------------------------------------------------
. * STRUCTURE OF THE DO-FILE
. /*
> 
>         1) Analysis Long Format:
>                 - Main Manuscript
>                 - SOM
>         2) Analysis Wide Format:
>                 - Main Manuscript
>                 - SOM
> */
. *--------------------------------------------------
. 
. 
. *--------------------------------------------------
. * Revisions
. *--------------------------------------------------
. *power analysis: MDES with 80% power
. power pairedproportions 0.64, corr(0.39) diff(0(0.01)0.2) alpha(0.05 0.1) n(64)

Estimated power for a two-sample paired-proportions test
Large-sample McNemar's test
Ho: p+1 = p1+  versus  Ha: p+1 != p1+

  +-----------------------------------------------------------------+
  |   alpha   power       N   delta  pmarg1  pmarg2    corr    diff |
  |-----------------------------------------------------------------|
  |     .05       .       .       .     .64     .64     .39       0 |
  |     .05  .05259      64     .01     .64     .65     .39     .01 |
  |     .05  .06045      64     .02     .64     .66     .39     .02 |
  |     .05   .0738      64     .03     .64     .67     .39     .03 |
  |     .05   .0929      64     .04     .64     .68     .39     .04 |
  |     .05    .118      64     .05     .64     .69     .39     .05 |
  |     .05   .1494      64     .06     .64      .7     .39     .06 |
  |     .05    .187      64     .07     .64     .71     .39     .07 |
  |     .05    .231      64     .08     .64     .72     .39     .08 |
  |     .05   .2808      64     .09     .64     .73     .39     .09 |
  |     .05   .3359      64      .1     .64     .74     .39      .1 |
  |     .05   .3953      64     .11     .64     .75     .39     .11 |
  |     .05   .4578      64     .12     .64     .76     .39     .12 |
  |     .05    .522      64     .13     .64     .77     .39     .13 |
  |     .05   .5862      64     .14     .64     .78     .39     .14 |
  |     .05   .6487      64     .15     .64     .79     .39     .15 |
  |     .05   .7081      64     .16     .64      .8     .39     .16 |
  |     .05   .7628      64     .17     .64     .81     .39     .17 |
  |     .05   .8118      64     .18     .64     .82     .39     .18 |
  |     .05   .8545      64     .19     .64     .83     .39     .19 |
  |     .05   .8905      64      .2     .64     .84     .39      .2 |
  |     .05       .      64       .     .64     .64     .39       0 |
  |      .1   .1038      64     .01     .64     .65     .39     .01 |
  |      .1   .1154      64     .02     .64     .66     .39     .02 |
  |      .1   .1346      64     .03     .64     .67     .39     .03 |
  |      .1   .1616      64     .04     .64     .68     .39     .04 |
  |      .1    .196      64     .05     .64     .69     .39     .05 |
  |      .1   .2376      64     .06     .64      .7     .39     .06 |
  |      .1   .2857      64     .07     .64     .71     .39     .07 |
  |      .1   .3395      64     .08     .64     .72     .39     .08 |
  |      .1   .3979      64     .09     .64     .73     .39     .09 |
  |      .1   .4595      64      .1     .64     .74     .39      .1 |
  |      .1   .5229      64     .11     .64     .75     .39     .11 |
  |      .1   .5864      64     .12     .64     .76     .39     .12 |
  |      .1   .6484      64     .13     .64     .77     .39     .13 |
  |      .1   .7072      64     .14     .64     .78     .39     .14 |
  |      .1   .7615      64     .15     .64     .79     .39     .15 |
  |      .1   .8104      64     .16     .64      .8     .39     .16 |
  |      .1   .8529      64     .17     .64     .81     .39     .17 |
  |      .1   .8889      64     .18     .64     .82     .39     .18 |
  |      .1   .9184      64     .19     .64     .83     .39     .19 |
  |      .1   .9419      64      .2     .64     .84     .39      .2 |
  +-----------------------------------------------------------------+
   Warning: some of the computations failed; execute each computation separately to see the specific error

. *MDES alpha 0.05 --> d=0.18, alpha 0.1 --> d=0.16
. 
. power pairedproportions 0.64, corr(0.39) diff(0(0.01)0.2) n(64) table(alpha power beta N delta:"Difference in proportion to select democratic rule") gr
> aph(ytitle(Effect size) xline(0.8, lcolor(538b) lpattern(dash)) yline(0.178, lpattern(dash)) title("") legend(ring(1) rows(1) pos(6)) xdimension(power)
>  xla(0(0.1)1, nogrid) yla(0(0.02)0.2, nogrid) ydimension(diff)) 

Estimated power for a two-sample paired-proportions test
Large-sample McNemar's test
Ho: p+1 = p1+  versus  Ha: p+1 != p1+

  +------------------------------------------------------------------------------------+
  |   alpha   power    beta       N Difference in proportion to select democratic rule |
  |------------------------------------------------------------------------------------|
  |     .05       .       .       .                                                  . |
  |     .05  .05259   .9474      64                                                .01 |
  |     .05  .06045   .9396      64                                                .02 |
  |     .05   .0738   .9262      64                                                .03 |
  |     .05   .0929   .9071      64                                                .04 |
  |     .05    .118    .882      64                                                .05 |
  |     .05   .1494   .8506      64                                                .06 |
  |     .05    .187    .813      64                                                .07 |
  |     .05    .231    .769      64                                                .08 |
  |     .05   .2808   .7192      64                                                .09 |
  |     .05   .3359   .6641      64                                                 .1 |
  |     .05   .3953   .6047      64                                                .11 |
  |     .05   .4578   .5422      64                                                .12 |
  |     .05    .522    .478      64                                                .13 |
  |     .05   .5862   .4138      64                                                .14 |
  |     .05   .6487   .3513      64                                                .15 |
  |     .05   .7081   .2919      64                                                .16 |
  |     .05   .7628   .2372      64                                                .17 |
  |     .05   .8118   .1882      64                                                .18 |
  |     .05   .8545   .1455      64                                                .19 |
  |     .05   .8905   .1095      64                                                 .2 |
  +------------------------------------------------------------------------------------+
   Warning: some of the computations failed; execute each computation separately to see the specific error
(note:  named style medthin not found in class linestyle, default attributes used)
(note:  named style 538b not found in class color, default attributes used)

. gr save  "$working_ANALYSIS/results/intermediate/mdes.gph", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/intermediate/mdes.gph saved)

. gr export "$working_ANALYSIS/results/figures/mdes.tif", replace width(4000)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis/results/figures/mdes.tif written in TIFF format)

. 
. *equivalence testing response to first bonus1
. clear all

. use "$working_ANALYSIS/processed/analysis_wide.dta"

. drop if villager==1
(384 observations deleted)

. tab rule_bonus_first, gen(rule_bonus_first_)

 rule_bonus_first |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         40       62.50       62.50
Pseudo-democratic |         22       34.38       96.88
       Autocratic |          2        3.13      100.00
------------------+-----------------------------------
            Total |         64      100.00

. tab rule_bonus_second, gen(rule_bonus_second_)

rule_bonus_second |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         42       65.63       65.63
Pseudo-democratic |         19       29.69       95.31
       Autocratic |          3        4.69      100.00
------------------+-----------------------------------
            Total |         64      100.00

. sum rule_base1 rule_bonus_first_1   rule_base2 rule_bonus_first_2  rule_base3 rule_bonus_first_3 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  rule_base1 |         64     .640625    .4836103          0          1
rule_bon~t_1 |         64        .625      .48795          0          1
  rule_base2 |         64      .21875    .4166667          0          1
rule_bon~t_2 |         64      .34375    .4787136          0          1
  rule_base3 |         64     .140625    .3503824          0          1
-------------+---------------------------------------------------------
rule_bon~t_3 |         64      .03125    .1753681          0          1

. *Two-sample paired proportions test
. tostpr rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base1: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bonus_f |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
        diff |    .015625   .0852019                     -.1513677    .1826177
             |  under Ho:   .0852131     0.18   0.855
------------------------------------------------------------------------------
        diff = prop(rule_base1) - prop(rule_bonus_f)              z =   0.1834
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5727         Pr(|Z| > |z|) = 0.8545          Pr(Z > z) = 0.4273



Two-sample test of proportion equivalence rule_base1: Number of obs =       64
                                        rule_bon~t_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base1 |    .640625   .0599772                      .5230719    .7581781
rule_bon~t_1 |       .625   .0605154                      .5063921    .7436079
-------------+----------------------------------------------------------------
         Δ-θ |    .164375   .0852131                     -.0026397    .3313897
         θ+Δ |    .195625   .0852131                      .0286103    .3626397
------------------------------------------------------------------------------
         θ = prop(rule_base1) - prop(rule_bonus_first_1) = .015625
         Δ = 0.1800  Δ expressed in same units as prop(rule_base1)

Ho: |θ| >= Δ:

        z1 = 1.929                   z2 = 2.296   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0269          Pr(Z > z2) = 0.0108


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. tostpr rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base2: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bonus_f |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
        diff |      -.125   .0787088                     -.2792663    .0292663
             |  under Ho:   .0794804    -1.57   0.116
------------------------------------------------------------------------------
        diff = prop(rule_base2) - prop(rule_bonus_f)              z =  -1.5727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.0579         Pr(|Z| > |z|) = 0.1158          Pr(Z > z) = 0.9421



Two-sample test of proportion equivalence rule_base2: Number of obs =       64
                                        rule_bon~t_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base2 |     .21875   .0516748                      .1174692    .3200308
rule_bon~t_2 |     .34375   .0593699                      .2273872    .4601128
-------------+----------------------------------------------------------------
         Δ-θ |       .305   .0794804                      .1492212    .4607788
         θ+Δ |       .055   .0794804                     -.1007788    .2107788
------------------------------------------------------------------------------
         θ = prop(rule_base2) - prop(rule_bonus_first_2) = -.125
         Δ = 0.1800  Δ expressed in same units as prop(rule_base2)

Ho: |θ| >= Δ:

        z1 = 3.837                   z2 = .692    

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0001          Pr(Z > z2) = 0.2445


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Indeterminate (underpowered test)

. tostpr rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions            rule_base3: Number of obs =       64
                                        rule_bonus_f: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bonus_f |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .109375   .0485932                      .0141341    .2046159
             |  under Ho:   .0495455     2.21   0.027
------------------------------------------------------------------------------
        diff = prop(rule_base3) - prop(rule_bonus_f)              z =   2.2076
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9864         Pr(|Z| > |z|) = 0.0273          Pr(Z > z) = 0.0136



Two-sample test of proportion equivalence rule_base3: Number of obs =       64
                                        rule_bon~t_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  rule_base3 |    .140625   .0434543                      .0554562    .2257938
rule_bon~t_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .070625   .0495455                     -.0264824    .1677324
         θ+Δ |    .289375   .0495455                      .1922676    .3864824
------------------------------------------------------------------------------
         θ = prop(rule_base3) - prop(rule_bonus_first_3) = .109375
         Δ = 0.1800  Δ expressed in same units as prop(rule_base3)

Ho: |θ| >= Δ:

        z1 = 1.425                   z2 = 5.841   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0770          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. 
. 
. 
. *Two-sample paired mean-equivalence t test
. tostt rule_base1 == rule_bonus_first_1,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
    diff |      64     .015625     .068618    .5489438   -.1214971    .1527471
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base1 - rule_bonus_fir~1)             t =   0.2277
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5897         Pr(|T| > |t|) = 0.8206          Pr(T > t) = 0.4103



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e1 |      64     .640625    .0604513    .4836103    .5198227    .7614273
rule~t_1 |      64        .625    .0609938      .48795    .5031137    .7468863
---------+--------------------------------------------------------------------
     Δ-θ |             .134375     .068618               -.0027471    .2714971
     θ+Δ |             .165625     .068618                .0285029    .3027471
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base1 - rule_bonus_first_1)
         Δ = 0.1500  Δ expressed in same units as rule_base1
        df = 63      

Ho: |θ| >= Δ:

        t1 = 1.958                   t2 = 2.414   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0273          Pr(T > t2) = 0.0094


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. tostt rule_base2 == rule_bonus_first_2,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e2 |      64      .21875    .0520833    .4166667    .1146698    .3228302
rule~t_2 |      64      .34375    .0598392    .4787136    .2241709    .4633291
---------+--------------------------------------------------------------------
    diff |      64       -.125    .0609938      .48795   -.2468863   -.0031137
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base2 - rule_bonus_fir~2)             t =  -2.0494
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0223         Pr(|T| > |t|) = 0.0446          Pr(T > t) = 0.9777



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e2 |      64      .21875    .0520833    .4166667    .1146698    .3228302
rule~t_2 |      64      .34375    .0598392    .4787136    .2241709    .4633291
---------+--------------------------------------------------------------------
     Δ-θ |                .275    .0609938                .1531137    .3968863
     θ+Δ |                .025    .0609938               -.0968863    .1468863
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base2 - rule_bonus_first_2)
         Δ = 0.1500  Δ expressed in same units as rule_base2
        df = 63      

Ho: |θ| >= Δ:

        t1 = 4.509                   t2 = .4099   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.0000          Pr(T > t2) = 0.3416


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. tostt rule_base3 == rule_bonus_first_3,   eqvtype(delta) eqvlevel(0.15) relevance
Relevance test of sample means

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e3 |      64     .140625    .0437978    .3503824    .0531021    .2281479
rule~t_3 |      64      .03125     .021921    .1753681   -.0125556    .0750556
---------+--------------------------------------------------------------------
    diff |      64     .109375    .0503814    .4030514    .0086958    .2100542
------------------------------------------------------------------------------
     mean(diff) = mean(rule_base3 - rule_bonus_fir~3)             t =   2.1709
 Ho: mean(diff) = 0                              degrees of freedom =       63

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9831         Pr(|T| > |t|) = 0.0337          Pr(T > t) = 0.0169



Paired t test for mean equivalence
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
rule_~e3 |      64     .140625    .0437978    .3503824    .0531021    .2281479
rule~t_3 |      64      .03125     .021921    .1753681   -.0125556    .0750556
---------+--------------------------------------------------------------------
     Δ-θ |             .040625    .0503814               -.0600542    .1413042
     θ+Δ |             .259375    .0503814                .1586958    .3600542
------------------------------------------------------------------------------
   mean(θ) = mean(rule_base3 - rule_bonus_first_3)
         Δ = 0.1500  Δ expressed in same units as rule_base3
        df = 63      

Ho: |θ| >= Δ:

        t1 = .8063                   t2 = 5.148   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(T > t1) = 0.2115          Pr(T > t2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.15:
  Ho test for difference:  Reject
  Ho test for equivalence: Fail to reject

Conclusion from combined tests: Relevant difference

. *small versus large bonus:
. tab rule5, gen (small_)

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         41       64.06       64.06
Pseudo-democratic |         20       31.25       95.31
       Autocratic |          3        4.69      100.00
------------------+-----------------------------------
            Total |         64      100.00

. tab rule6, gen (large_)

      1=majority, |
      2=dictator, |
  3=Fake majority |
             rule |      Freq.     Percent        Cum.
------------------+-----------------------------------
       Democratic |         41       64.06       64.06
Pseudo-democratic |         21       32.81       96.88
       Autocratic |          2        3.13      100.00
------------------+-----------------------------------
            Total |         64      100.00

. sum small_1 large_1   small_2 large_2  small_3 large_3 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     small_1 |         64     .640625    .4836103          0          1
     large_1 |         64     .640625    .4836103          0          1
     small_2 |         64       .3125    .4671766          0          1
     large_2 |         64     .328125    .4732424          0          1
     small_3 |         64     .046875     .213042          0          1
-------------+---------------------------------------------------------
     large_3 |         64      .03125    .1753681          0          1

. 
. tostpr small_1 == large_1,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions               small_1: Number of obs =       64
                                             large_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_1 |    .640625   .0599772                      .5230719    .7581781
     large_1 |    .640625   .0599772                      .5230719    .7581781
-------------+----------------------------------------------------------------
        diff |          0   .0848205                     -.1662451    .1662451
             |  under Ho:   .0848205     0.00   1.000
------------------------------------------------------------------------------
        diff = prop(small_1) - prop(large_1)                      z =   0.0000
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.5000         Pr(|Z| > |z|) = 1.0000          Pr(Z > z) = 0.5000



Two-sample test of proportion equivalence    small_1: Number of obs =       64
                                             large_1: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_1 |    .640625   .0599772                      .5230719    .7581781
     large_1 |    .640625   .0599772                      .5230719    .7581781
-------------+----------------------------------------------------------------
         Δ-θ |        .18   .0848205                      .0137549    .3462451
         θ+Δ |        .18   .0848205                      .0137549    .3462451
------------------------------------------------------------------------------
         θ = prop(small_1) - prop(large_1) = 0
         Δ = 0.1800  Δ expressed in same units as prop(small_1)

Ho: |θ| >= Δ:

        z1 = 2.122                   z2 = 2.122   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0169          Pr(Z > z2) = 0.0169


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. tostpr small_2 == large_2,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions               small_2: Number of obs =       64
                                             large_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_2 |      .3125   .0579391                      .1989415    .4260585
     large_2 |    .328125   .0586913                      .2130921    .4431579
-------------+----------------------------------------------------------------
        diff |   -.015625   .0824718                     -.1772668    .1460168
             |  under Ho:   .0824834    -0.19   0.850
------------------------------------------------------------------------------
        diff = prop(small_2) - prop(large_2)                      z =  -0.1894
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.4249         Pr(|Z| > |z|) = 0.8498          Pr(Z > z) = 0.5751



Two-sample test of proportion equivalence    small_2: Number of obs =       64
                                             large_2: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_2 |      .3125   .0579391                      .1989415    .4260585
     large_2 |    .328125   .0586913                      .2130921    .4431579
-------------+----------------------------------------------------------------
         Δ-θ |    .195625   .0824834                      .0339605    .3572895
         θ+Δ |    .164375   .0824834                      .0027105    .3260395
------------------------------------------------------------------------------
         θ = prop(small_2) - prop(large_2) = -.015625
         Δ = 0.1800  Δ expressed in same units as prop(small_2)

Ho: |θ| >= Δ:

        z1 = 2.372                   z2 = 1.993   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0089          Pr(Z > z2) = 0.0231


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. tostpr small_3 == large_3,   eqvtype(delta) eqvlevel(0.18) relevance
Relevance test of sample proportions

Two-sample test of proportions               small_3: Number of obs =       64
                                             large_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_3 |    .046875   .0264214                       -.00491      .09866
     large_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
        diff |    .015625   .0342215                     -.0514479    .0826979
             |  under Ho:   .0342494     0.46   0.648
------------------------------------------------------------------------------
        diff = prop(small_3) - prop(large_3)                      z =   0.4562
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.6759         Pr(|Z| > |z|) = 0.6482          Pr(Z > z) = 0.3241



Two-sample test of proportion equivalence    small_3: Number of obs =       64
                                             large_3: Number of obs =       64
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.                     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     small_3 |    .046875   .0264214                       -.00491      .09866
     large_3 |     .03125   .0217491                     -.0113774    .0738774
-------------+----------------------------------------------------------------
         Δ-θ |    .164375   .0342494                      .0972475    .2315025
         θ+Δ |    .195625   .0342494                      .1284975    .2627525
------------------------------------------------------------------------------
         θ = prop(small_3) - prop(large_3) = .015625
         Δ = 0.1800  Δ expressed in same units as prop(small_3)

Ho: |θ| >= Δ:

        z1 = 4.799                   z2 = 5.712   

   Ho1: Δ-θ <= 0                Ho2: θ+Δ <= 0
   Ha1: Δ-θ > 0                 Ha2: θ+Δ > 0
   Pr(Z > z1) = 0.0000          Pr(Z > z2) = 0.0000


Relevance test conclusion for α = 0.05, and Δ = 0.18:
  Ho test for difference:  Fail to reject
  Ho test for equivalence: Reject

Conclusion from combined tests: Equivalence

. 
. *Afrobarometer Data Round 6 (2014)
. clear

. use "$working_ANALYSIS/data/afro_r6.dta"

. keep if COUNTRY==22
(52,735 observations deleted)

. rename *, lower

. 
. 
. gen ohangwena= 0

. replace ohangwena = 1 if region == 588
(120 real changes made)

. lab def ohang 0 "Rest of Namibia" 1 "Ohangwena", replace

. lab val ohangwena ohang

. *SUPPORT FOR DEMOCRACY
. tab q30, nolab

       Q30. |
Support for |
  democracy |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        192       16.00       16.00
          2 |         96        8.00       24.00
          3 |        884       73.67       97.67
          9 |         28        2.33      100.00
------------+-----------------------------------
      Total |      1,200      100.00

. lab def democracy 1 "Does't matter for someone like me" 2 "Sometimes non-democratic preferable" 3 "Always democracy preferable", replace 

. lab val q30 democracy

. foreach x of varlist q30 q52b q52j q52k q68d q71a {
  2.         replace `x'=. if `x'==9
  3. }
(28 real changes made, 28 to missing)
(31 real changes made, 31 to missing)
(11 real changes made, 11 to missing)
(27 real changes made, 27 to missing)
(68 real changes made, 68 to missing)
(11 real changes made, 11 to missing)

. encode location_level_1, gen(constituency)

. gen demo_pref= 1 if q30==3
(316 missing values generated)

. replace demo_pref = 0 if q30<3
(288 real changes made)

. 
. ttest q52b, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,050    2.117143    .0287843    .9327182    2.060661    2.173624
Ohangwen |     119    2.327731    .0810391     .884032    2.167252    2.488211
---------+--------------------------------------------------------------------
combined |   1,169     2.13858    .0271916    .9296993     2.08523     2.19193
---------+--------------------------------------------------------------------
    diff |           -.2105882    .0897523               -.3866822   -.0344943
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =  -2.3463
Ho: diff = 0                                     degrees of freedom =     1167

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0096         Pr(|T| > |t|) = 0.0191          Pr(T > t) = 0.9904

. ttest q52j, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,070    2.080374    .0272134     .890175    2.026976    2.133772
Ohangwen |     119     1.87395    .0822994    .8977809    1.710974    2.036925
---------+--------------------------------------------------------------------
combined |   1,189    2.059714    .0258893    .8927129     2.00892    2.110508
---------+--------------------------------------------------------------------
    diff |            .2064243    .0860936                .0375116    .3753369
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.3977
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9917         Pr(|T| > |t|) = 0.0167          Pr(T > t) = 0.0083

. ttest q52k, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,053      2.1415    .0276339    .8967179    2.087277    2.195724
Ohangwen |     120    2.008333    .0771479    .8451128    1.855573    2.161094
---------+--------------------------------------------------------------------
combined |   1,173    2.127877    .0260487    .8921436     2.07677    2.178984
---------+--------------------------------------------------------------------
    diff |            .1331671    .0859051                -.035378    .3017123
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   1.5502
Ho: diff = 0                                     degrees of freedom =     1171

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9393         Pr(|T| > |t|) = 0.1214          Pr(T > t) = 0.0607

. ttest q68d, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,030    2.976699    .0226438    .7267222    2.932266    3.021132
Ohangwen |     102    2.911765    .0871282    .8799521    2.738926    3.084604
---------+--------------------------------------------------------------------
combined |   1,132    2.970848    .0220421    .7416127      2.9276    3.014096
---------+--------------------------------------------------------------------
    diff |            .0649343    .0769905               -.0861261    .2159947
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   0.8434
Ho: diff = 0                                     degrees of freedom =     1130

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8004         Pr(|T| > |t|) = 0.3992          Pr(T > t) = 0.1996

. ttest q71a, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,069    3.727783    .0394163    1.288739    3.650441    3.805125
Ohangwen |     120    3.391667     .130875    1.433664    3.132521    3.650812
---------+--------------------------------------------------------------------
combined |   1,189     3.69386    .0379148    1.307375    3.619473    3.768248
---------+--------------------------------------------------------------------
    diff |            .3361163    .1255415                .0898084    .5824242
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.6773
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9962         Pr(|T| > |t|) = 0.0075          Pr(T > t) = 0.0038

.  
. gen com_member = 0

. replace com_member = 1 if q19b==3 | q19b==2
(169 real changes made)

. 
. *PANEL A: Democracy is preferable to any other kind of government.
. catplot q30 , over(ohangwena) asyvars stack horizontal recast(bar) yla(0(20)100, nogrid) percent(ohangwena) bargap(10) blabel(bar, format(%9.0f) pos(ce
> nter)  gap(0.1)) title("Which of these three statements is closest to your own opinion?")  b1title("") legend(ring(1) pos(6) rows(2))
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. *Afrobarometer Data Round 6 (2014)
. clear

. use "$working_ANALYSIS/data/afro_r6.dta"

. keep if COUNTRY==22
(52,735 observations deleted)

. rename *, lower

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. gen ohangwena= 0

. replace ohangwena = 1 if region == 588
(120 real changes made)

. lab def ohang 0 "Rest of Namibia" 1 "Ohangwena", replace

. lab val ohangwena ohang

. *SUPPORT FOR DEMOCRACY
. tab q30, nolab

       Q30. |
Support for |
  democracy |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        192       16.00       16.00
          2 |         96        8.00       24.00
          3 |        884       73.67       97.67
          9 |         28        2.33      100.00
------------+-----------------------------------
      Total |      1,200      100.00

. lab def democracy 1 "Does't matter for someone like me" 2 "Sometimes non-democratic preferable" 3 "Always democracy preferable", replace 

. lab val q30 democracy

. foreach x of varlist q30 q52b q52j q52k q68d q71a {
  2.         replace `x'=. if `x'==9
  3. }
(28 real changes made, 28 to missing)
(31 real changes made, 31 to missing)
(11 real changes made, 11 to missing)
(27 real changes made, 27 to missing)
(68 real changes made, 68 to missing)
(11 real changes made, 11 to missing)

. encode location_level_1, gen(constituency)

. gen demo_pref= 1 if q30==3
(316 missing values generated)

. replace demo_pref = 0 if q30<3
(288 real changes made)

. 
. ttest q52b, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,050    2.117143    .0287843    .9327182    2.060661    2.173624
Ohangwen |     119    2.327731    .0810391     .884032    2.167252    2.488211
---------+--------------------------------------------------------------------
combined |   1,169     2.13858    .0271916    .9296993     2.08523     2.19193
---------+--------------------------------------------------------------------
    diff |           -.2105882    .0897523               -.3866822   -.0344943
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =  -2.3463
Ho: diff = 0                                     degrees of freedom =     1167

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0096         Pr(|T| > |t|) = 0.0191          Pr(T > t) = 0.9904

. ttest q52j, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,070    2.080374    .0272134     .890175    2.026976    2.133772
Ohangwen |     119     1.87395    .0822994    .8977809    1.710974    2.036925
---------+--------------------------------------------------------------------
combined |   1,189    2.059714    .0258893    .8927129     2.00892    2.110508
---------+--------------------------------------------------------------------
    diff |            .2064243    .0860936                .0375116    .3753369
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.3977
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9917         Pr(|T| > |t|) = 0.0167          Pr(T > t) = 0.0083

. ttest q52k, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,053      2.1415    .0276339    .8967179    2.087277    2.195724
Ohangwen |     120    2.008333    .0771479    .8451128    1.855573    2.161094
---------+--------------------------------------------------------------------
combined |   1,173    2.127877    .0260487    .8921436     2.07677    2.178984
---------+--------------------------------------------------------------------
    diff |            .1331671    .0859051                -.035378    .3017123
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   1.5502
Ho: diff = 0                                     degrees of freedom =     1171

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9393         Pr(|T| > |t|) = 0.1214          Pr(T > t) = 0.0607

. ttest q68d, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,030    2.976699    .0226438    .7267222    2.932266    3.021132
Ohangwen |     102    2.911765    .0871282    .8799521    2.738926    3.084604
---------+--------------------------------------------------------------------
combined |   1,132    2.970848    .0220421    .7416127      2.9276    3.014096
---------+--------------------------------------------------------------------
    diff |            .0649343    .0769905               -.0861261    .2159947
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   0.8434
Ho: diff = 0                                     degrees of freedom =     1130

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8004         Pr(|T| > |t|) = 0.3992          Pr(T > t) = 0.1996

. ttest q71a, by(ohangwena)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Rest of |   1,069    3.727783    .0394163    1.288739    3.650441    3.805125
Ohangwen |     120    3.391667     .130875    1.433664    3.132521    3.650812
---------+--------------------------------------------------------------------
combined |   1,189     3.69386    .0379148    1.307375    3.619473    3.768248
---------+--------------------------------------------------------------------
    diff |            .3361163    .1255415                .0898084    .5824242
------------------------------------------------------------------------------
    diff = mean(Rest of) - mean(Ohangwen)                         t =   2.6773
Ho: diff = 0                                     degrees of freedom =     1187

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9962         Pr(|T| > |t|) = 0.0075          Pr(T > t) = 0.0038

.  
. gen com_member = 0

. replace com_member = 1 if q19b==3 | q19b==2
(169 real changes made)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. tab q30 constituency if ohangwena==1

     Q30. Support for |                                               Location Level 1
            democracy |   Eenhana     Endola     Engela     Epembe  Ohangwena     Okongo   Omulonga  Omundaung    Ondombe    Ongenga |     Total
----------------------+--------------------------------------------------------------------------------------------------------------+----------
Does't matter for som |         0          4          4          0          5          3          3          2          3          1 |        27 
Sometimes non-democra |         1          0          0          1          1          1          0          0          0          0 |         4 
Always democracy pref |         7         11         11          6          2          4          5          6          4          7 |        83 
----------------------+--------------------------------------------------------------------------------------------------------------+----------
                Total |         8         15         15          7          8          8          8          8          7          8 |       114 


     Q30. Support for |   Location Level 1
            democracy | Oshikango  Oshikunde |     Total
----------------------+----------------------+----------
Does't matter for som |         1          1 |        27 
Sometimes non-democra |         0          0 |         4 
Always democracy pref |        14          6 |        83 
----------------------+----------------------+----------
                Total |        15          7 |       114 

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. mprobit q30 i.constituency if ohangwena==1, vce(robust)

Iteration 0:   log pseudolikelihood = -62.507778  (not concave)
Iteration 1:   log pseudolikelihood =  -62.49022  (not concave)
Iteration 2:   log pseudolikelihood = -62.418308  (not concave)
Iteration 3:   log pseudolikelihood = -62.415182  (not concave)
Iteration 4:   log pseudolikelihood = -62.413972  (not concave)
Iteration 5:   log pseudolikelihood = -62.413079  (not concave)
Iteration 6:   log pseudolikelihood = -62.412389  (not concave)
Iteration 7:   log pseudolikelihood = -62.411835  (not concave)
Iteration 8:   log pseudolikelihood = -62.411389  (not concave)
Iteration 9:   log pseudolikelihood = -62.411027  (not concave)
Iteration 10:  log pseudolikelihood = -62.410734  (not concave)
Iteration 11:  log pseudolikelihood = -62.410496  (not concave)
Iteration 12:  log pseudolikelihood = -62.410303  (not concave)
Iteration 13:  log pseudolikelihood = -62.410146  (not concave)
Iteration 14:  log pseudolikelihood = -62.410019  (not concave)
Iteration 15:  log pseudolikelihood = -62.409916  (not concave)
Iteration 16:  log pseudolikelihood = -62.409832  (not concave)
Iteration 17:  log pseudolikelihood = -62.409764  (not concave)
Iteration 18:  log pseudolikelihood = -62.409708  (not concave)
Iteration 19:  log pseudolikelihood = -62.409663  (not concave)
Iteration 20:  log pseudolikelihood = -62.409627  (not concave)
Iteration 21:  log pseudolikelihood = -62.409597  (not concave)
Iteration 22:  log pseudolikelihood = -62.409573  (not concave)
Iteration 23:  log pseudolikelihood = -62.409553  (not concave)
Iteration 24:  log pseudolikelihood = -62.409537  (not concave)
Iteration 25:  log pseudolikelihood = -62.409524  (not concave)
Iteration 26:  log pseudolikelihood = -62.409513  (not concave)
Iteration 27:  log pseudolikelihood = -62.409505  (not concave)
Iteration 28:  log pseudolikelihood = -62.409498  (not concave)
Iteration 29:  log pseudolikelihood = -62.409492  (not concave)
Iteration 30:  log pseudolikelihood = -62.409487  (not concave)
Iteration 31:  log pseudolikelihood = -62.409484  (not concave)
Iteration 32:  log pseudolikelihood =  -62.40948  (not concave)
Iteration 33:  log pseudolikelihood = -62.409468  (not concave)
Iteration 34:  log pseudolikelihood = -62.409468  (not concave)
Iteration 35:  log pseudolikelihood = -62.409467  (not concave)
Iteration 36:  log pseudolikelihood = -62.409467  (not concave)
Iteration 37:  log pseudolikelihood = -62.409467  (not concave)
Iteration 38:  log pseudolikelihood = -62.409467  (not concave)
Iteration 39:  log pseudolikelihood = -62.409467  (not concave)
Iteration 40:  log pseudolikelihood = -62.409467  (not concave)
Iteration 41:  log pseudolikelihood = -62.409467  (not concave)
Iteration 42:  log pseudolikelihood = -62.409467  (not concave)
Iteration 43:  log pseudolikelihood = -62.409467  (not concave)
Iteration 44:  log pseudolikelihood = -62.409467  (not concave)
Iteration 45:  log pseudolikelihood = -62.409467  (not concave)
Iteration 46:  log pseudolikelihood = -62.409467  (not concave)
Iteration 47:  log pseudolikelihood = -62.409467  (not concave)
Iteration 48:  log pseudolikelihood = -62.409467  (not concave)
Iteration 49:  log pseudolikelihood = -62.409467  (not concave)
Iteration 50:  log pseudolikelihood = -62.409467  (not concave)
Iteration 51:  log pseudolikelihood = -62.409467  (not concave)
Iteration 52:  log pseudolikelihood = -62.409467  (not concave)
Iteration 53:  log pseudolikelihood = -62.409467  (not concave)
Iteration 54:  log pseudolikelihood = -62.409467  (not concave)
Iteration 55:  log pseudolikelihood = -62.409467  (not concave)
Iteration 56:  log pseudolikelihood = -62.409467  (not concave)
Iteration 57:  log pseudolikelihood = -62.409467  (not concave)
Iteration 58:  log pseudolikelihood = -62.409467  (not concave)
Iteration 59:  log pseudolikelihood = -62.409467  (not concave)
Iteration 60:  log pseudolikelihood = -62.409467  (not concave)
Iteration 61:  log pseudolikelihood = -62.409467  (not concave)
Iteration 62:  log pseudolikelihood = -62.409467  (not concave)
Iteration 63:  log pseudolikelihood = -62.409467  (not concave)
Iteration 64:  log pseudolikelihood = -62.409467  (not concave)
Iteration 65:  log pseudolikelihood = -62.409467  (not concave)
Iteration 66:  log pseudolikelihood = -62.409467  (not concave)
Iteration 67:  log pseudolikelihood = -62.409467  (not concave)
Iteration 68:  log pseudolikelihood = -62.409467  (not concave)
Iteration 69:  log pseudolikelihood = -62.409467  (not concave)
Iteration 70:  log pseudolikelihood = -62.409467  (not concave)
Iteration 71:  log pseudolikelihood = -62.409467  (not concave)
Iteration 72:  log pseudolikelihood = -62.409467  (not concave)
Iteration 73:  log pseudolikelihood = -62.409467  (not concave)
Iteration 74:  log pseudolikelihood = -62.409467  (not concave)
Iteration 75:  log pseudolikelihood = -62.409467  (not concave)
Iteration 76:  log pseudolikelihood = -62.409467  (not concave)
Iteration 77:  log pseudolikelihood = -62.409467  (not concave)
Iteration 78:  log pseudolikelihood = -62.409467  (not concave)
Iteration 79:  log pseudolikelihood = -62.409467  (not concave)
Iteration 80:  log pseudolikelihood = -62.409467  (not concave)
Iteration 81:  log pseudolikelihood = -62.409467  (not concave)
Iteration 82:  log pseudolikelihood = -62.409467  (not concave)
Iteration 83:  log pseudolikelihood = -62.409467  (not concave)
Iteration 84:  log pseudolikelihood = -62.409467  (not concave)
Iteration 85:  log pseudolikelihood = -62.409467  (not concave)
Iteration 86:  log pseudolikelihood = -62.409467  (not concave)
Iteration 87:  log pseudolikelihood = -62.409467  (not concave)
Iteration 88:  log pseudolikelihood = -62.409467  (not concave)
Iteration 89:  log pseudolikelihood = -62.409467  (not concave)
Iteration 90:  log pseudolikelihood = -62.409467  (not concave)
Iteration 91:  log pseudolikelihood = -62.409467  (not concave)
Iteration 92:  log pseudolikelihood = -62.409467  (not concave)
Iteration 93:  log pseudolikelihood = -62.409467  (not concave)
Iteration 94:  log pseudolikelihood = -62.409467  (not concave)
Iteration 95:  log pseudolikelihood = -62.409467  (not concave)
Iteration 96:  log pseudolikelihood = -62.409467  (not concave)
Iteration 97:  log pseudolikelihood = -62.409467  (not concave)
Iteration 98:  log pseudolikelihood = -62.409467  (not concave)
Iteration 99:  log pseudolikelihood = -62.409467  (not concave)
Iteration 100: log pseudolikelihood = -62.409467  (not concave)
Iteration 101: log pseudolikelihood = -62.409467  (not concave)
Iteration 102: log pseudolikelihood = -62.409467  (not concave)
Iteration 103: log pseudolikelihood = -62.409467  (not concave)
Iteration 104: log pseudolikelihood = -62.409467  (not concave)
Iteration 105: log pseudolikelihood = -62.409467  (not concave)
Iteration 106: log pseudolikelihood = -62.409467  (not concave)
Iteration 107: log pseudolikelihood = -62.409467  (not concave)
Iteration 108: log pseudolikelihood = -62.409467  (not concave)
Iteration 109: log pseudolikelihood = -62.409467  (not concave)
Iteration 110: log pseudolikelihood = -62.409467  (not concave)
Iteration 111: log pseudolikelihood = -62.409467  (not concave)
Iteration 112: log pseudolikelihood = -62.409467  (not concave)
Iteration 113: log pseudolikelihood = -62.409467  (not concave)
Iteration 114: log pseudolikelihood = -62.409467  (not concave)
Iteration 115: log pseudolikelihood = -62.409467  (not concave)
Iteration 116: log pseudolikelihood = -62.409467  (not concave)
Iteration 117: log pseudolikelihood = -62.409467  (not concave)
Iteration 118: log pseudolikelihood = -62.409467  (not concave)
Iteration 119: log pseudolikelihood = -62.409467  (not concave)
Iteration 120: log pseudolikelihood = -62.409467  (not concave)
Iteration 121: log pseudolikelihood = -62.409467  (not concave)
Iteration 122: log pseudolikelihood = -62.409467  (not concave)
Iteration 123: log pseudolikelihood = -62.409467  (not concave)
Iteration 124: log pseudolikelihood = -62.409467  (not concave)
Iteration 125: log pseudolikelihood = -62.409467  (not concave)
Iteration 126: log pseudolikelihood = -62.409467  (not concave)
Iteration 127: log pseudolikelihood = -62.409467  (not concave)
Iteration 128: log pseudolikelihood = -62.409467  (not concave)
Iteration 129: log pseudolikelihood = -62.409467  (not concave)
Iteration 130: log pseudolikelihood = -62.409467  (not concave)
Iteration 131: log pseudolikelihood = -62.409467  (not concave)
Iteration 132: log pseudolikelihood = -62.409467  (not concave)
Iteration 133: log pseudolikelihood = -62.409467  (not concave)
Iteration 134: log pseudolikelihood = -62.409467  (not concave)
Iteration 135: log pseudolikelihood = -62.409467  (not concave)
Iteration 136: log pseudolikelihood = -62.409467  (not concave)
Iteration 137: log pseudolikelihood = -62.409467  (not concave)
Iteration 138: log pseudolikelihood = -62.409467  (not concave)
Iteration 139: log pseudolikelihood = -62.409467  (not concave)
Iteration 140: log pseudolikelihood = -62.409467  (not concave)
Iteration 141: log pseudolikelihood = -62.409467  (not concave)
Iteration 142: log pseudolikelihood = -62.409467  (not concave)
Iteration 143: log pseudolikelihood = -62.409467  (not concave)
Iteration 144: log pseudolikelihood = -62.409467  (not concave)
Iteration 145: log pseudolikelihood = -62.409467  (not concave)
Iteration 146: log pseudolikelihood = -62.409467  (not concave)
Iteration 147: log pseudolikelihood = -62.409467  (not concave)
Iteration 148: log pseudolikelihood = -62.409467  (not concave)
Iteration 149: log pseudolikelihood = -62.409467  (not concave)
Iteration 150: log pseudolikelihood = -62.409467  (not concave)
Iteration 151: log pseudolikelihood = -62.409467  (not concave)
Iteration 152: log pseudolikelihood = -62.409467  (not concave)
Iteration 153: log pseudolikelihood = -62.409467  (not concave)
Iteration 154: log pseudolikelihood = -62.409467  (not concave)
Iteration 155: log pseudolikelihood = -62.409467  (not concave)
Iteration 156: log pseudolikelihood = -62.409467  (not concave)
Iteration 157: log pseudolikelihood = -62.409467  (not concave)
Iteration 158: log pseudolikelihood = -62.409467  (not concave)
Iteration 159: log pseudolikelihood = -62.409467  (not concave)
Iteration 160: log pseudolikelihood = -62.409467  (not concave)
Iteration 161: log pseudolikelihood = -62.409467  (not concave)
Iteration 162: log pseudolikelihood = -62.409467  (not concave)
Iteration 163: log pseudolikelihood = -62.409467  (not concave)
Iteration 164: log pseudolikelihood = -62.409467  (not concave)
Iteration 165: log pseudolikelihood = -62.409467  (not concave)
Iteration 166: log pseudolikelihood = -62.409467  (not concave)
Iteration 167: log pseudolikelihood = -62.409467  (not concave)
Iteration 168: log pseudolikelihood = -62.409467  (not concave)
Iteration 169: log pseudolikelihood = -62.409467  (not concave)
Iteration 170: log pseudolikelihood = -62.409467  (not concave)
Iteration 171: log pseudolikelihood = -62.409467  (not concave)
Iteration 172: log pseudolikelihood = -62.409467  (not concave)
Iteration 173: log pseudolikelihood = -62.409467  (not concave)
Iteration 174: log pseudolikelihood = -62.409467  (not concave)
Iteration 175: log pseudolikelihood = -62.409467  (not concave)
Iteration 176: log pseudolikelihood = -62.409467  (not concave)
Iteration 177: log pseudolikelihood = -62.409467  (not concave)
Iteration 178: log pseudolikelihood = -62.409467  (not concave)
Iteration 179: log pseudolikelihood = -62.409467  (not concave)
Iteration 180: log pseudolikelihood = -62.409467  (not concave)
Iteration 181: log pseudolikelihood = -62.409467  (not concave)
Iteration 182: log pseudolikelihood = -62.409467  (not concave)
Iteration 183: log pseudolikelihood = -62.409467  (not concave)
Iteration 184: log pseudolikelihood = -62.409467  (not concave)
Iteration 185: log pseudolikelihood = -62.409467  (not concave)
Iteration 186: log pseudolikelihood = -62.409467  (not concave)
Iteration 187: log pseudolikelihood = -62.409467  (not concave)
Iteration 188: log pseudolikelihood = -62.409467  (not concave)
Iteration 189: log pseudolikelihood = -62.409467  (not concave)
Iteration 190: log pseudolikelihood = -62.409467  (not concave)
Iteration 191: log pseudolikelihood = -62.409467  (not concave)
Iteration 192: log pseudolikelihood = -62.409467  (not concave)
Iteration 193: log pseudolikelihood = -62.409467  (not concave)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. reg demo_pref i.constituency if ohangwena==1, vce(robust)

Linear regression                               Number of obs     =        114
                                                F(11, 102)        =       1.99
                                                Prob > F          =     0.0364
                                                R-squared         =     0.1647
                                                Root MSE          =     .42993

-------------------------------------------------------------------------------
              |               Robust
    demo_pref |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 constituency |
      Endola  |  -.1416667   .1727748    -0.82   0.414    -.4843647    .2010314
      Engela  |  -.1416667   .1727748    -0.82   0.414    -.4843647    .2010314
      Epembe  |  -.0178571   .1866307    -0.10   0.924    -.3880382    .3523239
   Ohangwena  |      -.625   .2036546    -3.07   0.003    -1.028948   -.2210521
      Okongo  |      -.375   .2240687    -1.67   0.097    -.8194393    .0694393
    Omulonga  |       -.25   .2191436    -1.14   0.257    -.6846702    .1846702
Omundaungilo  |      -.125   .2036546    -0.61   0.541    -.5289479    .2789479
     Ondombe  |  -.3035714   .2331988    -1.30   0.196    -.7661202    .1589773
     Ongenga  |  -2.76e-16   .1748161    -0.00   1.000    -.3467469    .3467469
   Oshikango  |   .0583333   .1411258     0.41   0.680    -.2215891    .3382557
   Oshikunde  |  -.0178571   .1866307    -0.10   0.924    -.3880382    .3523239
              |
        _cons |       .875   .1236136     7.08   0.000     .6298129    1.120187
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. reg demo_pref i.constituency if ohangwena==1, vce(hc3)

Linear regression                               Number of obs     =        114
                                                F(11, 102)        =       1.75
                                                Prob > F          =     0.0725
                                                R-squared         =     0.1647
                                                Root MSE          =     .42993

-------------------------------------------------------------------------------
              |             Robust HC3
    demo_pref |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 constituency |
      Endola  |  -.1416667   .1811715    -0.78   0.436    -.5010196    .2176862
      Engela  |  -.1416667   .1811715    -0.78   0.436    -.5010196    .2176862
      Epembe  |  -.0178571   .2041241    -0.09   0.930    -.4227364    .3870221
   Ohangwena  |      -.625   .2201576    -2.84   0.005    -1.061682   -.1883184
      Okongo  |      -.375   .2422261    -1.55   0.125    -.8554543    .1054543
    Omulonga  |       -.25   .2369018    -1.06   0.294    -.7198935    .2198935
Omundaungilo  |      -.125   .2201576    -0.57   0.571    -.5616816    .3116816
     Ondombe  |  -.3035714   .2558832    -1.19   0.238    -.8111145    .2039716
     Ongenga  |  -2.76e-16   .1889822    -0.00   1.000    -.3748454    .3748454
   Oshikango  |   .0583333   .1503963     0.39   0.699     -.239977    .3566437
   Oshikunde  |  -.0178571   .2041241    -0.09   0.930    -.4227364    .3870221
              |
        _cons |       .875   .1336306     6.55   0.000     .6099443    1.140056
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. * Load cleaned dataset (long-format)
. clear

. use "$working_ANALYSIS/processed/analysis_long.dta"

. 
. *set panel
. xtset id decision
       panel variable:  id (strongly balanced)
        time variable:  decision, 1 to 6, but with gaps
                delta:  1 unit

. 
. 
. 
end of do-file

. tab decision

   decision |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         64       33.33       33.33
          5 |         64       33.33       66.67
          6 |         64       33.33      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtprobit dem i.decision##i.bonus_order , vce(robust)

Fitting comparison model:

Iteration 0:   log pseudolikelihood = -125.38709  
Iteration 1:   log pseudolikelihood = -124.86238  
Iteration 2:   log pseudolikelihood = -124.86229  
Iteration 3:   log pseudolikelihood = -124.86229  

Fitting full model:

rho =  0.0     log pseudolikelihood = -124.86229
rho =  0.1     log pseudolikelihood = -120.45752
rho =  0.2     log pseudolikelihood = -117.09214
rho =  0.3     log pseudolikelihood = -114.52546
rho =  0.4     log pseudolikelihood = -112.63314
rho =  0.5     log pseudolikelihood = -111.37401
rho =  0.6     log pseudolikelihood = -110.79176
rho =  0.7     log pseudolikelihood = -111.07693

Iteration 0:   log pseudolikelihood = -110.79408  
Iteration 1:   log pseudolikelihood = -110.07427  
Iteration 2:   log pseudolikelihood = -110.05597  
Iteration 3:   log pseudolikelihood = -110.05597  

Calculating robust standard errors:

Random-effects probit regression                Number of obs     =        192
Group variable: id                              Number of groups  =         64

Random effects u_i ~ Gaussian                   Obs per group:
                                                              min =          3
                                                              avg =        3.0
                                                              max =          3

Integration method: mvaghermite                 Integration pts.  =         12

                                                Wald chi2(5)      =       1.13
Log pseudolikelihood  = -110.05597              Prob > chi2       =     0.9513

                                            (Std. Err. adjusted for 64 clusters in id)
--------------------------------------------------------------------------------------
                     |               Robust
                 dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            decision |
                  5  |  -.1402093   .4542806    -0.31   0.758    -1.030583    .7501643
                  6  |  -.2874637   .4675606    -0.61   0.539    -1.203866    .6289382
                     |
         bonus_order |
        Small first  |  -.4629129   .5452854    -0.85   0.396    -1.531653    .6058268
                     |
decision#bonus_order |
      5#Small first  |   .2726652   .6045426     0.45   0.652    -.9122166    1.457547
      6#Small first  |   .5582107   .6033837     0.93   0.355    -.6243997    1.740821
                     |
               _cons |   .8450408     .40926     2.06   0.039     .0429059    1.647176
---------------------+----------------------------------------------------------------
            /lnsig2u |   .5883809   .4509379                     -.2954411    1.472203
---------------------+----------------------------------------------------------------
             sigma_u |   1.342039   .3025882                      .8626721     2.08778
                 rho |   .6429936   .1035141                      .4266723     .813392
--------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        192
Model VCE    : Robust

Expression   : Pr(dem=1), predict(pr)
dy/dx w.r.t. : 5.decision 6.decision 1.bonus_order

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    decision |
          5  |   .0021052   .0665068     0.03   0.975    -.1282458    .1324562
          6  |   .0032599   .0657928     0.05   0.960    -.1256917    .1322115
             |
 bonus_order |
Small first  |  -.0413475   .0945541    -0.44   0.662    -.2266701    .1439751
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.decision##i.bonus_order , vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                            (Std. Err. adjusted for 64 clusters in id)
--------------------------------------------------------------------------------------
                     |               Robust
                 dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
            decision |
                  5  |  -.0333333   .1019469    -0.33   0.744    -.2331457     .166479
                  6  |  -.0666667   .1069409    -0.62   0.533     -.276267    .1429337
                     |
         bonus_order |
        Small first  |  -.1117647   .1213831    -0.92   0.357    -.3496711    .1261417
                     |
decision#bonus_order |
      5#Small first  |   .0627451   .1359717     0.46   0.644    -.2037545    .3292446
      6#Small first  |   .1254902   .1361963     0.92   0.357    -.1414497    .3924301
                     |
               _cons |         .7   .0854533     8.19   0.000     .5325146    .8674854
---------------------+----------------------------------------------------------------
             sigma_u |  .32087733
             sigma_e |  .36523497
                 rho |  .43561839   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------

. 
. 
end of do-file

. tab bonus_first

bonus_first |      Freq.     Percent        Cum.
------------+-----------------------------------
  3rd round |         64       50.00       50.00
  2nd round |         64       50.00      100.00
------------+-----------------------------------
      Total |        128      100.00

. tab bonus_order

bonus_order |      Freq.     Percent        Cum.
------------+-----------------------------------
Large first |         90       46.88       46.88
Small first |        102       53.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab bonus_order, nolab

bonus_order |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         90       46.88       46.88
          1 |        102       53.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. tab bonus_first, nolab

bonus_first |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         64       50.00       50.00
          1 |         64       50.00      100.00
------------+-----------------------------------
      Total |        128      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. gen round= 1 if bonus_first==:
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. gen round= 1 if bonus_first==.
(128 missing values generated)

. replace round = 2 if bonus_first==1
(64 real changes made)

. replace round = 3 if bonus_first==0
(64 real changes made)

. 
end of do-file

. tab round

      round |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         64       33.33       33.33
          2 |         64       33.33       66.67
          3 |         64       33.33      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round##i.order_1 , vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
           3  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
              |
    1.order_1 |   .1117647   .1213831     0.92   0.357    -.1261417    .3496711
              |
round#order_1 |
         2 1  |  -.0960784    .139755    -0.69   0.492    -.3699933    .1778364
         3 1  |  -.0921569   .1323112    -0.70   0.486    -.3514821    .1671684
              |
        _cons |   .5882353   .0862066     6.82   0.000     .4192734    .7571971
--------------+----------------------------------------------------------------
      sigma_u |  .32087733
      sigma_e |  .36523497
          rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0007                                         max =          3

                                                Wald chi2(2)      =       0.28
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8689

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.015625   .0689801    -0.23   0.821    -.1508235    .1195735
          3  |    .015625   .0652455     0.24   0.811    -.1122538    .1435038
             |
       _cons |    .640625   .0607703    10.54   0.000     .5215174    .7597326
-------------+----------------------------------------------------------------
     sigma_u |  .31888322
     sigma_e |  .36335536
         rho |   .4350902   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round##i.order_1 ,, vce(robust)
invalid 'vce' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round##i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
           3  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
              |
    1.order_1 |   .1117647   .1213831     0.92   0.357    -.1261417    .3496711
              |
round#order_1 |
         2 1  |  -.0960784    .139755    -0.69   0.492    -.3699933    .1778364
         3 1  |  -.0921569   .1323112    -0.70   0.486    -.3514821    .1671684
              |
        _cons |   .5882353   .0862066     6.82   0.000     .4192734    .7571971
--------------+----------------------------------------------------------------
      sigma_u |  .32087733
      sigma_e |  .36523497
          rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round##i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
           3  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
              |
    1.order_1 |   .1117647   .1213831     0.92   0.357    -.1261417    .3496711
              |
round#order_1 |
         2 1  |  -.0960784    .139755    -0.69   0.492    -.3699933    .1778364
         3 1  |  -.0921569   .1323112    -0.70   0.486    -.3514821    .1671684
              |
        _cons |   .5882353   .0862066     6.82   0.000     .4192734    .7571971
--------------+----------------------------------------------------------------
      sigma_u |  .32087733
      sigma_e |  .36523497
          rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo reg_dem1: xtreg fake i.round##i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0426                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0250                                         max =          3

                                                Wald chi2(5)      =       7.84
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1656

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
         fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
           3  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
              |
    1.order_1 |  -.1607843   .1019221    -1.58   0.115    -.3605479    .0389792
              |
round#order_1 |
         2 1  |   .1411765   .1224537     1.15   0.249    -.0988283    .3811812
         3 1  |   .1039216   .1294205     0.80   0.422    -.1497379     .357581
              |
        _cons |   .2941176   .0798118     3.69   0.000     .1376894    .4505459
--------------+----------------------------------------------------------------
      sigma_u |  .28667799
      sigma_e |  .35148251
          rho |  .39948757   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. eststo reg_dem1: xtreg dic i.round##i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0582                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0392                                         max =          3

                                                Wald chi2(4)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |  -.0882353   .0653694    -1.35   0.177     -.216357    .0398864
           3  |  -.0882353   .0653694    -1.35   0.177     -.216357    .0398864
              |
    1.order_1 |   .0490196   .0895238     0.55   0.584    -.1264438     .224483
              |
round#order_1 |
         2 1  |   -.045098   .1030025    -0.44   0.662    -.2469793    .1567832
         3 1  |  -.0117647   .0985945    -0.12   0.905    -.2050065     .181477
              |
        _cons |   .1176471   .0564355     2.08   0.037     .0070356    .2282586
--------------+----------------------------------------------------------------
      sigma_u |  .07926502
      sigma_e |  .24650199
          rho |  .09371069   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round#i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
round#order_1 |
         1 1  |   .1117647   .1213831     0.92   0.357    -.1261417    .3496711
         2 0  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
         2 1  |    .045098   .1245254     0.36   0.717    -.1989673    .2891633
         3 0  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
         3 1  |   .0784314   .1231213     0.64   0.524    -.1628819    .3197446
              |
        _cons |   .5882353   .0862066     6.82   0.000     .4192734    .7571971
--------------+----------------------------------------------------------------
      sigma_u |  .32087733
      sigma_e |  .36523497
          rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
          3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
             |
   1.order_1 |   .0490196   .0954992     0.51   0.608    -.1381554    .2361946
       _cons |   .6176471   .0797823     7.74   0.000     .4612766    .7740176
-------------+----------------------------------------------------------------
     sigma_u |  .32158786
     sigma_e |  .36335536
         rho |   .4392464   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_dem1: xtreg dem i.round i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
          3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
             |
   1.order_1 |   .0490196   .0954992     0.51   0.608    -.1381554    .2361946
       _cons |   .6176471   .0797823     7.74   0.000     .4612766    .7740176
-------------+----------------------------------------------------------------
     sigma_u |  .32158786
     sigma_e |  .36335536
         rho |   .4392464   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo reg_dem1: xtreg fake i.round i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
          3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
             |
   1.order_1 |   -.079085   .0869401    -0.91   0.363    -.2494845    .0913145
       _cons |   .2558211   .0727401     3.52   0.000      .113253    .3983892
-------------+----------------------------------------------------------------
     sigma_u |  .28703053
     sigma_e |  .35061831
         rho |  .40125966   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. eststo reg_dem1: xtreg dic i.round i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
          3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
             |
   1.order_1 |   .0300654   .0411208     0.73   0.465      -.05053    .1106607
       _cons |   .1265319   .0449058     2.82   0.005     .0385182    .2145455
-------------+----------------------------------------------------------------
     sigma_u |  .08098331
     sigma_e |  .24482069
         rho |  .09862773   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0007                                         max =          3

                                                Wald chi2(2)      =       0.28
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8689

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.015625   .0689801    -0.23   0.821    -.1508235    .1195735
          3  |    .015625   .0652455     0.24   0.811    -.1122538    .1435038
             |
       _cons |    .640625   .0607703    10.54   0.000     .5215174    .7597326
-------------+----------------------------------------------------------------
     sigma_u |  .31888322
     sigma_e |  .36335536
         rho |   .4350902   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time2: xtreg fake i.round, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0130                                         max =          3

                                                Wald chi2(2)      =       4.18
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1237

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |       .125   .0613156     2.04   0.041     .0048236    .2451764
          3  |    .078125   .0645212     1.21   0.226    -.0483341    .2045841
             |
       _cons |     .21875   .0523582     4.18   0.000     .1161299    .3213701
-------------+----------------------------------------------------------------
     sigma_u |   .2863749
     sigma_e |  .35061831
         rho |  .40016136   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time3: xtreg dic i.round, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0345                                         max =          3

                                                Wald chi2(2)      =       4.70
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0956

                                    (Std. Err. adjusted for 64 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   -.109375   .0506473    -2.16   0.031    -.2086419   -.0101081
          3  |    -.09375   .0486356    -1.93   0.054     -.189074     .001574
             |
       _cons |    .140625   .0440289     3.19   0.001     .0543299    .2269201
-------------+----------------------------------------------------------------
     sigma_u |  .07978559
     sigma_e |  .24482069
         rho |  .09600998   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round##i.order1, vce(robust)
variable order1 not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round##i.order_1, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                     (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------
              |               Robust
          dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        round |
           2  |   .0294118   .0899728     0.33   0.744    -.1469318    .2057553
           3  |   .0588235   .0843391     0.70   0.486    -.1064781    .2241251
              |
    1.order_1 |   .1117647   .1213831     0.92   0.357    -.1261417    .3496711
              |
round#order_1 |
         2 1  |  -.0960784    .139755    -0.69   0.492    -.3699933    .1778364
         3 1  |  -.0921569   .1323112    -0.70   0.486    -.3514821    .1671684
              |
        _cons |   .5882353   .0862066     6.82   0.000     .4192734    .7571971
--------------+----------------------------------------------------------------
      sigma_u |  .32087733
      sigma_e |  .36523497
          rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------

. 
end of do-file

. tab bonus_order

bonus_order |      Freq.     Percent        Cum.
------------+-----------------------------------
Large first |         90       46.88       46.88
Small first |        102       53.13      100.00
------------+-----------------------------------
      Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round##i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |  -.0666667   .1069409    -0.62   0.533     -.276267    .1429337
               3  |  -.0333333   .1019469    -0.33   0.744    -.2331457     .166479
                  |
      bonus_order |
     Small first  |  -.1117647   .1213831    -0.92   0.357    -.3496711    .1261417
                  |
round#bonus_order |
   2#Small first  |   .0960784    .139755     0.69   0.492    -.1778364    .3699933
   3#Small first  |   .0921569   .1323112     0.70   0.486    -.1671684    .3514821
                  |
            _cons |         .7   .0854533     8.19   0.000     .5325146    .8674854
------------------+----------------------------------------------------------------
          sigma_u |  .32087733
          sigma_e |  .36523497
              rho |  .43561839   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. lab def order1 0 "Base-Large-Small" 1 "Base-Small-Large", replace

. lab val bonus_order order1

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round##i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0075                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0054                                         max =          3

                                                Wald chi2(5)      =       1.21
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9438

                                           (Std. Err. adjusted for 64 clusters in id)
-------------------------------------------------------------------------------------
                    |               Robust
                dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
              round |
                 2  |  -.0666667   .1069409    -0.62   0.533     -.276267    .1429337
                 3  |  -.0333333   .1019469    -0.33   0.744    -.2331457     .166479
                    |
        bonus_order |
  Base-Small-Large  |  -.1117647   .1213831    -0.92   0.357    -.3496711    .1261417
                    |
  round#bonus_order |
2#Base-Small-Large  |   .0960784    .139755     0.69   0.492    -.1778364    .3699933
3#Base-Small-Large  |   .0921569   .1323112     0.70   0.486    -.1671684    .3514821
                    |
              _cons |         .7   .0854533     8.19   0.000     .5325146    .8674854
--------------------+----------------------------------------------------------------
            sigma_u |  .32087733
            sigma_e |  .36523497
                rho |  .43561839   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) nolab
option nolab not allowed
r(198);

end of do-file

r(198);

. help reg

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)   coeflegend 

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) 

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. help xtreg

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. lab def order1 0 "Base-Large-Small" 1 "Base-Small-Large", replace

. lab val bonus_order order1

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) 

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    0.28
         Prob > chi2 =    0.8696

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    4.16
         Prob > chi2 =    0.1251

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0968

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".*"

. 
. esttab reg_time1 reg_time3 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", label se(%4.3f)  transform(ln*: exp(@) exp(@)) m
> groups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o Fstat, labels("N" "Cluster" "
> Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @w
> idth}")) nonotes addnotes("Notes: Robust standard errors cin brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(note: file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf not fou
> nd)
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time3 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N 
> N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varla
> bels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01."
> ) replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time3 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N 
> N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varla
> bels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01."
> ) replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    0.28
         Prob > chi2 =    0.8696

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    4.16
         Prob > chi2 =    0.1251

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round

 ( 1)  2.round = 0
 ( 2)  3.round = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0968

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".*"

. 
. esttab reg_time1 reg_time3 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N 
> N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varla
> bels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01."
> ) replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round+3.round=0
+ invalid name
r(198);

end of do-file

r(198);

. help testparm

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round=3.round
=exp not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round==3.round
== invalid name
r(198);

end of do-file

r(198);

. help testparm

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust) coeflegend

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
              dem |      Coef.  Legend
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625  _b[2.round]
               3  |    .015625  _b[3.round]
                  |
      bonus_order |
Base-Small-Large  |  -.0490196  _b[1.bonus_order]
            _cons |   .6666667  _b[_cons]
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. lab def order1 0 "Base-Large-Small" 1 "Base-Small-Large", replace

. lab val bonus_order order1

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.59
         Prob > chi2 =    0.4436

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5688

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. 
. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N 
> N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varla
> bels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01."
> ) replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Rule choices", pattern(1 0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N 
> N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared" "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01)
>  varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 
> 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles("Democratic" "P
> seudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared"
>  "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes a
> ddnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. help xtreg

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)'''")))

added macro:
              e(Fstat) : "0.278'"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles("Democratic" "P
> seudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared"
>  "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes a
> ddnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)'")))
.2780738619021906")))" invalid name
too few quotes
r(132);

end of do-file

r(132);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles("Democratic" "P
> seudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared"
>  "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes a
> ddnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
              e(Fstat) : "0.278"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.59
         Prob > chi2 =    0.4436

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5688

. estadd local Fstat = cond(r(p)<0.01,"`:di %5.3f `=r(F)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(F)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(F)''*",  "`:di %5.3f `=r(F)'''")))

added macro:
              e(Fstat) : ".'"

. 
. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles("Democratic" "P
> seudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o Fstat, labels("N" "Cluster" "Overall R-squared"
>  "F-Test: distance & distance" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes a
> ddnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(3)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.9092

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.015625   .0691633    -0.23   0.821    -.1511826    .1199326
               3  |    .015625   .0654188     0.24   0.811    -.1125934    .1438434
                  |
      bonus_order |
Base-Small-Large  |  -.0490196   .0954992    -0.51   0.608    -.2361946    .1381554
            _cons |   .6666667    .074015     9.01   0.000        .5216    .8117334
------------------+----------------------------------------------------------------
          sigma_u |  .32158786
          sigma_e |  .36335536
              rho |   .4392464   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.28
         Prob > chi2 =    0.5980

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.278"

. eststo reg_time2: xtreg fake i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0319                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0206                                         max =          3

                                                Wald chi2(3)      =       5.38
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1457

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |       .125   .0614785     2.03   0.042     .0045044    .2454956
               3  |    .078125   .0646925     1.21   0.227      -.04867      .20492
                  |
      bonus_order |
Base-Small-Large  |    .079085   .0869401     0.91   0.363    -.0913145    .2494845
            _cons |   .1767361   .0611063     2.89   0.004       .05697    .2965022
------------------+----------------------------------------------------------------
          sigma_u |  .28703053
          sigma_e |  .35061831
              rho |  .40125966   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.59
         Prob > chi2 =    0.4436

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.587"

. eststo reg_time3: xtreg dic i.round i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  = 0.0560                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0378                                         max =          3

                                                Wald chi2(3)      =       4.76
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.1904

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
            round |
               2  |   -.109375   .0507818    -2.15   0.031    -.2089055   -.0098445
               3  |    -.09375   .0487647    -1.92   0.055    -.1893271    .0018271
                  |
      bonus_order |
Base-Small-Large  |  -.0300654   .0411208    -0.73   0.465    -.1106607      .05053
            _cons |   .1565972   .0524687     2.98   0.003     .0537605    .2594339
------------------+----------------------------------------------------------------
          sigma_u |  .08098331
          sigma_e |  .24482069
              rho |  .09862773   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5688

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.325"

. 
. esttab reg_time1 reg_time2 reg_time3 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.round 1.bonus_order _cons) label 
> se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles("Democratic" "P
> seudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster" "Overall R-squ
> ared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @width}")) n
> onotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. tab bonus_order

     bonus_order |      Freq.     Percent        Cum.
-----------------+-----------------------------------
Base-Large-Small |         90       46.88       46.88
Base-Small-Large |        102       53.13      100.00
-----------------+-----------------------------------
           Total |        192      100.00

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.00
         Prob > chi2 =    1.0000

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.000"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd 1.bonus_order _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1
>  0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, label
> s("N" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. *Order 1: Base-Large-Small
. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time2: xtreg fake i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0374                                         max =          3

                                                Wald chi2(2)      =       5.22
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0735

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |         .2   .0894191     2.24   0.025     .0247418    .3752582
          3  |   .1333333   .0936999     1.42   0.155    -.0503151    .3169818
             |
       _cons |   .1333333   .0638457     2.09   0.037      .008198    .2584686
-------------+----------------------------------------------------------------
     sigma_u |  .23812808
     sigma_e |  .35665539
         rho |  .30833333   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.48
         Prob > chi2 =    0.4882

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.480"

. eststo reg_time3: xtreg dic i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0396                                         max =          3

                                                Wald chi2(2)      =       2.82
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.2441

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.1333333   .0801746    -1.66   0.096    -.2904728    .0238061
          3  |        -.1   .0743404    -1.35   0.179    -.2457044    .0457044
             |
       _cons |   .1666667   .0699955     2.38   0.017      .029478    .3038553
-------------+----------------------------------------------------------------
     sigma_u |  .07057509
     sigma_e |  .27473428
         rho |  .06190476   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5725

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.319"

. 
. *Order 2: Base-Small-Large
. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.00
         Prob > chi2 =    1.0000

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.000"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd 1.bonus_order _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1
>  0 0)) mtitles("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, label
> s("N" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_co
> ns "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
coefficient 1.bonus_order not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. *Order 1: Base-Large-Small
. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time2: xtreg fake i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0374                                         max =          3

                                                Wald chi2(2)      =       5.22
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0735

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |         .2   .0894191     2.24   0.025     .0247418    .3752582
          3  |   .1333333   .0936999     1.42   0.155    -.0503151    .3169818
             |
       _cons |   .1333333   .0638457     2.09   0.037      .008198    .2584686
-------------+----------------------------------------------------------------
     sigma_u |  .23812808
     sigma_e |  .35665539
         rho |  .30833333   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.48
         Prob > chi2 =    0.4882

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.480"

. eststo reg_time3: xtreg dic i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0396                                         max =          3

                                                Wald chi2(2)      =       2.82
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.2441

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.1333333   .0801746    -1.66   0.096    -.2904728    .0238061
          3  |        -.1   .0743404    -1.35   0.179    -.2457044    .0457044
             |
       _cons |   .1666667   .0699955     2.38   0.017      .029478    .3038553
-------------+----------------------------------------------------------------
     sigma_u |  .07057509
     sigma_e |  .27473428
         rho |  .06190476   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5725

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.319"

. 
. *Order 2: Base-Small-Large
. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.136"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.00
         Prob > chi2 =    1.0000

. estadd local joint_test = cond(r(p)<0.01,"`:di %5.3f `=r(chi2)''***", ///
> cond(r(p)<0.05,"`:di %5.3f `=r(chi2)''**", ///
> cond(r(p)<0.1,"`:di %5.3f `=r(chi2)''*",  "`:di %5.3f `=r(chi2)''")))

added macro:
         e(joint_test) : "0.000"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hl
> ine @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. *Order 1: Base-Large-Small
. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".7126566591423527"

. eststo reg_time2: xtreg fake i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0374                                         max =          3

                                                Wald chi2(2)      =       5.22
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0735

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |         .2   .0894191     2.24   0.025     .0247418    .3752582
          3  |   .1333333   .0936999     1.42   0.155    -.0503151    .3169818
             |
       _cons |   .1333333   .0638457     2.09   0.037      .008198    .2584686
-------------+----------------------------------------------------------------
     sigma_u |  .23812808
     sigma_e |  .35665539
         rho |  .30833333   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.48
         Prob > chi2 =    0.4882

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".4882050181459829"

. eststo reg_time3: xtreg dic i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0396                                         max =          3

                                                Wald chi2(2)      =       2.82
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.2441

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.1333333   .0801746    -1.66   0.096    -.2904728    .0238061
          3  |        -.1   .0743404    -1.35   0.179    -.2457044    .0457044
             |
       _cons |   .1666667   .0699955     2.38   0.017      .029478    .3038553
-------------+----------------------------------------------------------------
     sigma_u |  .07057509
     sigma_e |  .27473428
         rho |  .06190476   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5725

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".5724981967217945"

. 
. *Order 2: Base-Small-Large
. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".7118024555663746"

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".711802455566374"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : "."

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hl
> ine @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hl
> ine @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{bre
> ak}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{bre
> ak}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".7126566591423521"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)"))  sfmt(%9.0fc) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @widt
> h}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)"))  sfmt(%9.0fc) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @widt
> h}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N, fmt(%18.0g) labels("N"), N_clust, fmt(%18.0
> g) labels("Cluster"), r2_o, fmt(%9.2f) labels("R-squared"), joint_test, fmt(%9.2f) labels("Test: Round 2 = Round 3 (chi2)")) star(* 0.10 ** 0.05 *** 0.
> 01) varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p
>  < 0.01.") replace 
invalid 'N_clust' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N, fmt(%18.0g) labels("N") N_clust, fmt(%18.0g
> ) labels("Cluster") r2_o, fmt(%9.2f) labels("R-squared") joint_test, fmt(%9.2f) labels("Test: Round 2 = Round 3 (chi2)")) star(* 0.10 ** 0.05 *** 0.01)
>  varlabels(,elist(weight:_cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 
> 0.01.") replace 
invalid 'fmt' 
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%18.0g %18.0g %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{b
> reak}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("N" "Cluster
> " "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%8.0g %8.0g %8.2g %8.2g))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{bre
> ak}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N_clust r2_o joint_test, labels("Cluster" "Ove
> rall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{hline @w
> idth}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) scalars
> (N) mtitles("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N_clust r2_o joint_test, labels("Cl
> uster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{brea
> k}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, labels("Observation
> s" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" fmt(%4.0f %4.0f %4.2f %4.2f))) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:
> _cons "{break}{hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, fmt(0 0 2 2) labels
> ("Observations" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{
> hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, fmt(0 0 2 2) labels
> ("Observations" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{
> hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =cond(r(p)<0.01,"`:di %5.3f `=r(p)''***")
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =cond(r(p)<0.01,"`:di %5.3f `=r(p)'")
.7126566591423522")" invalid name
too few quotes
r(132);

end of do-file

r(132);

. help estadd

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =r(p)"`:di %5.3f `=r(p)'")
invalid subcommand: unmatched close parenthesis or bracket

r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =r(p)"`:di %5.3f `=r(p)'"
.7126566591423522"" invalid name
too few quotes
r(132);

end of do-file

r(132);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =di %5.3f r(p)
di ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd local joint_test =display %5.3f r(p)
display not found
r(111);

end of do-file

r(111);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. 
. *Order 1: Base-Large-Small
. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .71265666

. eststo reg_time2: xtreg fake i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0374                                         max =          3

                                                Wald chi2(2)      =       5.22
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0735

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |         .2   .0894191     2.24   0.025     .0247418    .3752582
          3  |   .1333333   .0936999     1.42   0.155    -.0503151    .3169818
             |
       _cons |   .1333333   .0638457     2.09   0.037      .008198    .2584686
-------------+----------------------------------------------------------------
     sigma_u |  .23812808
     sigma_e |  .35665539
         rho |  .30833333   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.48
         Prob > chi2 =    0.4882

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".4882050181459828"

. eststo reg_time3: xtreg dic i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0396                                         max =          3

                                                Wald chi2(2)      =       2.82
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.2441

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.1333333   .0801746    -1.66   0.096    -.2904728    .0238061
          3  |        -.1   .0743404    -1.35   0.179    -.2457044    .0457044
             |
       _cons |   .1666667   .0699955     2.38   0.017      .029478    .3038553
-------------+----------------------------------------------------------------
     sigma_u |  .07057509
     sigma_e |  .27473428
         rho |  .06190476   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5725

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".5724981967217945"

. 
. *Order 2: Base-Small-Large
. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".7118024555663746"

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : ".711802455566374"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. estadd local joint_test =r(p)

added macro:
         e(joint_test) : "."

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, fmt(0 0 3 3) labels
> ("Observations" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{
> hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. *Order 1: Base-Large-Small
. eststo reg_time1: xtreg dem i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(2)      =       0.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.8227

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0666667   .1077112    -0.62   0.536    -.2777768    .1444435
          3  |  -.0333333   .1026813    -0.32   0.745    -.2345849    .1679183
             |
       _cons |         .7   .0860689     8.13   0.000     .5313081    .8686919
-------------+----------------------------------------------------------------
     sigma_u |  .28432888
     sigma_e |  .38506605
         rho |  .35284281   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7127

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .71265666

. eststo reg_time2: xtreg fake i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0374                                         max =          3

                                                Wald chi2(2)      =       5.22
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.0735

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |         .2   .0894191     2.24   0.025     .0247418    .3752582
          3  |   .1333333   .0936999     1.42   0.155    -.0503151    .3169818
             |
       _cons |   .1333333   .0638457     2.09   0.037      .008198    .2584686
-------------+----------------------------------------------------------------
     sigma_u |  .23812808
     sigma_e |  .35665539
         rho |  .30833333   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.48
         Prob > chi2 =    0.4882

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .48820502

. eststo reg_time3: xtreg dic i.round if bonus_order==0, vce(robust)

Random-effects GLS regression                   Number of obs     =         90
Group variable: id                              Number of groups  =         30

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0396                                         max =          3

                                                Wald chi2(2)      =       2.82
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.2441

                                    (Std. Err. adjusted for 30 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.1333333   .0801746    -1.66   0.096    -.2904728    .0238061
          3  |        -.1   .0743404    -1.35   0.179    -.2457044    .0457044
             |
       _cons |   .1666667   .0699955     2.38   0.017      .029478    .3038553
-------------+----------------------------------------------------------------
     sigma_u |  .07057509
     sigma_e |  .27473428
         rho |  .06190476   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.32
         Prob > chi2 =    0.5725

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .5724982

. 
. *Order 2: Base-Small-Large
. eststo reg_time4: xtreg dem i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0024                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
          3  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
             |
       _cons |   .5882353   .0865339     6.80   0.000      .418632    .7578386
-------------+----------------------------------------------------------------
     sigma_u |  .34985779
     sigma_e |  .34687297
         rho |  .50428397   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .71180246

. eststo reg_time5: xtreg fake i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(2)      =       0.49
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.7814

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
        fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |   .0588235   .0846593     0.69   0.487    -.1071056    .2247527
          3  |   .0294118   .0903144     0.33   0.745    -.1476013    .2064248
             |
       _cons |   .2941176   .0801148     3.67   0.000     .1370955    .4511398
-------------+----------------------------------------------------------------
     sigma_u |  .32338083
     sigma_e |  .34687297
         rho |  .46499339   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7118

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .71180246

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .

. 
. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, fmt(0 0 3 3) labels
> ("Observations" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{
> hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
(output written to C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf)

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. eststo reg_time6: xtreg dic i.round if bonus_order==1, vce(robust)

Random-effects GLS regression                   Number of obs     =        102
Group variable: id                              Number of groups  =         34

R-sq:                                           Obs per group:
     within  = 0.0000                                         min =          3
     between = 0.0000                                         avg =        3.0
     overall = 0.0313                                         max =          3

                                                Wald chi2(1)      =          .
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =          .

                                    (Std. Err. adjusted for 34 clusters in id)
------------------------------------------------------------------------------
             |               Robust
         dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       round |
          2  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
          3  |  -.0882353   .0656176    -1.34   0.179    -.2168434    .0403728
             |
       _cons |   .1176471   .0566497     2.08   0.038     .0066156    .2286785
-------------+----------------------------------------------------------------
     sigma_u |  .08618128
     sigma_e |  .21870357
         rho |   .1344086   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. testparm 2.round 3.round, equal

 ( 1)  - 2.round + 3.round = 0

           chi2(  1) =    0.00
         Prob > chi2 =    1.0000

. estadd scalar joint_test =r(p)

added scalar:
         e(joint_test) =  .99999998

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. esttab reg_time1 reg_time2 reg_time3 reg_time4 reg_time5 reg_time6 using "$working_ANALYSIS\results\Tables\revision_time_trend.rtf", keep(2.round 3.rou
> nd _cons) label se(%4.3f)  transform(ln*: exp(@) exp(@)) mgroups("Order 1: Base-Large-Small" "Order 2: Base-Small-Large", pattern(1 0 0 1 0 0)) mtitles
> ("Democratic" "Pseudo-democratic" "Dictator" "Democratic" "Pseudo-democratic" "Dictator") b(%4.3f) stats(N N_clust r2_o joint_test, fmt(0 0 3 3) labels
> ("Observations" "Cluster" "Overall R-squared" "Test: Round 2 = Round 3 (chi2)" )) star(* 0.10 ** 0.05 *** 0.01) varlabels(,elist(weight:_cons "{break}{
> hline @width}")) nonotes addnotes("Notes: Robust standard errors in brackets: * p < 0.10, ** p < 0.05, *** p < 0.01.") replace 
file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Paying for democracy\analysis\results\Tables\revision_time_trend.rtf is
    read-only; cannot be modified or erased
r(608);

end of do-file

r(608);

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. xtreg dem i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  =      .                                         min =          3
     between = 0.0042                                         avg =        3.0
     overall = 0.0026                                         max =          3

                                                Wald chi2(1)      =       0.27
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.6058

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dem |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      bonus_order |
Base-Small-Large  |  -.0490196   .0949952    -0.52   0.606    -.2352068    .1371676
            _cons |   .6666667   .0654721    10.18   0.000     .5383436    .7949897
------------------+----------------------------------------------------------------
          sigma_u |  .32252908
          sigma_e |  .36084392
              rho |  .44410846   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. xtreg fake i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  =      .                                         min =          3
     between = 0.0129                                         avg =        3.0
     overall = 0.0076                                         max =          3

                                                Wald chi2(1)      =       0.84
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.3605

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
             fake |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      bonus_order |
Base-Small-Large  |    .079085   .0864813     0.91   0.360    -.0904153    .2485852
            _cons |   .2444444   .0571067     4.28   0.000     .1325173    .3563716
------------------+----------------------------------------------------------------
          sigma_u |   .2858279
          sigma_e |  .35355339
              rho |  .39525178   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD3274_000000.tmp"

. xtreg dic i.bonus_order, vce(robust)

Random-effects GLS regression                   Number of obs     =        192
Group variable: id                              Number of groups  =         64

R-sq:                                           Obs per group:
     within  =      .                                         min =          3
     between = 0.0087                                         avg =        3.0
     overall = 0.0033                                         max =          3

                                                Wald chi2(1)      =       0.54
corr(u_i, X)   = 0 (assumed)                    Prob > chi2       =     0.4623

                                         (Std. Err. adjusted for 64 clusters in id)
-----------------------------------------------------------------------------------
                  |               Robust
              dic |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
      bonus_order |
Base-Small-Large  |  -.0300654   .0409038    -0.74   0.462    -.1102354    .0501047
            _cons |   .0888889   .0314929     2.82   0.005      .027164    .1506138
------------------+----------------------------------------------------------------
          sigma_u |  .07552496
          sigma_e |        .25
              rho |  .08363173   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
